{"title":"Meet_the_Gimp_Videopodcast_Episode_024_Winter_Morning","uid":3948896,"size":42575294,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0125e56141550e2418202f045381e77d42ab2c7d&amp;dn=Meet_the_Gimp_Videopodcast_Episode_024_Winter_Morning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"meetthegimp","files":1,"time":1198708547,"description":"Episode 25: A Winter Morning\n\n\nMeet the Gimp! is a weekly video podcast or tutorial about the Gimp graphics software from the viewpoint of a digital photographer. More information at http://meetthegimp.org\n\n\nA walk through the post processing of a calm and cold winter morning image is perhaps right for this time of the year.\n\nThis is 5 minutes away from my home, half way to my school. There are still cobblestones in the streets like in the 1870s, when this quarter of the city was developed. This is a lucky accident because this area got not much bombs in WWII and was left alone as an area for the expansion of the inner city after the war. So houses were cheap and got bought by young families with mostly intellectual background. As the planners were ready to build their high rises and 4 lane streets the people made such a fuss that the plans were scrapped.\n\nI changed the mood of the image by combining two different outputs from UFRaw. One with ?cold? colour temperature for the sky, the other warmer for the street. Then I combined both as two layers in one image, rotated both layers, added a layer mask for revealing the street in the lower layer, cloned away an ugly reflection or colour artefact, resized and sharpened with USM. ","torrent":{"xt":"urn:btih:0125e56141550e2418202f045381e77d42ab2c7d","amp;dn":"Meet_the_Gimp_Videopodcast_Episode_024_Winter_Morning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0125e56141550e2418202f045381e77d42ab2c7d","infoHashBuffer":{"type":"Buffer","data":[1,37,229,97,65,85,14,36,24,32,47,4,83,129,231,125,66,171,44,125]},"announce":[],"urlList":[]}}