{"title":"XBOX360.HD-DVDRom.UDF.Reader.v2.5.WindowsXP-BluePrint.rar","uid":3556739,"size":37750,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:0193ffddeb7b1d4c2d8516c396642377c4a45128&amp;dn=XBOX360.HD-DVDRom.UDF.Reader.v2.5.WindowsXP-BluePrint.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fa1rch1ld","files":1,"time":1163438201,"description":"&quot;BluePrint Presents&quot;\n\nThe Scoop:\n\nThe same day the XBOX360 HD-DVDROM Addon was released to the public in USA, we at blueprint figured out how to use it in windows, now as of this moment, officially, the movie that came with the hardware &quot;King Kong&quot; is currently a Dual Layer (30GB) disc so it would appear the studios are aiming for that size minimally for the majority of movies to start off with at least, this of course mean&amp;#039;s you will not be directly copying any hd-dvd&amp;#039;s as of yet. However, the most important thing is were now able to read the UDF (Universal Disc Filesystem) v2.5 which is currently used by the Toshiba Corp with there first generation HD-DVDRom drives. You can see the entire contents of the HD-DVD Media when in the drive. You can see the Label of the movie title next to the drive letter, you can copy the entire contents of the disc to your hdd, we have thus far only tested this in windows explorer, were anxious to hear about how folks take things from here, better methods of ripping the movies will come in the future, were also looking at the drives since there toshiba/samsung to possibly rip games in the future, of course thats not something were personally working on, but were pretty damn sure it will be possible. in any event, onto the direction&amp;#039;s for installation/recongizing your drives contents in windows xp sp2.\n\n\nThe Install:\n\nRight click on &quot;thdudf.inf&quot; and choose Install from the list of menu options. once this is complete, you should reboot your machine for a full installation of the new UDF 2.5 File system recognition. From here your drive should no longer just say CD-ROM when examining it in windows.\n\n** Notes **\n\nAgain, these are litterally Toshiba Corp drivers for the file system used with HD-DVD. We did not create these drivers ourselves, so we cannot modify them, however there availability is limited to specific machines which were familiar with from our places of business, and we will continue to get the latest updates of these drivers and make them available to you as they&amp;#039;re released to us.\n\nIf you would like to contact us about possibily contributing to the cause you can find us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;73031a1f1401121e33141e121a1f5d101c1e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; please label the subject matter very specificly or your email will likely be over looked or even disreguarded due to the volume of questions we will recieve. we do not offer you any files via email. and you are on your own as far as getting these movies are concerned. Good luck to all of you who will take it from here and write some nice applications to use these methods more efficiently we anxiously await your mail.\n\nThis would be possible with our Mosb3rg and Watchy thanks very much guys your speed on cracking this was pretty amazing and also thanks for spending the money upfront so everyone else could enjoy there addon much more than if they just purchased before hand without this information.\n\nwww.chipit.se","torrent":{"xt":"urn:btih:0193ffddeb7b1d4c2d8516c396642377c4a45128","amp;dn":"XBOX360.HD-DVDRom.UDF.Reader.v2.5.WindowsXP-BluePrint.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0193ffddeb7b1d4c2d8516c396642377c4a45128","infoHashBuffer":{"type":"Buffer","data":[1,147,255,221,235,123,29,76,45,133,22,195,150,100,35,119,196,164,81,40]},"announce":[],"urlList":[]}}