{"title":"[Kung Fu] Crazy Horse And Intelligent Monkey (Chi Kuan Chun, 198","uid":3961468,"size":433364811,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01d38993641f9ad86107ff192758c8409423cea7&amp;dn=%5BKung+Fu%5D+Crazy+Horse+And+Intelligent+Monkey+%28Chi+Kuan+Chun%2C+198&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":2,"time":1199476511,"description":"Guys/Gals,\n\nHappy new year to you and yours!\n\nI have reached and exceeded the limits of my seeding capabilities, burning my PC&amp;#039;s CPU in the process due to overheating, and I cannot remain effective in uploading and seeding simultaneously anymore.\nRest assure, the Fu will remain alive. From today onwards, I will keep posting new releases via a new referral, with direct download, at:  &lt;a href=&quot;\nhttp://www.fuflixbulletin.net/bulletin/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fuflixbulletin.net/bulletin/&lt;/a&gt;\n\nThe remaining of today&amp;#039;s releases are also available via the above referral.\n\nWe hope that you will come and visit us soon.\n\n---\n\n[Kung_Fu]_Crazy Horse And Intelligent Monkey (Chi Kuan Chun, Candy Wen Xue Er, 1982) EN - DVD/Rmvb\n\nOverview: \nChi, who is looking for his mother, starts to fight some gamblers in a misunderstanding and saves a little bald guy (Hon Kwok Choi). The baldy, who?s homeless, accompanies him in search of the mother. When they?re short of money, baldy tries to steal from a guy and gets beaten up. Later the same guy, which name turns out to be Mr Lee, saves them from a fight. Soon they get to his mother?s house but only his uncle Chu (Chu Te Hu) is there. After a couple of nights a mysterious man attacks his uncle?s house and Chi recognises him (Mr Lee). His mother doesn?t appear and he starts getting worried. Later a gang of thugs that are after some money, enter the house and start harassing his uncle.\n\nWho are they? Is his uncle the man he thinks? Why did Mr Lee attack the house? And where the hell is his mother?\n\nThis is a tiny better than &quot;Chinese Shaolin Fist&quot; (doesn?t say much), which I saw at the same time and stars Chi Kuan Chun as well.\n\nThe plot of a son in search of a disappeared mother could?ve been done much better and more entertaining.\n\nAt the end Chi invents Horse Boxing when his friend drops a bottle of wine in a horses water and the horse goes mad (drunk). Chi does some (one or two) effective hand techniques but seems to make up a lot of moves by himself.\n\nMr Lee is actually a girl, but as she dressed up as a guy the two morons didn?t realise that until the end (Uhh, are you a girl?). Hon Kwok Choi learns Monkey Boxing (actually, how to summersault through some rings). He looks so dumb with that bald head with a little hair on his forehead, and his character is a real moron. Actually, this little guy cameos in &quot;Duel to the Death&quot; seen in the jungle as the crazy master with the parrot.\nAnother thing, uncle Chu?s full name is actually &quot;Double Phoenix Ghost Palm Chu&quot; (a little long isn&amp;#039;t it?).\n\nCast: \nChi Kuan Chun, Chiang Kam, Chow Kong, Chu Tiet Wo, Hon Gwok Choi, Kwan Hoi San, Lau Hok Nin, Candy Wen Xue Er, Wong Kwong Yue, Ringo Wong Chi Ming\n","torrent":{"xt":"urn:btih:01d38993641f9ad86107ff192758c8409423cea7","amp;dn":"%5BKung+Fu%5D+Crazy+Horse+And+Intelligent+Monkey+%28Chi+Kuan+Chun%2C+198","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d38993641f9ad86107ff192758c8409423cea7","infoHashBuffer":{"type":"Buffer","data":[1,211,137,147,100,31,154,216,97,7,255,25,39,88,200,64,148,35,206,167]},"announce":[],"urlList":[]}}