{"title":"A.Knight.in.Camelot.1998.NTSC","uid":3706740,"size":4519937473,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:03555cb845c417324b3a4db3eb2fc607c8f13463&amp;dn=A.Knight.in.Camelot.1998.NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"007craft","files":13,"time":1181117551,"description":"Hello.  I present to you A Knight in Camelot starring Whoopi Goldberg.  Now being the time travel nut that I am, I couldent accept the fact that there was a movie based on time travel that was released in the PAL format but not in NTSC.  So I went and converted the movie over to NTSC and even re-did the menus.  I see alot of PAL-NTSC conversions around and people just cut out the menu.  For shame.\n\nI did not include Subtitles as I was unfarmiliar with the process, but I did rip and keep them from the PAL version when I did it long ago.  Those are included in the torrent for you to add yourself if you choose (you will need to change the Frame rate of the subs too btw).  I also photoshopped the menus to reflect the non inclusion of subs.  Movie was originally a DVD 5 and I cannot remember the bit-rate I used in the conversion process, but I remember it was high.  The movie looks untouched from the PAL version.  All 3 languages remain intact.  I also included a cover which I quickly photoshopped to look more NTSC like.  Fullscreen just like originally released.\n\nSo enjoy this never before released movie in N.A., now in NTSC.","torrent":{"xt":"urn:btih:03555cb845c417324b3a4db3eb2fc607c8f13463","amp;dn":"A.Knight.in.Camelot.1998.NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03555cb845c417324b3a4db3eb2fc607c8f13463","infoHashBuffer":{"type":"Buffer","data":[3,85,92,184,69,196,23,50,75,58,77,179,235,47,198,7,200,241,52,99]},"announce":[],"urlList":[]}}