{"title":"The Market for Liberty","uid":3948600,"size":359358592,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:04c3f48fe2c18e7e5a258d537d6d255f8cbeeada&amp;dn=The+Market+for+Liberty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FTL_Ian","files":18,"time":1198691397,"description":"FreeKeene.com presents &quot;The Market for Liberty&quot;\n\n\nGovernment: An Unnecessary Evil\n\nThere was once a time when it was widely believed the world was flat and the sun revolved around the earth.  Now we know better and most reasonable people have rejected these ideas.  Similarly, most people have rejected the once widely accepted idea of slavery, and rightfully so.  If you&amp;#039;re like most people, your government high school history classes probably taught you that slavery was abolished years ago.  Government people wouldn&amp;#039;t lie to you, would they?\n\nThe book you are about to listen to explodes the myths of government.  Its message is simple:\n\n?Government is an unnecessary evil and freedom is the best and most practical way of life.?  Spread this idea, and we can change the world.  That is why I&amp;#039;ve taken the time to create this audio book.  These days, many people do not have time to read and it would be a shame to allow such a brilliant work to continue to gather dust on the shelves of history.\n\nMorris and Linda Tannehill?s iconoclastic &quot;The Market for Liberty&quot; is one of the most important books of our time.  Written originally in 1970, it is even more relevant now as I record it as an audio book at the end of 2007.  &quot;The Market for Liberty&quot; is the antidote to years of government indoctrination, lies, and misinformation.\n\nUnless you already consider yourself a voluntaryist, anarcho-capitalist, or free marketeer, prepare yourself for a major paradigm shift.\n\nWell over a quarter century old, &quot;The Market for Liberty&quot; stands up well to the test of time.  There are only a few places where the book dates itself, like any reference to prices, considering the federal governmentt has substantially inflated the money supply since it was written. There are also a few dated historical references particularly in chapters 15 and 16 as since this book?s publishing the Soviet Union has been broken up, the draft has been suspended, Americans are now able to own gold, and the US dollar has no more metal backing.\n\nI hope you enjoy this book as much as I did.  Please don&amp;#039;t keep it to yourself.  The good people at Laissez-Faire Books have graciously allowed me to release &quot;The Market for Liberty&quot; in this audio book format for free.  Please spread these audio files far and wide.\n\nIn the final part of the book, the Tannehills point out that the two variables factoring into how soon a laissez-faire society can be established are, ?the rapidity with which the idea of freedom can be spread and how much longer our economy can withstand the effects of governmental meddling?.  Certainly no one can predict the latter but in this information age, the rapidity factor has been virtually eliminated. Thanks to the proliferation of the Internet and personal audio players, this brilliant work can finally get the attention it deserves.\n","torrent":{"xt":"urn:btih:04c3f48fe2c18e7e5a258d537d6d255f8cbeeada","amp;dn":"The+Market+for+Liberty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04c3f48fe2c18e7e5a258d537d6d255f8cbeeada","infoHashBuffer":{"type":"Buffer","data":[4,195,244,143,226,193,142,126,90,37,141,83,125,109,37,95,140,190,234,218]},"announce":[],"urlList":[]}}