{"title":"Planet Earth Disc 1-OnlyMe1","uid":3957566,"size":4695651361,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:051b16ee85f38ace2f3d011722e521ec0e2b6244&amp;dn=Planet+Earth+Disc+1-OnlyMe1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"abqwerty","files":18,"time":1199250730,"description":"Planet Earth BBC Series With David Attenborough\n\nReady to Burn to DVD\n\n3 Episode\n\nEpisode 1: From Pole to Pole\n\nThe lives of animals and plants are dominated by the sun and fresh water which trigger seasonal journeys. The latest technology and aerial photography enable the Planet Earth team to track some of the greatest mass migrations.\n\nIn the Arctic spring, a mother polar bear and cubs emerge from their winter den. They have just two weeks to cross the frozen sea before it melts and they become stranded. Share the most intimate and complete picture of polar bear life ever filmed. Further south, time-lapse cameras capture the annual transformation created by the Okavango floods.\n\n\nEpisode 2: Mountains\n\nTour the mightiest mountain ranges, starting with the birth of a mountain at one of the lowest places on Earth and ending at the summit of Everest.\n\nOne of Earth&amp;#039;s rarest phenomena is a lava lake that has been erupting for over 100 years. The same forces built the Simian Mountains where troops of gelada baboons live, nearly a thousand strong. In the Rockies, grizzlies build winter dens inside avalanche-prone slopes. The programme also brings us astounding images of a snow leopard hunting on the Pakistan peaks, a world first.\n\nEpisode 3: Freshwater\n\nFresh water defines the distribution of life on land. Follow the descent of rivers from their mountain sources to the sea. Watch spectacular waterfalls, fly inside the Grand Canyon and explore the wildlife in the world&amp;#039;s deepest lake.\n\nPlanet Earth captures unique and dramatic moments of animal behaviour: a showdown between smooth-coated otters and mugger crocodiles; deep-diving long tailed macaques; massive flocks of snow geese on the wing and a piranha frenzy in the perilous waters of the world&amp;#039;s largest wetland.","torrent":{"xt":"urn:btih:051b16ee85f38ace2f3d011722e521ec0e2b6244","amp;dn":"Planet+Earth+Disc+1-OnlyMe1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"051b16ee85f38ace2f3d011722e521ec0e2b6244","infoHashBuffer":{"type":"Buffer","data":[5,27,22,238,133,243,138,206,47,61,1,23,34,229,33,236,14,43,98,68]},"announce":[],"urlList":[]}}