{"title":"Nemozian Rasta - Midnite-I Grade","uid":3568071,"size":112237080,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0562e7b9b86463565fc9751b95ca1c16780b6081&amp;dn=Nemozian+Rasta+-+Midnite-I+Grade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fb-","files":16,"time":1164917859,"description":"Hailing from the Island of St Croix, Midnite is one of the most promising roots reggae bands of the millennium. They are vanguards of conscious reggae who represent the King&amp;#039;s and Queen&amp;#039;s music to the fullness of Jah. Midnite&amp;#039;s profound and innovative lyrics are sincere and deeply rooted to present the other half of the story. Lead singer Vaughn Benjamin&amp;#039;s electrifying voice seems an amalgamation of many great voices in reggae- soulful, chanting, edgy. Vaughn&amp;#039;s potent lyrical style and his brother Ron&amp;#039;s exquisite keyboards and musical directorship form the nucleus of this musical quintet, which includes fellow St. Croix players Dion Hopkins (drums), Philip Merchant (bass) and Abijah (guitar). Midnite weaves the cultural lyrics of &quot;old school&quot; roots music with modern day experiences to create a unique listening encounter. Reggae - naked and raw is an apt description for Midnite&amp;#039;s &quot;classic roots&quot; musical style, in which they forgo the frills of extensive remixes, overdubbing and other musical refinements. &quot;Unpolished&quot; is the suitably named title of their debut album released in 1997, while the band was located in Washington, D.C. In 1999, Midnite linked up with Wildchild! Records for their second release &quot;Ras Mek Peace&quot;. Incredibly, this album was recorded using only two channels and was mastered without any reverb, filtering, compression or equalization. Songs like &quot;Hieroglyphics&quot;, in which graffiti is likened to ancient Egyptian hieroglyphics, showcase the intelligent songwriting that pervades all of Midnite&amp;#039;s works. Following the release of &quot;Ras Mek Peace&quot;, Midnite returned to live in St. Croix so that they could work with the local musicians and make recordings at their African Roots Lab without any outside interference. The fruits of these labours can be found on &quot;Jubilees Of Zion&quot;, which was released on their own independent Midnite Roots record label. Their next album &quot;Seek Knowledge Before Vengeance&quot; raises the bar of cultural roots reggae, as we know it today. Armed with a firm foundation in Jah Rastafari, their natural talents, and a strong and uncompromising musical vision, Midnite champions an old-school sound that is right on the cutting edge of modern roots music.\n&quot;Nemozian Rasta&amp;#039; was released in 2001, the title &amp;#039;Nemozian&amp;#039; referring to the Greek goddess of memory who gave birth to the Muses. Most of the tracks included here feature the incredible singer Vaughn Benjamin on lead vocals, except for the tunes Most High, Right Direction and Sing Out on which female vocalist Dezarie takes over in her unique style. Their peerless roots and culture sound is as strong as ever. On this album Midnite takes you back to the early days of the masters of roots reggae, Burning Spear and Max Romeo. Musically the band is in topform, seeking for new musical horizons with tunes like If I Betray and, across the same riddim, Dezarie&amp;#039;s Right Direction, Black Congo and Enough For Everyone.\nWith &quot;Nemozian Rasta&quot; Midnite has delivered a unique deep roots reggae album. Ignore at your peril!!\n","torrent":{"xt":"urn:btih:0562e7b9b86463565fc9751b95ca1c16780b6081","amp;dn":"Nemozian+Rasta+-+Midnite-I+Grade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0562e7b9b86463565fc9751b95ca1c16780b6081","infoHashBuffer":{"type":"Buffer","data":[5,98,231,185,184,100,99,86,95,201,117,27,149,202,28,22,120,11,96,129]},"announce":[],"urlList":[]}}