{"title":"National Geographic Inside The Forbidden City Secrets PDTV XviD","uid":3609956,"size":366718976,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0598c9ab947a7f4b033ea0654d6b3b1ce3483304&amp;dn=National+Geographic+Inside+The+Forbidden+City+Secrets+PDTV+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PropAgenda","files":1,"time":1170519924,"description":"The Forbidden City, for 500 years the capital of the Chinese empire, lies in the heart of Beijing. From 1420 to 1912, it was home to 24 Chinese emperors. More than a residential palace, it was a city within a city, the seat of a vast bureaucratic government that ruled what is now the world&amp;#039;s most populated area. Rumoured to have 9,999 rooms, the Forbidden City is the world&amp;#039;s largest palace complex. For centuries access was denied to all but the emperor, his family and his most senior officials and servants. Then, at the beginning of the 20th century, the last emperor abdicated, marking the death of a dynasty. When the palace was reopened as a museum in 1925, such was the crush of visitors that there were traffic jams in Beijing. Between the Japanese aggression of 1931 and WWII, the palace fell into calamitous disrepair. Renovations began in the 1950s and today the palace buildings, constructed almost entirely of wood, have together been recognised by the United Nations as a World Heritage site. A huge restoration project, taking place 600 years after the start of construction of the original building, is underway today. Now, with unprecedented access, enter the heart of the greatest palace on Earth to discover the magnificent buildings and the secrets they reveal of those who lived here.","torrent":{"xt":"urn:btih:0598c9ab947a7f4b033ea0654d6b3b1ce3483304","amp;dn":"National+Geographic+Inside+The+Forbidden+City+Secrets+PDTV+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0598c9ab947a7f4b033ea0654d6b3b1ce3483304","infoHashBuffer":{"type":"Buffer","data":[5,152,201,171,148,122,127,75,3,62,160,101,77,107,59,28,227,72,51,4]},"announce":[],"urlList":[]}}