{"title":"4U WMA MP3 Audio Converter v5.6.0","uid":3586911,"size":6380398,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:064c80168b110241a9c8ec526a5cbf938e0d0280&amp;dn=4U+WMA+MP3+Audio+Converter+v5.6.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Yojikinz","files":3,"time":1167551636,"description":"4U WMA MP3 Converter is a wma to mp3 converter to convert audio files between various formats and edit ID3 tags in MP3, WMA, WAV, OGG or VOX files with a right click. 4U WMA MP3 Converter converts MP3, WAV, WMA, OGG or VOX from one to another, 4U WMA MP3 Converter can also convert MPC, AVI, MP1, MP2, MPA, g721, g726, g723 or RAW to MP3, WAV, WMA, OGG, or VOX formats, and normalize MP3 to MP3, WMA to WMA, WAV to WAV, OGG to OGG, VOX to VOX.\n\nIn addition, 4U WMA MP3 Converter includes ID3 tags Editor and Audio Player. 4U WMA MP3 Converter enables you to edit ID3 tags for MP3, MA, WAV or OGG files, and play MP3, WMA, WAV, OGG, VOX, MPC, AVI, MP1, MP2, MPA, g721, g726, g723 or RAW files.\n\nFinally, 4U WMA MP3 Converter gives you the abilitys to finish above operations with a simple right click on Windows Explorer. and also supports command line for advanced users.\n\nThis application can:\n\n    *\n      Convert MP3, WAV, WMA, OGG and VOX files from one to another.\n    *\n      Convert MPC, AVI, MP1, MP2, MPA, g721, g726, g723 or RAW to MP3, WAV, WMA, OGG, or VOX formats.\n    *\n      Support normalizing of MP3 to MP3, WAV to WAV, WMA to WMA, OGG to OGG, VOX to VOX.4)\n    *\n      Play MP3, WMA, WAV, OGG, VOX, MPC, AVI, MP1, MP2, MPA, 721, g726, g723 or RAW files.\n    *\n      Edit ID3 tags for MP3, WMA, WAV or OGG files.\n    *\n      More...","torrent":{"xt":"urn:btih:064c80168b110241a9c8ec526a5cbf938e0d0280","amp;dn":"4U+WMA+MP3+Audio+Converter+v5.6.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064c80168b110241a9c8ec526a5cbf938e0d0280","infoHashBuffer":{"type":"Buffer","data":[6,76,128,22,139,17,2,65,169,200,236,82,106,92,191,147,142,13,2,128]},"announce":[],"urlList":[]}}