{"title":"ST:TNG Star Trek: The Next Generation - S07E15 - Lower Decks","uid":3541884,"size":179599601,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0670a1faad7fb92d87b36a65efddbc2326c0bb5c&amp;dn=ST%3ATNG+Star+Trek%3A+The+Next+Generation+-+S07E15+-+Lower+Decks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jxself","files":1,"time":1161213775,"description":"Synopsis: With crew evaluations underway, tension runs high among four junior officers, Alyssa Ogawa, Sam Lavelle, Sito Jaxa and Taurik. Things get worse when a waiter friend, Ben, approaches the group and tells them Sito and Lavelle are up for the same position. This seems to rattle Sito, who later performs poorly during a drill. Over in Engineering, Taurik shows Geordi a new computer simulation he developed, but Geordi seems annoyed rather than impressed with the young Vulcan\\&amp;#039;s skills. Only Ogawa seems to be breezing through the process, as Beverly tells her she will be recommended for promotion. The friends gather to talk about their progress, and Lavelle speculates that Riker dislikes him. Ben suggests that Lavelle try to talk to the officer like a person, but his attempts to make small talk fail miserably.\n\nSuddenly, Worf detects an escape pod just within Cardassian space, and Picard orders the crew to attempt to transport the passenger to the Enterprise. Geordi and Taurik get to work, and finally, the passenger is transported aboard, but only the senior officers are allowed to see the traveler, prompting speculation among the junior group. In the midst of this, Picard summons Sito, and interrogates her about her involvement in a Starfleet Academy cover-up three years earlier ? an incident she has been trying desperately to live down. Sito is unable to defend herself, and the captain dismisses her.\n\nMeanwhile, Beverly summons Ogawa to Sickbay, where she reveals that the pod\\&amp;#039;s injured passenger is a Cardassian male. She swears Ogawa to secrecy about what she has seen, and Ogawa manages to keep the secret that night when she joins her fellow junior officers for a poker game. Soon, the group\\&amp;#039;s speculation about their mission changes to speculation about their own chances for promotion. Meanwhile, the senior staff also discusses the candidates, and Riker reveals his misgivings about both Sito and Lavelle.\n\nLater, Worf puts Sito to a martial arts test where he promptly blindfolds her and attacks her. Sito immediately rips off her blindfold and tells him this test is unfair, and a pleased Worf reveals that this was actually a way to encourage Sito to stand up for herself when she is unfairly judged. Empowered, she meets with Picard and expresses her feeling that it is unfair that he judge her on something she did three years ago. Picard reveals that the real purpose of the difficult meeting was to test Sito\\&amp;#039;s readiness for a secret mission, and he asks her to join the senior staff at a briefing, where she meets Joret Dal, the injured Cardassian. Picard reveals that they must get Joret, who is a Federation operative, back to Cardassia. The plan is to have Joret pretend to \\&quot;hijack\\&quot; a shuttlecraft and have Sito, a Bajoran, pose as his prisoner to get past the border. After Joret is safe, Sito will return to Federation space in an escape pod. Picard tells Sito that she can turn down the dangerous mission, but she agrees to participate.\n\nSito and Joret set off on the shuttlecraft, and the other junior officers, knowing only the small bits of information that they do, worry intensely about their friend. On the bridge, Lavelle assists in a search for Sito\\&amp;#039;s missing escape pod. He is shocked and saddened when the remains of the vessel are found, and Picard announces that the brave young ensign was lost in the line of duty. His competition removed, Lavelle wins his promotion, but does so with the sad realization of the price that has been paid.","torrent":{"xt":"urn:btih:0670a1faad7fb92d87b36a65efddbc2326c0bb5c","amp;dn":"ST%3ATNG+Star+Trek%3A+The+Next+Generation+-+S07E15+-+Lower+Decks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0670a1faad7fb92d87b36a65efddbc2326c0bb5c","infoHashBuffer":{"type":"Buffer","data":[6,112,161,250,173,127,185,45,135,179,106,101,239,221,188,35,38,192,187,92]},"announce":[],"urlList":[]}}