{"title":"Dogma (1999) (German, English, DVD-Rip, H.264, AC3-A52 5.1, Germ","uid":3567558,"size":1791237713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07245541c747740b03f44c66ce724fa8b6d33b37&amp;dn=Dogma+%281999%29+%28German%2C+English%2C+DVD-Rip%2C+H.264%2C+AC3-A52+5.1%2C+Germ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nine99","files":3,"time":1164847070,"description":"Dogma (1999)\n\nLanguage: German, English\nQuality: DVD-Rip\nContainer: Matroska (MKV)\nVideo-Codec: H.264\nAudio-Codec: AC3-A52 5.1\nSubtitles: German\nExtras: Chapters\n\nPlot:\nTwo fallen angels ? Bartleby (Affleck), who is a Grigori, and Loki (Damon), formerly the Angel of Death ? were banished by God to spend all eternity in a place worse than Hell, namely Wisconsin after Loki, who&amp;#039;d just slaughtered the first born in Egypt (The Tenth Plague), got drunk, and was convinced by Bartleby to resigning as the Angel of Death. He renounced God, by giving Her the finger as he walked out. Azrael (Lee), a demon (and fallen muse) with a hidden agenda, secretly sends the duo a newspaper article about a church in New Jersey, where a Cardinal (Carlin) has declared a blanket amnesty in the form of a plenary indulgence (a perennial misunderstanding of the term) and initiated a contemporary Catholic image campaign--&quot;Catholicism Wow!&quot;, with the &amp;#039;happier&amp;#039; savior: Buddy Christ! --in celebration of the centennial anniversary of his church. This would allow them to return to heaven, but since amnesty for these fallen angels would necessarily constitute overruling the word of God (Alanis Morissette, in a cameo role), the result would be not just the end of the world, but the annihilation of all creation.\n\nThe angel Metatron (Rickman), the Voice of God, appears to abortion clinic worker Bethany (Fiorentino) and tells her she is the Last Scion, the last living descendant of Mary and Joseph, and thus the lost living relative of Jesus Christ, and gives her the job of stopping them. She is aided by Rufus (Rock), the thirteenth apostle who was left out of the Bible because he was black; Serendipity (Hayek), a writers-blocked muse turned stripper; and the prophets Jay and Silent Bob (Mewes and Smith).\n\nReleased by Nine99","torrent":{"xt":"urn:btih:07245541c747740b03f44c66ce724fa8b6d33b37","amp;dn":"Dogma+%281999%29+%28German%2C+English%2C+DVD-Rip%2C+H.264%2C+AC3-A52+5.1%2C+Germ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07245541c747740b03f44c66ce724fa8b6d33b37","infoHashBuffer":{"type":"Buffer","data":[7,36,85,65,199,71,116,11,3,244,76,102,206,114,79,168,182,211,59,55]},"announce":[],"urlList":[]}}