{"title":"WindowBlinds 6.0 Enhanced [Build 49]","uid":3833906,"size":15941015,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:087f2e8a95f768039933ccc62a1c73dd9a65a464&amp;dn=WindowBlinds+6.0+Enhanced+%5BBuild+49%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zz4spd","files":1,"time":1191818499,"description":"WindowBlinds is a one-of-a-kind utility that allows Windows users to completely change the look and feel of the Windows interface by applying a new skin. There are thousands of different skins to choose from that are freely downloadable from the WindowBlinds website.\n\nA WindowBlinds skin can make Windows look like an alternative operating system, like their favorite sports or car brand, or something completely new. Because WindowBlinds uses the latest hardware acceleration features of modern video cards, WindowBlinds won&amp;#039;t slow down your computer and uses very little memory.\n\nWindowBlinds is safe and easy to use. It doesn&amp;#039;t alter any system files and users can switch between the default Windows look and feel and a custom WindowBlinds skin with the click of a button. In addition, WindowBlinds has been tested to ensure it works with Windows Vista, so you know it is compatible, reliable, and more secure.\n\nFeatures:\n* New start menu animation support\n* Category filtering on skins in wbconfig\n* Tag filtering on wallpapers in wbconfig\n* Random skin support\n* The ability to save a re-coloring of a skin as a preset\n* Advanced HSL re-coloring where you pick a single color and a range in a skin and  you can just change that color instead of the entire skin\n* Ability to edit the system colors from wbconfig\n* Ability to change skin fonts from wbconfig\n* Ability to control transparency and blur on start menu, menus, taskbar &amp; window frames. Has some limitations on XP\n* Ability to save such changes as a preset\n* Vista-Ize me function which sets some defaults to have a more vista like look\n* Ability to skin the sidebar\n* Ability to edit a sidebar skin from within wbconfig\n* Improved WB skin install when handling upgrades of skins\n* Ability to alter the mouse over animation speed\n* Ability to alter the default button pulsing speed\n* Support for explorer background bitmaps\n* Ability to use the Aero frames with the rest of the skin\n* Blur support in title bars (and menus on vista)\n* Lots of new sections for new Vista specific parts\n* Including IE navigation arrows, IE tabs, start menu shutdown/lock buttons\n* Skins virtually every aspect of the Windows GUI\n* Clean and easy configuration dialog.\n* Tons of configuration options for users\n* Animation supported on titlebars, buttons, and many other elements.\n* Change the color of any visual style on the fly\n* Per-application visual styles\n* Doesn&amp;#039;t alter any system files\n* Safe, reliable way to change the look and feel of Windows\n\nSystem Requirements:\n* Windows Vista (32-bit and 64-bit)\n* Windows XP (32-bit)\n* Windows 2003 (32-bit)\n* 1GHz or faster processor recommended\n* 120MB free drive space\n* 256MB RAM\n* Note: A 16MB DirectX 8 or later compatible video card with appropriate driver support is required for per-pixel alpha-blended skins. Some integrated graphics solutions and lower-end cards from before 2004 may not be able to use per-pixel skins.\n* On Windows Vista a DWM capable video card is required for per pixel skinning.\n\n\nINSTALLATION - Completely uninstall any previous WB version prior to install WB6.\n************\n\n1) Go to SID Folder and run NewSID.exe, change your system SID [option#3] to this \n\none:  S-1-5-21-1491950412-2009852829-4049741679 \n\nDo not interfere, let it finish then reboot.\n\n2) Install the windowblinds600_enhanced.exe, no reboot, cancel any activation \n\npopups, shut down WindowBlinds and using taskmanager, kill remaining WB processes.\n\n3) Copy sig6.bin to the Stardock/Object Desktop/WindowBlinds folder in the Programs \n\nFiles directory.\n\n4) Restart WB6 via Start Menu, It should say it needs to reboot, allow it.\n\n5) WindowBlinds 6 should now be registered, check WindowBlinds Configuration/About \n\nto verify.\n\n\nNot all skins will work, many will have glitches with WB6.\n\n","torrent":{"xt":"urn:btih:087f2e8a95f768039933ccc62a1c73dd9a65a464","amp;dn":"WindowBlinds+6.0+Enhanced+%5BBuild+49%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087f2e8a95f768039933ccc62a1c73dd9a65a464","infoHashBuffer":{"type":"Buffer","data":[8,127,46,138,149,247,104,3,153,51,204,198,42,28,115,221,154,101,164,100]},"announce":[],"urlList":[]}}