{"title":"The Omega Syndicate - Horsemen On The Horizon (New Age Space, 20","uid":3552101,"size":149759939,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0952fd8ce2f3d775a302b9ee45102b1a9c7221da&amp;dn=The+Omega+Syndicate+-+Horsemen+On+The+Horizon+%28New+Age+Space%2C+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jamestown1","files":13,"time":1162769371,"description":"Album Information\n===================\n Album:               Horsemen On The Horizon\n Artist:              The Omega Syndicate\n Year:                2006\n Genre:               New Age Spacemusic\n\nFile Information\n================\n Encoded With:        LAME 3.90.3 --alt-preset extreme -m s\n Encoded At:          VBR 240-261 kbit/s 44 KHz Stereo\n ID3 Tags:            Set, v1.1, v2.3\n Cover Images:        Front, Back, Booklet &amp; Cd\n \nTrack Listing:\n==============\n  1 ( 16:46) - (VBR 240) Kriegspiel\n  2 ( 17:56) - (VBR 261) Equilibrium of Injustice\n  3 ( 17:39) - (VBR 244) Yersinia&amp;#039;s Release\n  4 ( 13:37) - (VBR 255) Harbinger\n  5 ( 12:49) - (VBR 248) Dark Skies\n=============\n Number of Files: 5\n Total Duration:  1:18:47\n Total Size:      140.74 MB\n\n NFO Created:     26-Oct-2006  17:04:15, by Randy\n\n NFO created by: Mp3BookHelper http://mp3bookhelper.sourceforge.net/\n\nThis is the CD of the band&amp;#039;s &amp;#039;Awakenings&amp;#039; performance on the 8th July. All the tracks except the encore are new material - and excellent they are too! Heavenly soft choral pads mix with twittering effects. What a beautiful way to start the album and the opening track &amp;#039;Kreigspeil&amp;#039;. A slow delicate sequence starts up- subtlety being the order of the day. In the background a feeling of menace is developing, heightened by guitar stabs. Another sequence comes in but things are still rather strained with the feeling of pent up power increasing all the time. Things start to let rip in the seventh minute, becoming quite euphoric. Loads is going on with sequences, mellotron and synths working in harmony weaving wonderful melodies, the guitar adding extra bite low in the mix, like a storm heard from far away. There is no chance of monotony here as the guys do a tremendous job holding it all together from one tremendous moment to the next. \n\nThe quality continues straight through to &amp;#039;Equilibrium of Injustice&amp;#039;. First one sequence then another shimmer round each other, like rays of light glistening through a waterfall. Yet another excellent sequence starts up adding to the momentum still further, becoming like an intense laser turning the water into steam. The heat increases as the guitar enters. A soft lead line adds some contrast (maybe could have been a little lower in the mix). A stronger repeated melody appears in the ninth minute then a scything lead line really lets rip- wonderful stuff. Tron returns to give the leads a breather before fresh lead lines give it the full treatment. We finish with a moody processed piano solo. The sequences strike up immediately for &amp;#039;Yersinia&amp;#039;s&amp;#039;. Yet another stonking melody comes to join it, nestling nicely amongst further tron sounds. Little guitar touches add to the interest, weaving a lovely spell, as the sequence morphs superbly adding extra oomph to an already blistering track. Things become even more syncopated. An organ sound enters. One of their very best tracks. \n\nNot to break with tradition &amp;#039;Harbinger&amp;#039; also goads the old sequencer into life, pulsing along gently over relaxed mellotron. Rhythm adds to the energy, imparting a little moodiness, whilst laser sharp lead lines flash from the speakers. The guitar is let off the leash near the end to really let rip. It all becomes rather heady and trippy. Yet another winner. We finish with the encore. An oldie but a goodie in the form of &amp;#039;Dark Skies&amp;#039; but this time a condensed twelve minute version. It punches an even bigger punch than before with enough differences about it to make it well worth another outing. \n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0952fd8ce2f3d775a302b9ee45102b1a9c7221da","amp;dn":"The+Omega+Syndicate+-+Horsemen+On+The+Horizon+%28New+Age+Space%2C+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0952fd8ce2f3d775a302b9ee45102b1a9c7221da","infoHashBuffer":{"type":"Buffer","data":[9,82,253,140,226,243,215,117,163,2,185,238,69,16,43,26,156,114,33,218]},"announce":[],"urlList":[]}}