{"title":"Gregorian - The Masterpieces (DVD)","uid":3591113,"size":4681718729,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a2a011b9e826e7379954e40aaab897216dcb21f&amp;dn=Gregorian+-+The+Masterpieces+%28DVD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dynamic50","files":20,"time":1168114881,"description":"Gregorian - The Masterpieces (DVD)\nLive in Prague\n\nWith Gregorian's remarkable success in this last decade it was inevitable that a greatest hits collection would finally be released. But collecting their most famous renditions on one CD will not necessarily entice long-time fans to purchase the new release if they already own all the previous albums. So Frank Peterson and Edel Records approached this in a similar way to their recent greatest hits release for Sarah Brightman: besides the single-CD edition, they've simultaneously made available a new DVD of one of the group's live shows. This, of course, is the truly exciting feature and makes the purchase essential for any fan of the group. To date, all the previous Gregorian DVDs have consisted of carefully constructed performances in exotic locations, so this is the first time we witness one of their renowned live shows in official recorded format. And, true to Edel's high-quality standards, the concert is brilliantly filmed for DVD in widescreen with a host of audio channels including a wonderful Dolby Digital 5.1 to the inspiring DTS surround mix. The lengthy 17-track, 80-minute show will please old and new fans alike, shot on the moody stage of one of the Prague concerts. The CD release contains two live-tracks, which are not featured on the DVD. Perhaps the only disappointment is that Losing My Religion and Still I'm Sad were not performed in this concert, however with the wealth of tracks that Gregorian now have in their repetoire this is understandable. The cover of the new album lists this as &quot;Decade 1&quot; for the group - so we can only look forward to even more beautiful music ahead.\n\n\n01. The Dark Opening  \t\n02. Brothers in Arms \t\n03. Tears in Heaven \t\n04. Nothing Else Matters \t\n05. Wish You Were Here \t\n06. Only You \t\n07. Close My Eyes Forever \t\n08. Voyage Voyage \t\t\n09. Hurt \t\n10. Blue Monday \t\n11. Where the Wild Roses Grow \t\n12. The Raven \t\n13. Flame Interlude \t\n14. Angels \t\n15. More \t\n16. Moments in Peace \t\n17. Hymn","torrent":{"xt":"urn:btih:0a2a011b9e826e7379954e40aaab897216dcb21f","amp;dn":"Gregorian+-+The+Masterpieces+%28DVD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2a011b9e826e7379954e40aaab897216dcb21f","infoHashBuffer":{"type":"Buffer","data":[10,42,1,27,158,130,110,115,121,149,78,64,170,171,137,114,22,220,178,31]},"announce":[],"urlList":[]}}