{"title":"Cinderella - Rocked, Wired &amp; Bluesed","uid":3569615,"size":4294279264,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0ade5b89a0f84cbbc09fa131a3aca376d35fb3aa&amp;dn=Cinderella+-+Rocked%2C+Wired+%26+Bluesed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"JLJ27","files":88,"time":1165120760,"description":"CINDERELLA - ROCKED, WIRED &amp; BLUESED\nTHE GEATEST VIDEO HITS\n\nWhereas the CD release isn&amp;#039;t a necessity, this DVD collection is. Some people may not be able to get past the slinging and throwing of guitars and Jeff LaBar&amp;#039;s chia-pet on growth hormones hair, but for those that can this is one superb release. At first it looks like just another thrown together video hits compilation, but there is so much more here. ?Â Â Every Cinderella promotional video is presented here except for &quot;Hot And Bothered&quot; (likely do to a legal wrangling over the Wayne&amp;#039;s World footage) and it is fun to see videos like &quot;Somebody Save Me&quot; and &quot;Coming Home&quot; again. But the best part is watching the videos with Tom Keifer and Eric Brittingham&amp;#039;s commentary. It is very informative listening to the guys talk about the filming of each clip and other enlightening stories - now I know who the fifth guy was on those early videos! The boys really have fun, laughing and reminiscing - unafraid to poke fun at some of their less memorable wardrobes and low budget production qualities. ?Â Â &quot;Shelter Me&quot; is an incredible stab at the P.M.R.C. featuring cameos from Little Richard, Shelley Duvall, Dweezil Zappa and Pamela Anderson. The bonus material from the Long Cold Winter and Heartbreak Station eras are simply icing on the cake, as each member comes across as being very down to earth - not something you might expect from rockers that are able to hypnotize an audience. Everything about this collection is top-notch, right down to the flipping of the LPs when you select individual tracks. This is a must have for every Cinderella and hard rock fan.\n\nDVD Track List:\n01. Shake Me\n02. Nobody&amp;#039;s Fool\n03. Somebody Save Me\n04. Gypsy Road\n05. Don&amp;#039;t Know What You Got (Till It&amp;#039;s Gone)\n06. The Last Mile\n07. Coming Home\n08. The More Things Change\n09. Shelter Me\n10. Heartbreak Station\n\nBonus Material:\n01. Commentary By Tom Keifer And Eric Brittingham\n02. Excerpts From Tales From The Gypsy Road\n03. The Making Of Heartbreak Station\n04. Personal Playlist","torrent":{"xt":"urn:btih:0ade5b89a0f84cbbc09fa131a3aca376d35fb3aa","amp;dn":"Cinderella+-+Rocked%2C+Wired+%26+Bluesed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ade5b89a0f84cbbc09fa131a3aca376d35fb3aa","infoHashBuffer":{"type":"Buffer","data":[10,222,91,137,160,248,76,187,192,159,161,49,163,172,163,118,211,95,179,170]},"announce":[],"urlList":[]}}