{"title":"Pocket World Info 2007 v2.0 (Pocket PC)","uid":3691405,"size":23153434,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0c6897d148c11cedc4d8e44e95d3db45fe7619db&amp;dn=Pocket+World+Info+2007+v2.0+%28Pocket+PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hedkandi1","files":4,"time":1179590018,"description":"Pocket World gives you the whole world in your pocket. At any time, one click will bring you 133 facts from each of 272 countries. Facts such as currency, population growth, life expectancy, inflation rate, rate of exchange, international elations, political personalities, and more. On top of that, there is a substantial number of comprehensive charts and maps. Pocket World is the most extensive Multimediacountry database available for the Pocket PC. Countries can be selected according to the most varied criteria. The search criteria fall into categories for speedy fact finding, business and trade relations as well as geographic and cultural characteristics. So, you could search for countries according to dialling code, Internet Domain, currency, capitals, export, import and agricultural productivity, natural resources, coast lines and so on. \n\nFor every country there&amp;#039;s a detailed map to look at, that can be rolled using a Stylus (input pen). For every country there&amp;#039;s a clock to look at. For example: find a country by calling code. For example: find all countries having oil as natural resource. For example: find all countries whiche cultivate coffee. For any given country, you can find data catagorised as speedy fact finding, geography, transport, population, business, communications, covernment, security and charts. The following summary gives you the facts in detail: Speedy Fact Finding: international calling code internet domain currency which side they drive on ISO country code mains voltage plug types Geographic Location geographic coordinates area usage area comparisons land boundaries coastline maritime claims environment climate trrain elevation extremes natural resources land use irrigated land natural hazards current environmental issues international environmental greements geographical notes \n\n\n\n\nIf you like this upload then please be so kind to vote for my torrentsite.\nThanks in advance\n\n          &lt;a href=&quot;\nhttp://www.uranking.com/vote.asp?member=46032&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.uranking.com/vote.asp?member=46032&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:0c6897d148c11cedc4d8e44e95d3db45fe7619db","amp;dn":"Pocket+World+Info+2007+v2.0+%28Pocket+PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c6897d148c11cedc4d8e44e95d3db45fe7619db","infoHashBuffer":{"type":"Buffer","data":[12,104,151,209,72,193,28,237,196,216,228,78,149,211,219,69,254,118,25,219]},"announce":[],"urlList":[]}}