{"title":"Subversive Use of Sacred Symbolism in the Media - Origins &amp; Orac","uid":3593029,"size":124621,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0dcaf414d46ec586777997bad431872cd61c586c&amp;dn=Subversive+Use+of+Sacred+Symbolism+in+the+Media+-+Origins+%26+Orac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bthoer","files":1,"time":1168367242,"description":"THIS IS A TORRENTFILE THAT SHARES A TORRENTFILE : after you download this torrentfile, just run the leeched torrentfile to leech the actual content.\n--------------------------------------------------------------------------\noriginally posted here:\nwwwdemonoidcom/files/details/594919/\n\ninfo:\n\nSource: DVD (NTSC)\nLanguage: English\nSubtitles: n/a\nRuntime: 319 min\nGenre: Educational/Lecture\n\nVideo Encoding: XviD, 492 kb/s\nResolution: 480 x 352\nFrame Rate: 29.971 fps\nAspect Ratio: 1.364 (4:3)\nAudio Encoding: ABR MP3, 111 kb/s\nSize: 2 CD (98 x 15 MB)\n\nURLs:\noriginsandoracles.com\nmichaeltsarion.com\nmtsar.blogspot.com\n\n*\n\nSigns and symbols control the world, not phrases and laws - Confucius (551-479 BC)\n\n- Why are the youth so delinquent, in these days of affluence and plenty?\n- Why do over 70 percent of the products we buy have names that mean nothing in English?\n- What are the occult techniques used by corporations and governments to manipulate thought and control behavior?\n- In this so-called Age of Amnesia and Infotainment, are we owning our own thoughts?\n- If we are under &quot;psychic hypnosis&quot; would we know it?\n- How to we get back to being a &quot;symbol literate&quot; culture, and offset the worst effects of mind-control, addiction, delinquency and crime?\n- What are the techniques that are used by the media to dumb-down, and influence the youth?\n- Why are television programs, called &quot;programs?&quot; What do words like Lexus, Nissan, Coke, Visa, Nike, Fila, and Acura, etc., actually mean?\n- Why do corporations such as Levi Strauss and MTV screen girls as young as 5 and 6 years of age?\n- Why are banks and franchises designed to subliminally represent churches.\n- Can a corporation be psychotic?\n\nHave you ever wondered whether the billion-dollar artifice of the media, and of the advertising conglomerates, has any lasting negative effect on your mind and behavior, or whether the young are particularly affected by the all-pervasive presence of ads? Is it rational to expect large ad-corporations to jeopardize their vast monopolies by becoming more responsible in the future? Can Madison Avenue agencies and other &quot;Hidden-Persuaders&quot; ever be held accountable, if it is discovered and proven that the glamorous creations of their industry do indeed have lasting negative effects on our minds and behavior? Is the new designer disease of our age &quot;Affluenza,&quot; and is the consumer the consumed, in these times of excess and chronic commercialism? Can there be positive psychological, spiritual or social advancement, in a &quot;symbol-illiterate&quot; culture, more and more dependent on image, brand-logos and chimeras of the perfect, happy life, based on chronic competitiveness, material affluence and technical proficiency? Is there a connection between the rising levels of crime, substance abuse, inner psychological dysfunction, emotional disassociation, and the subversive use of power images and words in our culture? In this the sixth of the &quot;Origins and Oracles&quot; series, Michael Tsarion reveals the occult meaning behind many of the brand-names and logos that infest our think- and mind-space. This thoroughly engrossing expose is compulsory viewing for members of the younger generation, who are under daily assault from a deadly arsenal of psychic weaponry designed to eradicate their moral sensibility and willpower. Michael&amp;#039;s scathing expose leaves the vague warnings of most media-critics far behind, and delves into areas were few others care, or even dare, to venture.\n\n*\n\nSupport the source if you can!\n\nSorry for the delay on this last set. Keep watching Michael&amp;#039;s space, because there are at least 3 more DVD programs to come out. I highly recommend his radio interviews and blog (both can be found at michaeltsarion.com), where he also deals with topics of great importance that you won&amp;#039;t find on these DVDs. The blog is a gold mine for anyone who truly wants to learn about humanity, relationships, and the self.\n","torrent":{"xt":"urn:btih:0dcaf414d46ec586777997bad431872cd61c586c","amp;dn":"Subversive+Use+of+Sacred+Symbolism+in+the+Media+-+Origins+%26+Orac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dcaf414d46ec586777997bad431872cd61c586c","infoHashBuffer":{"type":"Buffer","data":[13,202,244,20,212,110,197,134,119,121,151,186,212,49,135,44,214,28,88,108]},"announce":[],"urlList":[]}}