{"title":"Jennifer Dark &amp; Claudia Rossi - `Euro Angels Hardball 21: Super ","uid":3801566,"size":374020096,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0dfceaf479dd50a0c148f006131966534785bf26&amp;dn=Jennifer+Dark+%26+Claudia+Rossi+-+%60Euro+Angels+Hardball+21%3A+Super+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"deirdre1987","files":1,"time":1189379306,"description":"Jennifer Dark &amp; Claudia Rossi - scene from `Euro Angels Hardball 21: Super Hard` (2003)\n\nContent:\nAnal, A2M, DP, Choking, Straight, Facial, Ass-four-fingering, Gaping, Outdoors, Lesbianism\n\n\nCast:\nClaudia Rossi, Jennifer Dark, Jean-Yves Le Castel, Greg Centauro\n\n\nSex ingredients:\nJennifer &amp; Claudia. Outdoors. Poses &amp; teases. Kiss. Titty sucking by each. Jean-Yves &amp; Greg Centauro. No hands BJ. Eats them. Screwing in various positions. Anal side-by-side. Gape. Anal rev cowgirl. A2M. DP rev cowgirl. Anal next to one another. DP rev cowgirl, doggie, rev cowgirl. Anal from behind. A2M. Choking. \n\n\nScene review:\nChristoph starts off the penultimate scene admiring Jennifer and Claudia as they bend over a fence. After admiring the view a bit, Christoph brings in Jean-Yves and Greg to satisfy the girls. The girls suck each of the guys before moving to a bench so that the guys can return the oral favors. Greg moves on to fuck Jennifer`s pussy and ass while Jean-Yves takes care of Claudia?s holes. Jean-Yves lifts Claudia up so that she can show off some nice gapes, which gives Jennifer the chance to take a nice ass to mouth. Claudia moves on to take a nice double penetration and a bit of ass to mouth before the girls trade off and Jennifer gets the double penetration. They keep things flowing around, including a bit more oral action, more double penetrations, and plenty of anal. They change locations to keep things going, and although Jennifer seems to be the focus of the action, Claudia?s always there to help out rather than looking like she?s left out, but takes another anal pounding as well. The girls also show off some great hang times before Claudia?s final double penetration. Finally the girls take a great pair of facials to finish things up before kissing.\n\nThis is another very nice scene. I really like the balance between the girls, and it stays good and nasty once it gets started. There`s great chemistry here, and neither of the girls ever feel like they`re getting into something they don`t want to do. Finally, things get nicely mixed up rather than feeling like there?s a specific formula or that everything has to be balanced out. My only complaint here and I`ll admit that it`s a fairly minor one, is that you don`t really get to see Claudia as she masturbates while Jennifer takes the second DP. Even with this minor complaint this is a great scene.\n\n\nRuntime : 00:39:47 \nCodec : DivX 5.0 \nRes.. : 512 x 384 \nBitrate : 1148 kb/s \nAudio : 98 kb/s \nFs :  32000 Hz\n\n\n\nSCREENS: &lt;a href=&quot;\nhttp://www.jam-hot.com/details.php?id=10709&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/details.php?id=10709&lt;/a&gt;\n\n\nFor more nush-nush: &lt;a href=&quot;\nhttp://thepiratebay.se/user/deirdre1987/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/deirdre1987/&lt;/a&gt;\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:0dfceaf479dd50a0c148f006131966534785bf26","amp;dn":"Jennifer+Dark+%26+Claudia+Rossi+-+%60Euro+Angels+Hardball+21%3A+Super+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dfceaf479dd50a0c148f006131966534785bf26","infoHashBuffer":{"type":"Buffer","data":[13,252,234,244,121,221,80,160,193,72,240,6,19,25,102,83,71,133,191,38]},"announce":[],"urlList":[]}}