{"title":"Daemon-E - StyleXP","uid":3804394,"size":8985625,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0f6f06380f4bb6f9618e9150b0d25d3745fcb39d&amp;dn=Daemon-E+-+StyleXP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Daemon-E","files":1,"time":1189616114,"description":"How sleek is your desktop? Daemon-E - Style XP unleashes the full potential of your Windows XP desktop by allowing you to download and install XP themes. Themes are available for free from the websites listed in our Links page and won&amp;#039;t slow your computer down while you work or play!\n\n\n\nWhat is Style XP?\n\nStyle XP is not a skinning engine. It uses Microsoft&amp;#039;s built-in visual style engine, but enhances it by providing many useful tools. Style XP can import, select, rotate, and manage themes, visual styles, wallpapers,  logons, bootscreens, icons, and explorer bar. Future versions may support sounds, cursors, screensavers, and packages of all the above. How does it work? Instead of lines and gradients, the XP user interface natively supports the use of skinned bitmap controls (a visual style). This is Microsoft&amp;#039;s own innovation. Style XP includes its own visual styles.\n\n\nZero-Footprint Operation\n\nChoose to have Style XP run in the system tray for easy management and selection of new styles, or turn Style XP off for zero-footprint operation. No additional memory will be utilized unless you desire it.\n\n\n\nNative\n\nStyle XP skins are zero-footprint because they use the same Visual Style Source that is built into XP. XP&amp;#039;s Visual Style Engine will load and draw our start button with the exact code used to load and draw the infamous green start buttons of the original Blue, Olive Green, and Silver skins.\n\nThis is done by performing an in memory patch to XP&amp;#039;s Visual Style Engine. Style XP does not use SetWindowsHookEx, which can noticeably slow system performance. Nor does it hook the &quot;Appearance&quot; tab on the Display Properties property sheet.\n\n\nEasy Installation\n\nThe new Style XP install takes minutes to download and seconds to install. No reboot is required.\n\nIn a short time, you can begin to enjoy your new Visual Styles.\n\n","torrent":{"xt":"urn:btih:0f6f06380f4bb6f9618e9150b0d25d3745fcb39d","amp;dn":"Daemon-E+-+StyleXP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f6f06380f4bb6f9618e9150b0d25d3745fcb39d","infoHashBuffer":{"type":"Buffer","data":[15,111,6,56,15,75,182,249,97,142,145,80,176,210,93,55,69,252,179,157]},"announce":[],"urlList":[]}}