{"title":"Chimpan A - Includes Steve Balsamo Rob Reed Rob Sam Brown","uid":3554359,"size":85534720,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f867a16f6f3b4040a99032ae22bf19aecc04dbe&amp;dn=Chimpan+A+-+Includes+Steve+Balsamo+Rob+Reed+Rob+Sam+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"extra0909","files":12,"time":1163097138,"description":"ChimpanA is an unique musical hybrid, bringing together the talents of multi-instrumentalist Rob Reed (Magenta, Trippa) with vocalist Steve Balsamo (Jesus Christ Superstar, The Storys) and Rob Thompson (the Storys). The self-titled album (F2 Music (UK) 200608, 2006) was first conceived when Reed was working on some techno tracks. Thompson and Balsamo, who knew Rob as part of the South Wales musical scene, heard what he was doing and loved it, so the trio began working on some songs to give further structure to the project.\n\nThe next step was bringing in some key collaborators, with the band using their acquaintances from the UK music scene to flesh out the sound. Nigel Hopkins provides the string arrangements, while Steve&amp;#039;s lead vocals are complimented by Sam Brown (Dave Gilmour, Jools Holland, Solo), Christina Booth (Magenta, Trippa), plus famed backing vocalists Margo Buchanan and Aitch McRobbie. The project&amp;#039;s three secret weapons, however, are: Sian Cothie, the esteemed Welsh classical soprano, DJ Bluey on decks and the magisterial Tony Dallas, a London based poet and storyteller, whose remarkable spoken-word passages provide the album&amp;#039;s heart and soul.\n\nThis 60-minute masterwork is beautifully constructed around its songs, and the quality of the song writing is astonishingly high throughout. Although Balsamo sings the majority of the lead vocals, each piece is delightfully varied and amazingly detailed. Sometimes it is the instrumentation that provides the variation, sometimes it is the vocals and on three key tracks it is the sampling that contributes towards giving the song that special moment of magic. While the songs themselves are hugely accessible, in a style that will please fans of Balsamo rather more than those of Reed, the music is so progressive in spirit that it is sure to win admirers amongst all kinds of music fans. Indeed half a dozen of the songs exceed 6 minutes without ever outstaying their welcome, and several are structured like progressive rock pieces, segueing from one section into another seamlessly, with several different moods per song.\n\n&quot;A time for passion, a time for truth. A time to blink and feel alive.&quot;\n\nSo announces Tony Dallas in the albums opening piece &quot;Theme from Chimpana part 1,&quot; a short orchestral vignette which also includes a personal welcome from Dallas&amp;#039;s to the listener, setting out the &quot;mission statement&quot; of the entire album. A brief synth fanfare gives way to a very familiar piano riff-?momentarily we are in Magenta territory, before Bluey&amp;#039;s decks and some insistent guitar from Thompson introduce the first song proper &quot;It&amp;#039;s Only Sin&quot; a typically strong piece of smooth pop/soul with Balsamo&amp;#039;s vocals featured--here reminiscent of George Michael. The song also features two other strong traits of the album ? compressed, megaphone-style vocals and strong, ambient orchestration from Hopkins, particularly in the song&amp;#039;s more gentle moments.\n\nThe slower-paced &quot;You move in me&quot; features some lovely acoustic guitar, some great synth and what may or may not be a theramin solo--later repeated on guitar--a moment of wonderful instrumental detail typical of the whole album. Christina Booth makes a featured appearance, singing a lovely harmony to Balsamos lead. The brief &quot;Future 1&quot; introduces an orchestral theme to be used later on the album, before a very familiar theme--Mike Oldfields &quot;Tubular Bells&quot;--introduces the marvellously catchy &quot; A Secret Wish.&quot; Where some musicians would rely on the sample alone to provide the main melodic thread for the song, the band have taken Oldfield&amp;#039;s famous tune and built a memorable song around it. Balsamo&amp;#039;s vocal is spine-tingling, too. Expect a single release of this track later in 2006.\n\nA smooth jazz intro leads into &quot;Sam&amp;#039;s Song,&quot; with lead vocal from Balsamo giving way to a beautifully sung chorus by Sam Brown at her soulful best. Listen out for Reed&amp;#039;s understated piano, Fender Rhodes and organ here. After the second chorus, Reed plays a lovely, jazzy synth solo, before the songs moves into a delicious, choral, gospel section and another upliftingly positive Dallas spoken word section. &quot;Future Love Games&quot; is another catchy chill-out classic, with Balsamo strongly featured, and just as the listener thinks they know where the song is going, Sian Cothie makes her first appearance with a spine tingling, operatic interjection. &quot;The Last Night on Earth&quot; is the main showcase for Dallas, his voice intoning over an eerie electronic backing, before a moment of Bach pastiche from Reed&amp;#039;s piano brings in the soprano of Sian Cothie again. As the drums kick in and the vocals become more urgent, all of the sudden we are faced by a wall of guitars, teasing at first over another Dallas spoken section, then riffing like a gothic metal album--almost Nightwish territory!\n\n&quot;The Thief&quot; has a still, beautiful opening--a lovely, soulful female vocal combines with a sample from British composer John Tavener&amp;#039;s choral piece &quot;The Lamb&quot;, before Balsamo&amp;#039;s breathy vocal carries the track through to a dreamy conclusion. Another Tavener sample--this time &quot;The Annunciation&quot;--gives way to a techno drum track, and another, more urgent Dallas showcase with &quot;Are You with Me&quot;. Real drums provide further urgency later in the song, before a charming Rhodes outro. &quot;I came to say?&quot; is another, more conventional song, though one with lots of gentle charm, combining Balsamo&amp;#039;s lead vocal with another catchy chorus. The entirely orchestral &quot;Theme from ChimpanA 2&quot; concludes the album in downbeat, dreamy fashion.\n\nOn first hearing this material several months ago, our one concern was that the songs that the album is built around--and indeed Steve Balsamo&amp;#039;s vocal performance of them--were a little too close to bland, mainstream &quot;boy band&quot; pop. However, having absorbed the album we have to admit to having been won over entirely. The songs may well be aimed at the pop market, yet they are first rate in composition and execution. Our admiration at the sheer creativity and detail which has gone into the arrangement and construction of these pieces of music--for which Rob Reed must take the lions share of the credit--knows no bounds. Indeed, the risky choice of collaborators--especially Tony Dallas, Sam Brown and Sian Cothie--works spectacularly.\n\nChimpanA is a masterpiece of an album, which is hugely commercial as well as artistically satisfying. It should sell millions, if there is any justice in the world.","torrent":{"xt":"urn:btih:0f867a16f6f3b4040a99032ae22bf19aecc04dbe","amp;dn":"Chimpan+A+-+Includes+Steve+Balsamo+Rob+Reed+Rob+Sam+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f867a16f6f3b4040a99032ae22bf19aecc04dbe","infoHashBuffer":{"type":"Buffer","data":[15,134,122,22,246,243,180,4,10,153,3,42,226,43,241,154,236,192,77,190]},"announce":[],"urlList":[]}}