{"title":"PerfectCherryBlossom.zip","uid":3833336,"size":480050544,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f9daebc119696678fbeb6ec35f2cc57271e2066&amp;dn=PerfectCherryBlossom.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mrdj204","files":1,"time":1191778255,"description":"Controls:\n\nZ = Shoot / Yes (For Menu&amp;#039;s)\nX = Special Attack / Back (For Menu&amp;#039;s)\nLeft Arrow = Move Left\nRight Arrow = Move Right\nUp Arrow = Move Up\nDown Arro w= Move Down\n\nNote: Inside the folder are 2 applications. The icon with the E on it is the english version.\n\nOverview:\n\nPerfect Cherry Blossom is a challenging vertical-scrolling shooter, and is the seventh offical game of the Touhou series. It is possibly the most well known game of the Touhou series. The game takes place in the mystic oriental land of Gensokyo, as usual. In the game&amp;#039;s scenario, May has already begun, and yet the winter storms still show no signs of melting just yet. Playing as either Reimu Hakurei (a shrine maiden), Marisa Kirisame (a playful magician) or Sakuya Izayoi (the maid leader from Embodiment of Scarlet Devil), you must battle your way through 6 difficult stages and 2 unlockable extra stages into the depths of the Netherworld to uncover the truth behind the stolen spring\n\nGameplay:\n\nPerfect Cherry Blossom features three different playable characters to choose from, with two different Spell Card types each. Reimu Hakurei can weave through the smallest gaps with ease, and her attacks deal low to decent damage, depending on which type you use. Marisa Kirisame relies on her speed and power to compensate for her thin attack area, but the amount of power she wields is very considerable. Sakuya Izayoi has even wider and more versatile attacks than Reimu, but can be quite tricky to use and maneuver.\n\nThe largest change Perfect Cherry Blossom introduces over its predecessor Embodiment of Scarlet Devil is the addition of the &quot;Cherry&quot; scoring system. Almost every part of the game is linked with the &quot;Cherry Meter&quot;: shooting enemies increases your Cherry points, bombing or dying decreases your Cherry points, reaching 50,000 Cherry+ points gives you a temporary shield. The higher the Cherry Gauge becomes, the more points you gain from Point Items.\n\nOther important gameplay changes introduced in Perfect Cherry Blossom are the appearance of your character&amp;#039;s hitbox while you are focused, a change in the properties of your attacks depending on whether you are normal or focused, and a helpful cursor on the bottom margin during a boss battle which tells you where the boss is currently located.\n\nStory:\n\nIn Gensokyo, people relax and bask in the calm of a winter without end. Spring has shown no sign of arriving even though it&amp;#039;s already May, and in fact the snowstorms are continually getting worse. Reimu Hakurei, a shrine maiden of the Hakurei Shrine, is tired of being cold day in and day out and wants to find the source of this unnatural weather. Marisa Kirisame, a black-clothed magician, sees a cherry blossom petal float down outside her warm house and wonders if spring is happening somewhere else. Sakuya Izayoi, the maid leader of the Scarlet Devil Mansion, knows that their winter supplies are diminishing quickly, and wants to end this prolonged winter before they run out completely. Depending on who you choose, only one of these three heroines actually goes out and investigates.\n\nThe heroine starts off her journey by heading off into the snow-covered forests in search of clues. She battles the ice fairy Cirno and the winter spirit Letty Whiterock in the forest, and the nekomata Chen in the village of Mayohiga, without any progress in her search. Finally, after defeating Alice Margatroid and her dolls, the heroine finds a lead when she notices several cherry blossoms blowing around in the sky. The heroine follows the trail of cherry blossoms high above Gensokyo, breaking through the greetings of Lily White, eventually reaching a great magical boundary and the poltergeist musicians Prismriver Sisters. After silencing the Prismriver Sisters, the heroine crosses the boundary into the Netherworld.\n\nAfter fighting off several ghosts, the heroine is confronted by human-ghost gardener Youmu Konpaku. Youmu explains that she had been stealing the essence of &quot;spring&quot; throughout Gensokyo in order to make the Saigyou Ayakashi, a youkai cherry tree, bloom perfectly with the rest of Hakugyokurou&amp;#039;s gardens, as per her master&amp;#039;s orders. The heroine defeats Youmu and hurries to Hakugyokurou to get Gensokyo&amp;#039;s spring back. Now at the end of a long journey, the heroine comes face to face with Yuyuko Saigyouji, the ghost princess of Hakugyokurou. Yuyuko reveals that she wanted to revive a certain soul that has been sealed within the Saigyou Ayakashi from before her existence.\n\nIn order to break the seal, the youkai cherry blossom tree needed to bloom fully and completely. Yuyuko and the heroine wage a fierce battle, to get the last &quot;spring&quot; contained in the heroine needed for the Perfect Cherry Blossom, and to reclaim Gensokyo&amp;#039;s spring, respectively. After the heroine defeats Yuyuko, the Saigyou Ayakashi starts to lose its health. However the seal has been weakened from the near-complete bloom, and the sealed soul is temporarily unleashed. The soul is actually Yuyuko&amp;#039;s. The heroine dodges attack after attack until Yuyuko&amp;#039;s soul is finally sealed once more.\n\nA few days later, Yuyuko asks the heroine for a favour. The magic boundary between Gensokyo and the Netherworld was weakened by Yukari Yakumo, one of Yuyuko&amp;#039;s friends, to make stealing Gensokyo&amp;#039;s spring easier. Yuyuko asks the heroine to find her friend, who would be preparing for the flower-viewing event during this time, and remind her to repair the boundary. As the heroine flies closer to her destination, Chen leaps out in front of the heroine, seemingly revitalized and much more powerful. The heroine manages to defeat Chen again, but this only serves to draw out an angry Ran Yakumo. It turns out that Chen was the shikigami of Ran, and Ran is intent on making the heroine pay.\n\nRan reveals that she is also a shikigami, and that she will not let any troublemakers disturb her master. The heroine figures that defeating Ran will get the attention of Yuyuko&amp;#039;s friend, and after a fierce battle, Ran is defeated. Surprisingly, Ran&amp;#039;s master, Yukari, doesn&amp;#039;t appear, and Ran tells the heroine that she should try coming back at night, since her master sleeps less often during the night. After returning that night and defeating a weakened Ran again, Yukari emerges to greet the heroine. Yukari is quite surprised at the heroine&amp;#039;s ability and decides to continue where Ran left off. After a vicious fight, Yukari is defeated, and quickly uses her abilities to do the heroine&amp;#039;s request.\n\nScreenshots: http://www.l2p-network.info/screenshots/","torrent":{"xt":"urn:btih:0f9daebc119696678fbeb6ec35f2cc57271e2066","amp;dn":"PerfectCherryBlossom.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f9daebc119696678fbeb6ec35f2cc57271e2066","infoHashBuffer":{"type":"Buffer","data":[15,157,174,188,17,150,150,103,143,190,182,236,53,242,204,87,39,30,32,102]},"announce":[],"urlList":[]}}