{"title":"Frontline - Kim's Nuclear Gamble 2003.10.04","uid":3576776,"size":365667782,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:11ffaa6e6d9150cb2ec39fba7d76804b3c08953a&amp;dn=Frontline+-+Kim%5C%27s+Nuclear+Gamble+2003.10.04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grinreaper_CCE","files":2,"time":1166123616,"description":"While U.S. forces scour Iraq for weapons of mass destruction, and as the fate of Saddam Hussein remains unknown, thousands of miles away the U.S. faces another dictator, North Korea\\&amp;#039;s strange and reclusive leader, Kim Jong Il, and another -- potentially more serious -- crisis.\n\nIn \\&quot;Kim\\&amp;#039;s Nuclear Gamble,\\&quot; FRONTLINE traces the delicate maneuvers and clumsy turns that have brought the world to the brink of a nuclear showdown in East Asia. Through interviews with key insiders -- including former cabinet secretaries, U.S. ambassadors, diplomats, and negotiators -- the one-hour documentary examines the highly unstable relationship between America and North Korea and the question of what to do about North Korea\\&amp;#039;s determination to develop nuclear weapons.\n\nFor 10 years, threats, deceptions, and diplomatic ploys have shaped U.S. relations with the isolated \\&quot;Hermit Kingdom.\\&quot; Complicating relations between the two nations, analysts say, is a fundamental lack of knowledge about one of the world\\&amp;#039;s most isolated countries. A highly militaristic communist nation, North Korea has been teetering on the verge of economic collapse for much of the last decade -- a period during which aid officials estimate that up to 2 million North Koreans died from famine and starvation.\n\nSuch dire economic circumstances contribute, observers say, to North Korea\\&amp;#039;s fear and suspicion of free-market superpowers like the United States and to its desire to arm itself with a nuclear arsenal. Furthermore, the economic situation has led Pyongyang to rely more and more on one of its only sources of hard currency -- the export of ballistic missiles -- a proposition that greatly alarms the Bush administration in the post-Sept. 11 era.\n\n\\&quot;Kim\\&amp;#039;s Nuclear Gamble\\&quot; traces the highs, lows, and crisis points during the past decade of U.S.-North Korean relations, beginning with Pyongyang\\&amp;#039;s announcement in 1994 that it planned to reprocess fuel from its nuclear reactor at Yongbyon -- a move that would have given North Korea enough plutonium to make five to six nuclear bombs.\n\n\\&quot;We were willing to risk war,\\&quot; former U.S. Secretary of Defense William Perry tells FRONTLINE. \\&quot;We seriously considered solving the problem directly by simply striking the reactor and processor at Yongbyon.\\&quot;\n\nFollowing the intervention of former President Jimmy Carter, however, negotiations resumed and ultimately resulted in a deal that became known as the Agreed Framework. North Korea pledged to shut down its nuclear reactor, and in return, the United States promised to pay for and deliver 500,000 metric tons of heavy fuel oil each year until the construction of two light-water reactors -- designed to make proliferation more difficult -- was complete.\n\nHowever, former U.S. officials concede that while North Korea fulfilled its promise to properly shut down the reactor, the United States showed less enthusiasm for fulfilling its half of the agreement. Late shipments of the promised oil and slow construction on the light-water reactors, they say, angered the North Koreans. \\&quot;In my judgment, the [Clinton] administration was not prepared to expend very much political capital on behalf of implementation of the Agreed Framework,\\&quot; says Stephen Bosworth, former U.S. Ambassador to South Korea.\n\nWhile tensions over compliance with the Agreed Framework mounted between the U.S. and North Korea, Pyongyang\\&amp;#039;s relations with South Korea took an upswing. South Korean President Kim Dae Jung, who won the Nobel Peace Prize in 2000, instituted what became known as the \\&quot;Sunshine Policy,\\&quot; which advocated openness and engagement between the two countries. Lim Dong Won, the architect of the Sunshine Policy, tells FRONTLINE, \\&quot;We want[ed] to induce change in the North. That is the way to build confidence.\\&quot;\n\nHowever, in 1998, North Korea tested the world\\&amp;#039;s confidence when it fired a three-stage ballistic missile -- capable of reaching Alaska -- over the Sea of Japan. The third stage failed, but the test sent a message. \\&quot;Kim\\&amp;#039;s Nuclear Gamble\\&quot; follows the Clinton administration\\&amp;#039;s attempts to renew negotiations with North Korea in the wake of the missile test -- which included a historic visit to Pyongyang by former Secretary of State Madeleine Albright.\n\nThe 2001 presidential transition had a dramatic impact on U.S.-North Korean relations. FRONTLINE speaks with numerous former government officials who describe a sharp decline in U.S. relations with both North and South Korea under George W. Bush -- a deterioration that got even worse, they say, after Sept. 11 and Bush\\&amp;#039;s \\&quot;axis of evil\\&quot; speech.\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/pages/frontline/shows/kim/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/pages/frontline/shows/kim/&lt;/a&gt;\n\nGeneral #0 \nFileSize/String : 349 MiB \nFormat/String : Audio Video Interleave \nOveralBitRate/String : 872 Kbps \nPlayTime/String : 55mn 53s \nEncoded_Application : VirtualDubMod 1.5.4.1 (build 2178/release) \n\nVideo #0 \nCodec/String : XviD \nCodec/Info : XviD project \nBitRate/String : 759 Kbps \nWidth : 544 \nHeight : 416 \nAspectRatio/String : 4/3 \nFrameRate/String : 29.97 fps \nBits/(Pixel*Frame) : 0.112 \n\nAudio #0 \nCodec/String : MPEG1/2 L3 \nCodec/Info : MPEG1 or 2 Audio Layer 3 \nBitRate/String : 100 Kbps \nChannel(s)/String : 2 channels \nSamplingRate/String : 44 KHz \n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:11ffaa6e6d9150cb2ec39fba7d76804b3c08953a","amp;dn":"Frontline+-+Kim%5C%27s+Nuclear+Gamble+2003.10.04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11ffaa6e6d9150cb2ec39fba7d76804b3c08953a","infoHashBuffer":{"type":"Buffer","data":[17,255,170,110,109,145,80,203,46,195,159,186,125,118,128,75,60,8,149,58]},"announce":[],"urlList":[]}}