{"title":"gore and vore galore","uid":3604927,"size":301414375,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:120e81ab3ac37ad91b64a17ae1b42685de8657e0&amp;dn=gore+and+vore+galore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"j0shuakane","files":9,"time":1169930931,"description":"these are clips of movie gore, real gore, and/or real vore put to some of the best music known to man. here is a list of what these are idividually. all of these were made by me but spread them around if you find them enjoyable. i must warn you these are VERY FUCKING GRAPHIC! \n\nanimal lovers 1&amp;2 - probably the least enjoyable of the videos on here. includes kitty and bunny stomping, african elephant spear hunting and gutting among other things. pt.1 music by Fuck...I\\\\\\&amp;#039;m Dead       pt.2 music is Bible Basher by Deicide\n\nAnnihilation by the Hands of God - TONS of movie gore put to Annihilation by the Hands of God by the Death Metal All-Stars (this song is INSANE!)\n\nbeheadings - a bunch of beheadings set to Delicious Dolop by Fuck...I\\\\\\&amp;#039;m Dead. (this is my personal favorite of these) and be sure to listen close after the music :)\n\nEnslaved Vore - Mostly snake vore among other vore set to Enslaved by Malevolent Creation\n\nFuer Frei - TONS of movie gore set to Fuer Frei by Rammstein. not so excellent quality :(\n\nReign in Blood 2007 - more movie gore and some real gore pics at the end. also some anime pics that people say dont fit in*. Music is Reign in Blood by Slayer\n\nTrioxin vore - TONS of amazing vore set to Trioxin by Lord Gore. this one has a happy ending :)\n\nYou Can\\\\\\&amp;#039;t Bring me Down - a couple more \\\\\\&quot;TONS\\\\\\&quot; of movie gore is crammed into this one. and LOTS of chainsaw action. music is You Can\\\\\\&amp;#039;t Bring me Down by Suicidal Tendencies\n\nand if you dont know what vore is its animals eating each other. well there are many types of vore, but that is all that you will find here lol\n\n\n\nENJOY...","torrent":{"xt":"urn:btih:120e81ab3ac37ad91b64a17ae1b42685de8657e0","amp;dn":"gore+and+vore+galore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120e81ab3ac37ad91b64a17ae1b42685de8657e0","infoHashBuffer":{"type":"Buffer","data":[18,14,129,171,58,195,122,217,27,100,161,122,225,180,38,133,222,134,87,224]},"announce":[],"urlList":[]}}