{"title":"When Trumpets Fade (1998)","uid":3955349,"size":813035497,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:13bd31b35f67aa86da9603de47c71eeb697571c3&amp;dn=When+Trumpets+Fade+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Spoiler1","files":2,"time":1199107066,"description":"When Trumpets Fade (1998)\n\n\nPvt. David Manning (Ron Eldard), shell-shocked and exhausted after serving on the front line, requests a dismissal but is instead promoted to sergeant. Leading a group of inexperienced soldiers, Manning finds only further devastation when he and his troops become involved in the battle of Hurgen Forest. War movie veteran John Irvin (Hamburger Hill, The Dogs of War) directed this well-received made-for-cable drama.\n\n\n\nWhen Trumpets Fade is a great movie, with excellent action sequences, fine acting and a sound storyline. It&amp;#039;s better than Platoon, and I&amp;#039;d put it up there with 84 Charlie Mopic, except that it deals with infantry warfare during WWII. It came out after a series of real to life WWII movies, Saving Private Ryan, The Thin Red Line, but is made on a smaller budget and apart from Ryan&amp;#039;s opening scene, it is a better movie. The cast consists of thoroughly unknown but very skilled actors, and the movie gives you a feel of what it must have been like to be on the front line in the Huertgen Forrest in Germany, late 1944. The Hungarian location adds realism as well.\n\nThe story basically revolves around the single minded efforts of private (then sergeant, then lieutenant) Manning (Ron Eldard) to stay alive and out of the meatgrinder that is conventional warfare, no matter what, even though ironically, the fact that he survives means that he has to put up for ever more dangerous tasks because he&amp;#039;s the only one near who has any close-up experience.\n\nI&amp;#039;ll add that the videostore I go to allows you to rent 5 movies for the price of 3, and keep them for a full week. Every day after watching another movie, I couldn&amp;#039;t help but re-watch &quot;When Trumpets Fade&quot;, and every time I found something new and something more made sense to me.\n\nThis is one outstanding movie, very well produced and if you like war movies from the grunt&amp;#039;s point of view, don&amp;#039;t miss it. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0135706/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0135706/&lt;/a&gt;\nUser Rating: 7.3/10 \n\nHard coded English Subs\n","torrent":{"xt":"urn:btih:13bd31b35f67aa86da9603de47c71eeb697571c3","amp;dn":"When+Trumpets+Fade+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13bd31b35f67aa86da9603de47c71eeb697571c3","infoHashBuffer":{"type":"Buffer","data":[19,189,49,179,95,103,170,134,218,150,3,222,71,199,30,235,105,117,113,195]},"announce":[],"urlList":[]}}