{"title":"24c3-2338-en-steam_powered_telegraphy.mp4","uid":3953102,"size":125809374,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1500a0904d2788324c930ca3c5c0ea950dc469ca&amp;dn=24c3-2338-en-steam_powered_telegraphy.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"num42","files":1,"time":1198972568,"description":" &lt;a href=&quot;http://events.ccc.de/congress/2007/Fahrplan/events/2338.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://events.ccc.de/congress/2007/Fahrplan/events/2338.en.html&lt;/a&gt;\n\nSpeakers:     \t Jens Ohlig\n\tIngo Schwitters\n\tSkyTee\n\tSebastian Velke\n\nSteam-Powered Telegraphy\n\nA League of Telextraordinary Gentlemen present the marvel of Telex on the Net - driven by a steam engine\n\nWe have built and modified a steam-powered Telex machine and connected it to the new-fangled invention for modern telegraphy known as &quot;the Internet&quot;. We will present this steampunkish invention in form of a lecture, thus hoping to enlighten interested ladies and gentlemen on the principles of steam engine physics, 5-bit Baudot encoding, and historic telegraphy in general.\n\n&quot;The Magnetic Telegraph annihilates distance. So complete is this annihilation that the newspapers at Baltimore have made arrangements to report the proceedings of congress by telegraph, so as to have the intelligence from the capital (40 miles distant) as soon even as the Washington papers. A like effect will happen when the line is established between New York and Boston. The news from Europe brought by the Boston packet will be known in New York (220 miles distant) as soon as it is in Boston.&quot; -- Albany Argus, The Magnetic Telegraph, 1845.\n\nTelegraphy truly holds the potential to connect the world, from the icy lands of Russian Alaska to the centres of modern progress in Manchester and London and the farest corners of Her Majesty&amp;#039;s Empire in India or former colonies in America.\n\nOver the last few months, a League of Telextraordinary Gentlemen at the Chaos Computer Club Cologne, after having acquired a historic Telex machine, have built a steampunkish modification of said machine, making it probably the first steam-powered telegraph connected to the new-fangled invention for modern telegraphy known as &quot;the Internet&quot;.\n\nOur technical spectacluar will include all our learnings about the basics of our apparatus:\n\n    * steam engineering\n    * the history of telegraphy and Telex\n    * the Telex standard and its 5-bit Baudot encoding\n    * the embedded list of calculation for machines or &quot;software&quot; we used for making the Telex machine an RSS reader and a Jabber client\n\nWhile we plan to present this lecture in appropriate dressing (frock coats etc.), we do not plan to give the audience a special dress-code.\n","torrent":{"xt":"urn:btih:1500a0904d2788324c930ca3c5c0ea950dc469ca","amp;dn":"24c3-2338-en-steam_powered_telegraphy.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1500a0904d2788324c930ca3c5c0ea950dc469ca","infoHashBuffer":{"type":"Buffer","data":[21,0,160,144,77,39,136,50,76,147,12,163,197,192,234,149,13,196,105,202]},"announce":[],"urlList":[]}}