{"title":"Temporary Services Booklets - ART BOOKLETS","uid":3568154,"size":30315658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:152d104fba8113509e61cd81e6d7b358e7c020bd&amp;dn=Temporary+Services+Booklets+-+ART+BOOKLETS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"arttorrents","files":35,"time":1164925554,"description":"Temporary Services is a group of three persons: Brett Bloom, Salem Collo-Julin and Marc Fischer. \nWe draw on our varied backgrounds and interests to produce creative exhibitions, events, projects and publications. \nWithin our work we create socially dynamic situations and spaces for dialogue. We collaborate both together and with others outside of our group. \nThe distinction between art practice and other creative human endeavors is irrelevant to us. \nOur projects embrace a range of content that requires varied visual approaches and presentation strategies.\n\nTwo components of our work that have been constant since our inception in 1998 are our love of self-publishing and our commitment to finding diverse placements and audiences for our projects. \nWe champion public projects that are temporary, ephemeral, or that operate outside of conventional or officially sanctioned categories of public expression. All audiences are equally valuable to us. \nWe make and distribute booklets that share our ideas. We enjoy developing portable projects that allow us to bring our ideas to many sites (including those not always used for the production and \nexhibition of cultural work). We develop projects that allow other artists to share their ideas with a similar flexibility. We actively use our website to transmit and archive our ideas and concerns.\n\nWorking together in a group gives us both the ability to do multiple projects at once and the flexibility to use each other?s experiences to our collective advantage. \nWe also like collaboration because of the inherent challenges and incredible possibilities that come with working with each other and with persons outside of our group. \nWe can effectively utilize each other?s skill sets and trust in each other?s ideas because of having worked together for so long. Our ability to share authorship on all \nprojects and still produce work that is meaningful to each of us as individuals has also increased.\n\nThe link between aesthetics and ethics is in the foreground of our ideas. We seek thoughtful and responsible ways of both presenting our work and collaborating with others. \nOver the years, we have learned to give deeper consideration to the impact our projects can have ? particularly as we secure opportunities to bring our work to new cities, \ncountries and contexts. We have become increasingly mindful of the types of situations our work needs for our ideas to flourish. Our international network of friends and \nsupporters is greater than ever ? we are able to use this network as an effective tool for research and a springboard for our ideas.\n\nTemporary Services seeks to both create and participate in relationships that are not competitive and are mutually beneficial. \nWe seek strategies for harnessing the ideas and energies of people who may have never participated in an art project before, \nor who may feel excluded from the art community. We seek tactics for harnessing the generosity of many individuals to produce \nprojects on a scale that none of us could achieve in isolation. We strive toward aesthetic experiences that are built upon trust and unlimited experimentation.\n\nVisit http://www.temporaryservices.org/ for more information about their work.\n\n","torrent":{"xt":"urn:btih:152d104fba8113509e61cd81e6d7b358e7c020bd","amp;dn":"Temporary+Services+Booklets+-+ART+BOOKLETS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"152d104fba8113509e61cd81e6d7b358e7c020bd","infoHashBuffer":{"type":"Buffer","data":[21,45,16,79,186,129,19,80,158,97,205,129,230,215,179,88,231,192,32,189]},"announce":[],"urlList":[]}}