{"title":"Driver Detective 6.2.5.0","uid":3854018,"size":8439730,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:176ef8b2f643644f3f1379655d270c55a601fcad&amp;dn=Driver+Detective+6.2.5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":18,"uploader":"jokeri1971","files":5,"time":1193096193,"description":"Drivers HeadQuarters is the first and only driver update service providing manufacturer specific drivers for your computer. Driver Detective is simple and easy to use and designed to make updating drivers fast. Drivers HeadQuarters has an experienced support staff available to help you, with integrated customer support tools built in. Driver Detective can save you endless hours of work and aggravation updating your drivers.\n\nthis is hacked by me and i know it works read the instruction carefully\n\n-----------------------------------------------------------------------\n\nThis is only a temporary crack! After closing the program you&amp;#039;ll need to repeat steps 2 to 4 every time you want to use driver detective. \n\n1. Install driver detective and launch the program. Select manufacturer then close driver detective.\n2. For windows XP: copy the licence file to the directory: \nC:Documents and SettingsAll UsersApplication DataPC Drivers HeadquartersDriver Detectivedd.lic    (This is a hidden folder. In order to see it go to control panel, folder options, view, show hidden files and folders)\n   For windows Vista: copy the licence file to the directory: C:UsersAll UsersPC Drivers HeadquartersDriver Detectivedd.lic\n3. Open driver detective and enter this registration key: \ne7cfc8a6-253a-445a-b35c-36f0ce49e5c9 \n4. Hit the validate button and you should see a checkmark beside it and the program is now registered. \n \n\n\nThe licence provided should be good for one year until oct/08.\n\nhave fun and enjoy the joker","torrent":{"xt":"urn:btih:176ef8b2f643644f3f1379655d270c55a601fcad","amp;dn":"Driver+Detective+6.2.5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"176ef8b2f643644f3f1379655d270c55a601fcad","infoHashBuffer":{"type":"Buffer","data":[23,110,248,178,246,67,100,79,63,19,121,101,93,39,12,85,166,1,252,173]},"announce":[],"urlList":[]}}