{"title":"UFO Fleets, Flying Humanoids, Levitating Horses and High Weirdne","uid":3694131,"size":582702037,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:17a90e669d6b8392c4f18407c3ed62d31d438d94&amp;dn=UFO+Fleets%2C+Flying+Humanoids%2C+Levitating+Horses+and+High+Weirdne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jackamo","files":2,"time":1179825959,"description":"UFO Fleets, Flying Humanoids, Levitating Horses and High Weirdness over the skies of Mexico \n\nName: Lecture by  Jaime Maussan and Santiago Yturria Garza at the 16th Annual International UFO Congress, Laughlin, Nevada, USA 2006\nSource: DVD via net\nYear: 2006\nGenre: Documentary/UFO/Exopolitics\nFormat: Avi\nResolution : 480x360\nAudio rate : 128kpbs\nRunTime 01:32:32\nArchived by Exopolitics UK\n\n&quot;The skies of terra have been colonised by all manner of flying entities for millennia; from angels to witches to the mothman and superman. In Mexico however, these entities seem to have forgotten they are purely mythological constructs as they fly in from the universe next door. Are we seeing &quot;genuine&quot; phenomena over the skies of Mexico and elsewhere...a storming of the reality studio and a forced rewiring of &quot;consensus reality&quot; and/or are they part of a sophisticated black-op &quot;false flag&quot; psy-op by Control on the Mexican people testing the ontological boundaries of Mexican society through staged simulations of high weirdness?&quot; -              \n\nQuote from Jackamo at Exopolitics UK\n\nVideo of Lecture by  Jaime Maussan and Santiago Yturria Garza at the 16th Annual International UFO Congress, Laughlin, Nevada, USA 2006\n\nFor those of you who have watched the seminal lecture by Jaime Maussan at the 2005 UFO Congress in Laughlin and waited with anticipation for the torrent release of the 2006 lecture, you will not be disappointed. Teaming up with perhaps the other most respected Mexican researcher in the field, Santiago Yturria, they together deliver one of the most mind-blowing collection of footage and analysis ever assembled in ninety minute. Most researchers in the field of exopolitics, ufology and anomalous phenomena would be pleased to predicate an entire lecture on any one of the incredible array of video segments presented by Maussan &amp; Garza.\n\nHighlights of the 2006 Lecture Include\n\nFlying Humanoids - Incredible footage of the the flying witch incident of 2004 over the skies of Monterrey.\n&quot;This story certainly has been causing a great stir here in the city of Monterrey, N.L. Mexico and I would like you to know the facts involving a Police Officer, a flying humanoid entity and a mobilization of police forces in a bizarre, unprecedented incident?. - Letter to Jeff Rense from Santiago Garza, 23rd January 2004\n(for an indepth analysis of this footage visit http://exopolitics.org.uk/index.php?option=com_content&amp;task=view&amp;id=67&amp;Itemid=9)\n \nUFO Fleets\nTheir video showed about 200 silvery spheres in formation about 3-5000 feet up on 21 Jun 04 and another clip of 500 - 1000 similar spheres over Mexico City on 30 Jan 06. They focused on one group of 3 that was joined by a 4th as they continued moving in a fixed formation\n\nEntities Captured on Video and Cameras\nIncredible images of various entities caught on film, some accidentally and some deliberately. The highlight includes an analysis of an attempted &quot;abduction&quot; of a teenage boy captured on film. The real significance to this case isn\\&amp;#039;t this amazing footage but the fact that the zone around where the entity manifested itself still gives off incredibly high levels of radiation months after the event, right up to the present day as you can see in the footage. Yet, despite this high level of radiation, no-one ever gets sick, the plants still grow and it seems as almost a field of containment surrounds the energy matrix.\n\nPlus video footage of.....flying horses, Mayan crop circles in the south of England and &quot;angels&quot; in the sky.....do not adjust your mind, this is simply reality malfunctioning.\n\nthank you &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f3b4969c949297979ac3c3b386879c839a92879697dd9d9687&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; for making this torrent possible\nand thanks to the hard working people behind Conspiracy Central for making the distribution of such material possible\n &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;\nwww.exopolitics.org.uk\nwww.utopiated.net\n\nNote: 2005 Jaime Maussan Lecture on Google Video: http://video.google.com/videoplay?docid=-5305085298884471236&amp;q=Jaime+Maussan\n\n","torrent":{"xt":"urn:btih:17a90e669d6b8392c4f18407c3ed62d31d438d94","amp;dn":"UFO+Fleets%2C+Flying+Humanoids%2C+Levitating+Horses+and+High+Weirdne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17a90e669d6b8392c4f18407c3ed62d31d438d94","infoHashBuffer":{"type":"Buffer","data":[23,169,14,102,157,107,131,146,196,241,132,7,195,237,98,211,29,67,141,148]},"announce":[],"urlList":[]}}