{"title":"Foxit Reader Pro 1.3 build 1621","uid":3575979,"size":3683929,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:17aa6addcf7ebec236fce4c20ae697929cb326dc&amp;dn=Foxit+Reader+Pro+1.3+build+1621&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"decimus","files":3,"time":1166017197,"description":"\nFoxit Reader Pro is the professional version of Foxit Reader, the popular free PDF reader.It&amp;#039;s small,fast installation and easy to use.\n\nHere are some key features of &quot;Foxit Reader Pro&quot;:\n\n* A rich set of annotation (commenting) tools that allows you to annotate (comment) on your PDF documents:\nÂ· Typewriter tool: allows you to type on any place of PDF documents;\nÂ· Note tool: insert textual comments on any place, with a popup window that can be opened or closed easily;\nÂ· Text marking tools: you can highlight, strike-through, underline texts in your PDF documents;\nÂ· Graphic marking tools: you can draw lines, shapes, polygons, and any hand-drawing graphs on your PDF document, with associated textual comments.\n* Select and copy text contents from PDF files even when other applications fail to extract such information;\n* Convert pages or a whole file to pure text, so you can easily copy and paste text contents;\n* A new application: Foxit Library allows you to manage your PDF files and browse them easily.\n\n\nYou can try every feature of Foxit Reader Pro, the only difference from the paid version is that some small evaluation marks are placed on pages you modify using with Foxit Reader Pro, when saving the PDF document.\n","torrent":{"xt":"urn:btih:17aa6addcf7ebec236fce4c20ae697929cb326dc","amp;dn":"Foxit+Reader+Pro+1.3+build+1621","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17aa6addcf7ebec236fce4c20ae697929cb326dc","infoHashBuffer":{"type":"Buffer","data":[23,170,106,221,207,126,190,194,54,252,228,194,10,230,151,146,156,179,38,220]},"announce":[],"urlList":[]}}