{"title":"ExtraDrive 7.0 - Creating Extra drives on your computer.","uid":3590899,"size":618720,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:19cdcc872cd976c6c7de3dffdf2eb7f4d8b22056&amp;dn=ExtraDrive+7.0+-+Creating+Extra+drives+on+your+computer.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doglike76","files":5,"time":1168092164,"description":"Extra Drive Creator Pro - suite of tools for creating Extra drives on your computer. The program includes tools for creating Encrypted drives, Virtual CD-ROMs, Virtual Drives based on files, Virtual Drives based on folders, RAM-drives...\n\nExtra Drive Creator contains tools:\n\nCrypted Drive - tool is used for creating Crypted drives on your computer. On this drive you can store confidential information which you`d like to keep secret from other users. The drive is crypted by 256-bit (32 symbols) password using &quot;AES256&quot; algorithm in real-time mode (this ensures steady protection of your data against hacking).  \n\nVirtual CD - tool is used for creating and reading ISO-images of CD-ROMs and also for mounting them as Virual CD-ROMs on your computer. On creating Virtual CD in Explorer of your computer will appear Virtual CD-ROM and ISO-image on your hard drive on which information from created drive will be kept. \n\nFile to Drive - tool is used for creating extra drive without partitioning hard drive of your computer on additional drives. This tool uses file as basis for extra drive. After creation, Windows Explorer will show an extra drive and container file on your hard drive on which will be kept information from created drive.\n\nFolder Drive - tool is used for creating an extra drive without creating more partitions on the hard drive of your computer. This tool uses a folder as a basis for the extra drive and serves for making access to frequently used folders of your computer more easy.\n\nRAM Drive - tool is used for creating an extra drive without creating more partitions on the hard drive of your computer. This tool uses RAM memory as a basis for an extra drive. All information kept on this drive will be lost after reboot of your computer. Similar drives are used for storing temporary information (TEMP/TMP computer variables) or for applications which need maximum access speed to drive.","torrent":{"xt":"urn:btih:19cdcc872cd976c6c7de3dffdf2eb7f4d8b22056","amp;dn":"ExtraDrive+7.0+-+Creating+Extra+drives+on+your+computer.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19cdcc872cd976c6c7de3dffdf2eb7f4d8b22056","infoHashBuffer":{"type":"Buffer","data":[25,205,204,135,44,217,118,198,199,222,61,255,223,46,183,244,216,178,32,86]},"announce":[],"urlList":[]}}