{"title":"AQUARIAN AGE live CDqualityrecording_mp3_ incl. Covers","uid":3862690,"size":72618986,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1a99add9061abfde7f9a098be50a49dfcf0a2de6&amp;dn=AQUARIAN+AGE+live+CDqualityrecording_mp3_+incl.+Covers+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ottokarsworld","files":1,"time":1193594063,"description":"11 songs\nrecorded live in frankfurt 2004 and linz 2006\n160kb mp3\nplus covers\n\nThis is a netCD. Which means you can?t buy it in stores (if you did, tell us and we?ll sue the one who sold it to you!), but you can download it here for free. \nBeneath you find 11 songs and the cover art. Grab them all and burn the CD by yourself, print out the covers and, voila, you got a full 60 mins Aquarian Age Live CD.\n10th anniversary of &quot;Birth&quot; ... and Love\nIn February 1997,  it happened to be my birthday, we presented our first ep called &quot;Birth&quot; in a concert in Lambach, Upper Austria. We invited friends to perform with us (like the great Austrian sax player Christian Bachner and other fine musicians) and many people came to see us and buy CDs. A girl who knew our drummer Robert took her female friend to the concert and by chance we came to talk after the concert. I?m with her since that night, and we now have two wonderful children. Needless to say it was a great evening!\nSomething to celebrate!\nWe will celebrate this anniversary with a concert in February 2007. But for all people out there all over the world, who like our music, supported us and showed respect (and of course the ones that became friends!) and can?t be there I want to give you this live music and hope you?ll enjoy it like we enjoy playing our songs! Nothing fancy, just us three playing our songs!\nDownload the files and burn yourself a CD!\nPlease feel free to download the files (mp3, 160kb) and covers and make yourself a Aquarian Age Live CD. IT?S FREE! If you like it, burn it again and give it to your friends, as often as you want, as long as it is for personal use! As our drummer Robert often said - this music must be played!\n\nHowever, DO NOT broadcast this songs or use them for any form of commercial reasons without permission (all songs are filed at AKM Austria, a copyright society like ASCAP or GEMA)! \n\nHope you?ll enjoy this CD, if so, please tell us, f.e. by signing our guestbook! If you want to support us, please feel free to buy our CDs at Artistlaunch or single songs at Itunes or other Digital Music Distributors. Thank you!(taken from: http://www.aquarianage.at/liveCD.htm)\n\n \n\ntracks:\n\n\nQuestionmark\nLove Is Blind\nWith My Eyes\nMadhouse Window\nHypnotized\nPower Of Your Love\nRound Round Round\nPerfect Day\nMirror Mirror\nSweet Love Of Mine\nDown To The Top\n\t\n\nChristian Grill  guitar, vocals\nGerold ?Moarly? Mayr bass, b-vocals\nRobert Gremelmayr drums\nGabriel Herbst sax on ?madhouse window?\t\t","torrent":{"xt":"urn:btih:1a99add9061abfde7f9a098be50a49dfcf0a2de6","amp;dn":"AQUARIAN+AGE+live+CDqualityrecording_mp3_+incl.+Covers+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a99add9061abfde7f9a098be50a49dfcf0a2de6","infoHashBuffer":{"type":"Buffer","data":[26,153,173,217,6,26,191,222,127,154,9,139,229,10,73,223,207,10,45,230]},"announce":[],"urlList":[]}}