{"title":"Damn.Small.Linux.2.1.RC1.iso.ENG.","uid":3606816,"size":52084736,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:1af0cdefc67822dc99670267c105db9111ea569c&amp;dn=Damn.Small.Linux.2.1.RC1.iso.ENG.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1488","files":1,"time":1170180040,"description":"Damn Small Linux 2.1 RC1 \nDamn Small Linux (DSL) is a very versatile 50MB mini desktop oriented Linux distribution. It includes a fully automated remote and local application installation system and a very versatile backup and restore system which may be used with any writable media including a hard drive, a floppy drive, or a USB device. It has a nearly complete desktop, and many command line tools. All applications are chosen with functionality, size and speed in mind. It includes XMMS (MP3, CD Music, and MPEG), FTP client, Dillo web browser, links web browser, FireFox, spreadsheet, Sylpheed email, spellcheck (US English), a word-processor (FLwriter), three editors (Beaver, Vim, and Nano [Pico clone]), graphics editing and viewing (Xpaint, and xzgv), Xpdf (PDF Viewer), emelFM (file manager), Naim (AIM, ICQ, IRC), VNCviwer, Rdesktop, SSH/SCP server and client, DHCP client, PPP, PPPoE (ADSL), a web server, calculator, generic and GhostScript printer support, NFS, Fluxbox window manager, games, system monitoring apps, a host of command line tools, USB support, and pcmcia support, some wireless support.\n\n___________________________________________________________________________________\n\nDamn Small is small enough and smart enough to do the following things:\n\n    * Boot from a business card CD as a live linux distribution (LiveCD)\n    * Boot from a USB pen drive\n    * Boot from within a host operating system (that&amp;#039;s right, it can run *inside* Windows)\n    * Run very nicely from an IDE Compact Flash drive via a method we call &quot;frugal install&quot;\n    * Transform into a Debian OS with a traditional hard drive install\n    * Run light enough to power a 486DX with 16MB of Ram\n    * Run fully in RAM with as little as 128MB (you will be amazed at how fast your computer can be!)\n    * Modularly grow -- DSL is highly extendable without the need to customize\n","torrent":{"xt":"urn:btih:1af0cdefc67822dc99670267c105db9111ea569c","amp;dn":"Damn.Small.Linux.2.1.RC1.iso.ENG.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1af0cdefc67822dc99670267c105db9111ea569c","infoHashBuffer":{"type":"Buffer","data":[26,240,205,239,198,120,34,220,153,103,2,103,193,5,219,145,17,234,86,156]},"announce":[],"urlList":[]}}