{"title":"Jpsoft 4NT 8.02 Build 96 2007-10-11","uid":3858369,"size":4638052,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1b40c6aa80d4d9079bd65192eeaba2b783d46d1f&amp;dn=Jpsoft+4NT+8.02+Build+96+2007-10-11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Data-Fjotten","files":5,"time":1193336833,"description":"\nCurrent Versions 4NT 8.02 Build 96 (2007-10-11)\n\n\n-------------------------------------\n\n\n4NT - Windows Command Line Power -----------\n\tFrustrated by the limitations of the Windows command prompt? \nThen 4NT is the one command line tool you need. \n\nBy adding thousands of features that Microsoft neglected, 4NT makes the command line easy to use, providing more power and flexibility than you ever imagined. 4NT is a powerful alternative to the Windows command processor, CMD - the program behind your C:&gt; prompt. 4NT enhances most of CMD&amp;#039;s commands, and adds a wide variety of new commands designed to aid everyone from the new user to the serious batch programmer.\n4NT adds features such as shorthand &quot;aliases&quot; for commonly used commands, pop-up command and directory history windows, and the ability to copy, move, delete, or list multiple files with a single command. Command line editing, history, and recall eliminate extra keystrokes, and the FFIND command can quickly locate files or text within a file anywhere on your system. You can even add new commands from a number of third-party developers (or write your own!) through our plugin feature. \nBatch file users will be amazed at the power and speed this command line tool adds to Windows batch files, with an array of sophisticated new batch commands and a powerful interactive debugger.\n\nCommand Line Features ----------\nModify and re-execute previous commands with a powerful command line editor. \nCopy, delete, move, and rename groups of files and directories, not just individual ones. \nExtended directory searches allow you to change to a directory anywhere on your system by entering only part of its name. \nQuickly locate files or text within files anywhere on your system. \nBuilt-in file viewer includes scrolling, search, and print capabilities. \nSelect or exclude files by date, time, size, and/or extended wildcards for extraordinary flexibility in file management. \nRedefine command prompt commands, create new commands and functions for your regular tasks, even assign frequently used commands to a single keystroke. \nDirect access to FTP, TFTP, and HTTP (including SSL) directories and files in a file-handling commands. \nComplete configuration adjustment, either through interactive dialogs or on the command line. \nFile descriptions up to 511 characters long provide information that can&amp;#039;t fit in a filename.\n--------------------------------------\nBatch File Features -----------\nBatch debugger with singlestepping, breakpoints, syntax coloring, bookmarks, popup variable windows, a variable watch window, and editing. \nAn improved batch language adds subroutines, IF/THEN/ELSE logic, DO loops, SWITCH statements, error and exception handling, and more than 130 internal commands, while retaining compatibility with batch files written for CMD. \nMore than 130 built-in variables include system configuration, device status, network drive detection, and free memory and disk space. \nMore than 200 variable functions assist with manipulation and display of strings, characters, numbers, date and time, file names, etc.\n--------------------------------------\nSystem Requirements -----------\n4NT is compatible with any version of Microsoft Windows 2000, XP, 2003, or Vista, including 64-bit versions. It requires a minimum of 128Mb of RAM and 10Mb of free disk space.\n","torrent":{"xt":"urn:btih:1b40c6aa80d4d9079bd65192eeaba2b783d46d1f","amp;dn":"Jpsoft+4NT+8.02+Build+96+2007-10-11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b40c6aa80d4d9079bd65192eeaba2b783d46d1f","infoHashBuffer":{"type":"Buffer","data":[27,64,198,170,128,212,217,7,155,214,81,146,238,171,162,183,131,212,109,31]},"announce":[],"urlList":[]}}