{"title":"Bree Olson - Spunkmouth.wmv","uid":3571184,"size":293923190,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1c87739cc8822bfe1988c04da8857d40b54eb888&amp;dn=Bree+Olson+-+Spunkmouth.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1165336061,"description":"&quot;Holy Fuckin Moley this is one ridiculously slutty scene! First off, get an eyeful of teen tart BREE OLSON- petite, blonde, super cute and super slutty, Bree is a self proclaimed &quot;lifelong whore&quot; and brother does she prove it in this one. Bree called me up out of the blue and told me some prior arrangements had fallen through and she was &quot;craving some cock.&quot; You see, Bree is the kind of girl who can&amp;#039;t go for very long without her dickfix- that&amp;#039;s why she&amp;#039;s in porn. Anyway, I make a few calls and before you know it, I&amp;#039;ve got some lowlifes ready to rod her into oblivion- three black guys and an asian- fuck it, Bree doesn&amp;#039;t care so long as they&amp;#039;re hung and they give it to her real good. What followed was sheer filthiness- cock after cock got worked by slutty little Bree and so much cum was flying around I thought I was going to have to call a disaster recovery service to clean the joint up. I mean, these guys were dropping multiple loads onto Bree, and she STILL hadn&amp;#039;t gotten enough- coated down with cum, she threw on a tshirt, and walked up and down the street outside my studio to prove how much of a slut she was- then she made ME fuck her face and drop a load on her as well- not to mention stick it up her ass- I mean it just went on and on- what a total NYMPHO.&quot;\n","torrent":{"xt":"urn:btih:1c87739cc8822bfe1988c04da8857d40b54eb888","amp;dn":"Bree+Olson+-+Spunkmouth.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c87739cc8822bfe1988c04da8857d40b54eb888","infoHashBuffer":{"type":"Buffer","data":[28,135,115,156,200,130,43,254,25,136,192,77,168,133,125,64,181,78,184,136]},"announce":[],"urlList":[]}}