{"title":"CloneDVD 4.1 - DEATH RG.zip","uid":3960509,"size":9695325,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1cdec45a7332cb4f5ba6d8a31dd06334f357fb3f&amp;dn=CloneDVD+4.1+-+DEATH+RG.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DeathByJayJay","files":1,"time":1199414468,"description":"SCREENSHOT: http://www.clonedvd.net/images/clonedvd/clonedvd_screenshot1.jpg\n\nCloneDVD enables you to backup your existing DVD collection to DVDÂ±R/RW. With a DVD burner, you will get true DVD copies of any DVD&amp;#039;s in your collection. When true is stated, true was what was intended as you will get no warning screens or watermarks and perfect audio and video quality.\n\nCloneDVD have found an excellent balance between simplicity and flexibility in this application; there&amp;#039;s no need for complicated parameter settings; just one click and your favourite DVD has been cloned. However, if you want options, you got em&amp;#039; - you can copy your DVD movies from a DVD disc or hard disk folder, directly burn to a DVDÂ±R/RW disc, backup to your hard disk, output an ISO image file for future burning, the list is endless.\n\nSupport is there for all popular DVD-5/DVD-9 discs and multiple copy modes: copy the whole movie, copy the main movie only with extras and special features omitted, copy your favourite title/chapter/subtitle/audio, you can even custom-size the target DVD video size to fit your disc.\n\nAs if all this wasn&amp;#039;t enough, you can also backup those CSS-encrypted and region-protected discs in your collection. Without special setting, CloneDVD will automatically remove CSS protection and region codes during copying.;/p&gt; \n\nThis is one cool utility every DVD enthusiast will not want to be without. It&amp;#039;s a small download, a really fun but useful app and comes at a really great value. It&amp;#039;s without a doubt, a 5 Star Pick!\n\nFeatures Include:\n\nReal DVD clone by 1:1 - perfect audio and video quality. \nSupports copying of copyright-protected DVD movies. \nCopy DVDs onto a hard disk or output a DVD image (.ISO). \nRemoves region protection (region-free) \nMacrovision-free features allows you view and record the copied DVDs through your TV-out device without obstruction or distortion. \nSupports both DVD-9(8.5GB) and DVD-5(4.7GB) movies as source or target DVD disc. \nCompletely copy all the special features, intros, menus, subtitles and languages. \nCompress and copy a dual-layer (D9) movie into a single-layer (D5) disc to save disc space. \nSupports splitting a DVD-9 onto two DVDs. Supports DVD-9 to DVD-5 copy, allows you to copy main movie only to fit into one DVD-R \nCustomise target movie size to fit to your output disc. \nCopy your favourite title/chapter/subtitle/audio, remove unwanted content to save disc space. \nHigh compatibility. Supports NTSC and PAL DVD movies. Copied DVDs can be playback on home and PC DVD Players. \nSupports DVD-R, DVD-RW, DVD+R, DVD+RW and most popular DVD recorders/burners on the market. \nMultiple burn engine is selectable, external Nero burn engine supported. \nVery simple to use. Your favourite DVD is just one click away from being cloned. Without any complicated parameter settings. \nFast DVD copy! Copy a 2-hour DVD movie within 45 minutes to one hour. (Depending on your system performance). \nMultiple language interface selectable. \nWhy get the full version?\n\nUnlock CloneDVD for Unlimited Usage. \nFree Upgrades and Patches. \nFree Live Technical Support. \nMinimum System Requirements:\n\n64 MB RAM. \nDVD+RW, DVD-ROM, DVD-RW.\nEnjoy and please help seed cheers - Death\n","torrent":{"xt":"urn:btih:1cdec45a7332cb4f5ba6d8a31dd06334f357fb3f","amp;dn":"CloneDVD+4.1+-+DEATH+RG.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cdec45a7332cb4f5ba6d8a31dd06334f357fb3f","infoHashBuffer":{"type":"Buffer","data":[28,222,196,90,115,50,203,79,91,166,216,163,29,208,99,52,243,87,251,63]},"announce":[],"urlList":[]}}