{"title":"[Kung Fu] The Tai Chi Master (Jason Wu, Amy Fan, 1997) - DVD/Rmv","uid":3859937,"size":5526258765,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1fc80d4a71540fbafe594ea9e7580757775b4100&amp;dn=%5BKung+Fu%5D+The+Tai+Chi+Master+%28Jason+Wu%2C+Amy+Fan%2C+1997%29+-+DVD%2FRmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":42,"time":1193422036,"description":"DON&amp;#039;T MISS THIS ONE GUYS/GALS =&gt; WU JING AT HIS BEST\n\n\nThe Tai Chi Master aka Taiji Zong Shi (Jason Wu, Amy Fan, 1997) - Rmvb, Episodes 01-28\n\nDVD Boxset (Full version, Mandarin only)\n\nYear of Production : 1997\n\nScreenplay: Guo Bao-Xian \n\nDirectors : Cheung Sing Yim, Yuen Wo Ping  \n\nMartial Arts Choreographers : Yuen Wo Ping, Yuen Cheung Yan \n\nCast : Wu Jing, Amy Fan Yi-Min, Yu Hai, Wang Qun, Billy Chow, Liu Xun, Xu Xiang-Dong, Wen Xi-Tai, Kara Hui Ying-Hong, Jin De-Mao, Yang Jie-Mei, Qiu Jian-Guo, Kou Zhan-Wen, Tan Qiao, Chen Kai\n\nTaking almost half a year in production, this martial arts epic features a stellar cast consisting mostly of wushu practitioners. It is rare to see a TV series with as high calibre and down-to-earth martial arts and attention to detail as this, besides a stirring story. It&amp;#039;s a master-piece, an instant classic from Cheung Sing Yim and Yuen Wo Ping. Using the life of Yang Lu Chan, the founder of Yang Style Taichi, and how he secretly studied Tai Chi in Chen Village as a backdrop, the series concentrates more on the development of the protagonist&amp;#039;s martial arts skills and character, as well as edifying the virtues, noble spirit and ethics of martial arts, rather than a dog-eat-dog world where everyone is out to trounce one another.\n\n\nPlot Synopsis:\n\nDue to weak constitution, Yang Yu-Qian (Wu Jing) is not able to achieve new heights in external form of martial arts. Under the advice of his teacher, he travels to Beijing in a bid to find a martial arts expert who could teach him the internal style of martial arts. There, he witnesses the incredible feats of an Eight Trigram Palm (Bagua Zhang) expert (Xu Xiang-Dong, a wushu expert who starred in Holy Robe of Shaolin Temple), Dong Han-Cheng, and that of a Taichi practitioner, both of which are internal styles. Convinced, he asks to be Dong Han-Cheng&amp;#039;s disciple but is turned down for the latter has some urgent matters to attend to. \n\nSo, he journeys on to the remote Chen Village in Henan, from where Tai Chi originated. Again, his request to be taught Taichi is turned down by the village chief and Chen Style Tai Chi Master, Chen Zheng-Ying (Yu Hai), on the account that the ancestral household rules of Chen Village forbid imparting Taichi to outsiders.\n\nMeanwhile, the vindictive Senior Prince Duan (Billy Chow), who is still grievous over his defeat to Chen Zheng-Ying years ago, has been searching high and low for the latter, who lives in the secluded Chen Village. He has always wanted to challenge Chen Zhen-Ying again. His henchmen, have until now, no clues of the whereabouts of Chen Village.\n\nRef.: http://www.wu-jing.org/dramas/master_of_taichi.php\n &lt;a href=&quot;\nhttp://global.yesasia.com/en/PrdDept.aspx/pid-1003750463/code-c/section-videos/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://global.yesasia.com/en/PrdDept.aspx/pid-1003750463/code-c/section-videos/&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:1fc80d4a71540fbafe594ea9e7580757775b4100","amp;dn":"%5BKung+Fu%5D+The+Tai+Chi+Master+%28Jason+Wu%2C+Amy+Fan%2C+1997%29+-+DVD%2FRmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc80d4a71540fbafe594ea9e7580757775b4100","infoHashBuffer":{"type":"Buffer","data":[31,200,13,74,113,84,15,186,254,89,78,169,231,88,7,87,119,91,65,0]},"announce":[],"urlList":[]}}