{"title":"Tiger: Heavy Tank Panzer VI (2005)","uid":3957869,"size":644181661,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:20336580dc8041410eb81d227f875b6f1899138c&amp;dn=Tiger%3A+Heavy+Tank+Panzer+VI+%282005%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Spoiler1","files":2,"time":1199233041,"description":"Tiger: Heavy Tank Panzer VI (2005) \n\n\n\nRelying heavily on authentic World War II-era combat footage, this educational program outlines the creation and use of the powerful Tiger tank, also known as the Panzer VI, one of the most powerful and recognizable symbols of Nazi military power. In addition to showing the Tiger in action, archival film captures the use of the Ferdinand/Elefant on the Eastern Front as well as the Sturmtiger in action during the Warsaw Uprising of 1944.\n\nThis is the second documentary in this series that I&amp;#039;ve rented. Like the companion piece on Assault Guns, this one contains footage not seen elsewhere in numerous other videos on WWII and German weaponry. This covers not just the Tiger I and II, but the other variants like the Elefant, Jagdtiger and Sturmtiger. The latter version is highlighted by the only known surviving combat footage that shows a Sturmtiger in action, during the Warsaw Uprising in 1944. This was also the first time this heavy rocket firing weapon saw action. This DVD would be of special interest to modellers, gamers and those with a general interest in Armored Fighting Vehicles and especially German AFV&amp;#039;s.\n\n\nFormat AVI\n\n","torrent":{"xt":"urn:btih:20336580dc8041410eb81d227f875b6f1899138c","amp;dn":"Tiger%3A+Heavy+Tank+Panzer+VI+%282005%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20336580dc8041410eb81d227f875b6f1899138c","infoHashBuffer":{"type":"Buffer","data":[32,51,101,128,220,128,65,65,14,184,29,34,127,135,91,111,24,153,19,140]},"announce":[],"urlList":[]}}