{"title":"Tarr Chronicles [English][PCDVD]","uid":3826892,"size":1167032239,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:20ef43b4e604d50032a7348c7799a2a04c293353&amp;dn=Tarr+Chronicles+%5BEnglish%5D%5BPCDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"changoboy","files":26,"time":1191311149,"description":"Torn by years of strife and bloodshed, the universe lies dying, with humanity struggling to survive. Suddenly, hope shines again, as the Battlecruiser Talestra uncovers an ancient, forgotten city within which rests salvation for an entire solar system. Hostile alien forces have other plans for the artifacts found within the city, and begin their assault on the Talestra.\nLost in space and deep behind enemy lines, the player must don an elite fighter pilots uniform and defend the galaxys last hope in Tarr Chronicles, a gripping arcade-style space combat simulation in development by Kvazar Studio and Akella. At your disposal are dozens of detailed high-tech fighters bristling with cannons and rocket launchers, yours to fly against an unstoppable alien menace - the DeKhete. Intelligent squad mates with unique personalities will assist you in frenzied white-knuckle space battles between vast fleets of fighters and massive capital ships. From fully-customisable equipment to collectible badges and fast-action combat encounters, Tarr Chronicles will keep you pinned to your seat. ","torrent":{"xt":"urn:btih:20ef43b4e604d50032a7348c7799a2a04c293353","amp;dn":"Tarr+Chronicles+%5BEnglish%5D%5BPCDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ef43b4e604d50032a7348c7799a2a04c293353","infoHashBuffer":{"type":"Buffer","data":[32,239,67,180,230,4,213,0,50,167,52,140,119,153,162,160,76,41,51,83]},"announce":[],"urlList":[]}}