{"title":"Beckley-Lamm-Wilson - Like A Brother","uid":3951155,"size":60361183,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:213f44786518910d4849071d87f557254f763698&amp;dn=Beckley-Lamm-Wilson+-+Like+A+Brother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"st2580smile","files":1,"time":1198863535,"description":"The best track on In My Head (1999), the third solo album by Chicago singer/keyboardist Robert Lamm, was &quot;Watching the Time Go By,&quot; a song on which he was joined by Gerry Beckley of America (who wrote it) and Carl Wilson of the Beach Boys. The tune suggested a potential partnership by these three rock veterans that comes to fruition on Like a Brother. The teaming frees the performers to explore unusually personal topics; the songs are full of reminiscences and reflections on past experiences that give way to observations on the present characterized by determination and benevolence. Beckley&amp;#039;s &quot;Watching the Time&quot; (a new version of &quot;Watching the Time Go By&quot;) and Lamm&amp;#039;s &quot;Life in Motion&quot; both look back on youthful illusions in the light of later wisdom. But it is Wilson who has a disproportionate presence on the record, with four co-compositions (to Lamm and Beckley&amp;#039;s two each) and five lead vocals (to Beckley&amp;#039;s three and Lamm&amp;#039;s two). This is far and away Wilson&amp;#039;s best non-Beach Boys work, and some of the best work of his career. His songs are full of a sense of a generous love, the kind one feels for family rather than a romantic partner. &quot;I Wish for You&quot; might be written for a child, while &quot;They&amp;#039;re Only Words&quot; warns that love must be acted on, not just spoken about. The album&amp;#039;s most striking song is &quot;Like a Brother,&quot; Wilson&amp;#039;s tribute to his brother Brian, in which he discusses the oddity of earning applause every night for performing music written by his usually absent sibling. &quot;Like a Brother&quot; deserves a place in any Beach Boys fan&amp;#039;s collection. \n\nBeyond the songs as compositions, the album is stunning aurally, the three singers proving to have a wonderful blend and, coming from three bands in which they had to learn a lot about harmony and vocal arrangement, to be experts in the creation of luscious vocal music. This is the work of studio types who know how to make highly produced rock, and though there are simple, unadorned moments, for the most part this is densely arranged pop/rock that does justice to its creators&amp;#039; abilities. And yet the songs are some of the most introspective that any of these talents ? each of whom has, to some extent, been subsumed within a group context ? has ever performed. The tragedy, of course, is that Wilson&amp;#039;s death makes this a one-off effort.  (AMG)","torrent":{"xt":"urn:btih:213f44786518910d4849071d87f557254f763698","amp;dn":"Beckley-Lamm-Wilson+-+Like+A+Brother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"213f44786518910d4849071d87f557254f763698","infoHashBuffer":{"type":"Buffer","data":[33,63,68,120,101,24,145,13,72,73,7,29,135,245,87,37,79,118,54,152]},"announce":[],"urlList":[]}}