{"title":"Alex Jones- Endgame; Blueprint For Global Enslavement","uid":3954625,"size":239786648,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:21faffa238a8b847d7957594ecb7d64be9626d20&amp;dn=Alex+Jones-+Endgame%3B+Blueprint+For+Global+Enslavement&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":1,"time":1199068470,"description":" &quot;Countless people will hate the new world order and will die protesting against it.&quot; - H.G. Wells, The New World Order , 1939.\n\nAlex Jones&amp;#039; newest film Endgame is an exploration into the dark history of the global elite and an expose of their now public aspiration to follow a program of dehumanization in order to secure a brutal monopoly over the planet&amp;#039;s future.\n\nAlmost a year and a half in production and filmed on location in Istanbul Turkey, Ottawa Canada, New York and Texas, Endgame was shot in High Definition and runs at 2 hours and 20 minutes long.\n\nThe elite have made no bones over the fact that the only sustainable future in which their power can remain unchecked is one where the world&amp;#039;s population is reduced by over 80%.\n\nTheir endgame ensures that they will never have to struggle with a middle class, face a new renaissance or a rising new elite class that could overthrow them and displace them.\n\nJust as the Romans salted the earth at Carthage, ensuring that for hundreds of years crops would not grow, when Hannibal and his people resisted their brutal empire during the Punic Wars, modern day elite oppressors have set about a program to stifle and degrade human progress solely for the benefit of their own power and control.\n\nEndgame exposes this Movement by charting the history of the elite&amp;#039;s new world order going back some 250 years. The film focuses on the Napoleonic era, the Rothschilds and the rise of the central banks and the takeover of the United States by elite institutions such as the Council on Foreign Relations.\n\nThe film maps out the British model of hidden empire and the forms of social control carefully studied and adapted by the Anglo-American establishment, headed by groups such as Bilderberg, who have been instrumental in centralizing elite control via the formation of the European Union and the continued progression towards an American Union.\n\nThe history of Eugenics is traced from its origins, through it&amp;#039;s hijacking for evil by power hungry elites to a dangerous future under the social Malthusians, psychologists and anthropologists that continue to push the dehumanization agenda.\n\nEndgame reveals a truth that we must face up to in order to secure our own continued existence as a free race on this planet.\n\n&quot;This film is the sum of all I have learned in my life and my quest to investigate the New World Order.&quot; - Alex Jones. \n\nI made this in .rv format, for convenience (notice the small size).  Simply use RealPlayer to view.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:21faffa238a8b847d7957594ecb7d64be9626d20","amp;dn":"Alex+Jones-+Endgame%3B+Blueprint+For+Global+Enslavement","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21faffa238a8b847d7957594ecb7d64be9626d20","infoHashBuffer":{"type":"Buffer","data":[33,250,255,162,56,168,184,71,215,149,117,148,236,183,214,75,233,98,109,32]},"announce":[],"urlList":[]}}