{"title":"xbtit v2.0.458","uid":3955816,"size":2314100,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:2309427267134a95c7d73c2f6133d58de5755548&amp;dn=xbtit+v2.0.458&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"binkles","files":1,"time":1199128420,"description":" &lt;a href=&quot;http://torrentfreak.com/put-a-head-on-the-bittorrent-hydra-with-xbtit-071228/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://torrentfreak.com/put-a-head-on-the-bittorrent-hydra-with-xbtit-071228/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xbtit.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xbtit.com/&lt;/a&gt;\n\n\n\n\nReadMe.txt.\n\n\n#--------------------------#\n# Welcome to the xbtit v.2 #\n#--------------------------#\nJust a few words about this piece of script and some credits wink.gif\n\nThe script is released under modified BSD, which mean you can freely use and\nmodify it (read LICENSE for more info)\n\nxbtit is a complete rewrite of our BtiTracker base code. Every file has been changed, it is impracticable to list all the changes here. xbtit is the concentration of biteam.org&amp;#039;s years of experience developing, hacking, and operating, tracker software. We are confident you are going to enjoy this release\n\nTo upgrade your modified Btit 1.4.x to xbtit it is necessary to upgrade your current db using upgrade.php (not included in the standard package) and then reapply your hacks to the new xbtit code. Although xbtit has a hack template system designed to make the application of hacks easy, none of our 1.4.x hacks have yet been packaged for xbtit, these will arrive in time as the community adopts the new code\n\nxbtit has two bittorrent tracker systems - a PHP tracker and xbtt. The PHP tracker is designed for platforms without access to the system root, or where your tracker is not expected to run with greater than 5-10,000 peers. A PHP tracker can generate a high volume of TCP traffic, potentially millions of hits per day on port 80, you have been cautioned. The second tracker system is xbtt by Olaf van der Spek. xbtt is an efficient C++ tracker capable of running millions of peers at very low overhead, you are recommended in all cases to use the xbtt system\n\nThe tracker is professionally supported for a small fee at http://www.xbtit.com where you will also find private hacks, modifications, and styles\n\nThe opensource free support forum is http://www.btiteam.org\n\n#----------------#\n# MAJOR FEATURES #\n#----------------#\n- real template system, 99% of the html code is out for the PHP files using bTemplate http://www.massassi.com/bTemplate/\n- rewritten (optimized) announce.php (the PHP tracker)\n- integrated optional xbtt backend by Olaf Van der Spek http://xbtt.sourceforge.net/tracker/\n- support for external mail server using phpmailer http://sourceforge.net/projects/phpmailer\n- rewritten internal forum with subforum support\n- integrated optional smf forum (big thanks to petr1fied) http://www.simplemachines.org/\n- one click hack installer, an easy way to install hacks into your tracker (a working example is provided)\n- modules support\n- new online procedure\n- new AJAX shoutbox (big thanks to miskotes)\n- XSS/SQL injection protection with log insertion (thank you cobracrk)\n- new AJAX polls system (thank you to Ripper)\n- new design (4 styles provided by TreepTopClimber)\n- RSS reader (only class, with example in admincp for btiteam.org latest news)\n- basic cache system\n- new language system (array is used instead of constant)\n- smf_import script to import standard internal forum and users to smf (thank you again to petr1fied)\n- 1.4.x upgrade script\n\n#--------------#\n# REQUIREMENTS #\n#--------------#\n- Web server with Apache or Lighttp installed and running\n- PHP 4.1 or higher\n- Mysql 4.1 or higher\n\n#----------------#\n# DOCUMENTATION  #\n#----------------#\nWe are working on a wiki which will give information, installation steps, how to, etc ...\nat the moment it is a &quot;work in progress&quot; site: http://wiki.btiteam.org\n\n#---------#\n# CREDITS #\n#---------#\nThe script in this version is very very different than the original one, but we are pleased to leave the credits from previous version from which this is born wink.gif\n\nThis tracker&amp;#039;s origin was as a frontend for DeHackEd&amp;#039;s tracker aka phpBTTracker (now almost extinct)\n\nWe aimed to make a nice user interface and a good admin tool at the same time. Some code and some ideas came from other trackers and projects:\n- torrentbits (http://www.torrentbits.org - dead)\n- torrenttrader (http://www.torrentrader.org)\n- bytemoonsoon (deadlink)\n- Tbdev: CoLdFuSiOn (http://www.tbdev.net)\n- xbtt: Olaf van der Spek (http://xbtt.sourceforge.net)\n- phpmailer (http://sourceforge.net/projects/phpmailer)\n- smf (http://www.simplemachines.org/)\n- bTemplate: Brian Lozier (http://www.massassi.com/bTemplate)\n\nThe rest has been coded, designed, and thought up from scratch\n\nThanks to coder addons/hacks (many are included in this version):\nRipper, cobracrk, JBoy, Liroy, Petr1fied, miskotes, gAndo, Fireworx, Freelancer, Sktoch, Nimrod, etc ... sorry if someone is missed smile1.gif\n\nThanks to style maker:\nTreeTopClimber\n\nMany thanks to all guys who participated for the testing and for addons/styles etc.\n\nBtiteam","torrent":{"xt":"urn:btih:2309427267134a95c7d73c2f6133d58de5755548","amp;dn":"xbtit+v2.0.458","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2309427267134a95c7d73c2f6133d58de5755548","infoHashBuffer":{"type":"Buffer","data":[35,9,66,114,103,19,74,149,199,215,60,47,97,51,213,141,229,117,85,72]},"announce":[],"urlList":[]}}