{"title":"Darkstone.rar","uid":3571592,"size":535529356,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:23b22fcb4c5a44162c28277285eef66ce11b02e7&amp;dn=Darkstone.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"univibe69","files":1,"time":1165385010,"description":"Darkstone is still a fine game, if a little dated now graphically. \nReleased late &amp;#039;98 - DX7\n\nFeatures full 3D in a colourful environment with variable zoom/angle and several hot-keyed viewpoints.  \nThe main quest is replayable as it consists of 7 dungeon/overland stages which are randomly selected from a bank of 21 original sub-quests each new Game. \nSave anywhere.  Large selection of spells, weapons and skills.  \nSelectable difficulty levels for new games with a skilled character - characters are saved separately and gain experience etc over multiple replays.\nIncluded is a company-made alternative plotline called &quot;Journey in UMA&quot; which was made as a demonstration of the new Quest Editor (- THE FIRST IN THE WORLD)\n\nIn addition, there are many fan-made custom quests - basically a whole new game, though same character, though all feature the same final dungeon for the slay-the-dragon scene.\nPlay solo OR with an AI partner.  Play on LAN/net.\n\nLast time I looked the custom quests are readily available along with support and game help.  A Darkstone community exists (in English) at the German site http://forum.withingames.net/index.php, which apparently absorbed the remains of the original official site when the company went bust.\n\n - had this game received the attention it richly deserved,  that might not have happened. :-(  \n\nSo you&amp;#039;re late, but not too late..... \nMinimal protection - just burn to CD and enjoy! :-D   \n\nafterthought - \nLands and dungeon areas are flat - no walking up slopes or stairs.  :-p\nCan be cranky with some Nvidia GFX cards   :-|    - check the link for details","torrent":{"xt":"urn:btih:23b22fcb4c5a44162c28277285eef66ce11b02e7","amp;dn":"Darkstone.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b22fcb4c5a44162c28277285eef66ce11b02e7","infoHashBuffer":{"type":"Buffer","data":[35,178,47,203,76,90,68,22,44,40,39,114,133,238,246,108,225,27,2,231]},"announce":[],"urlList":[]}}