{"title":"LOST SEASON 3 DISC1 Episodes 0 to 4 by deathmule","uid":3548413,"size":4019109888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:248d707606a07655df1ce80209765bedaf91f60d&amp;dn=LOST+SEASON+3+DISC1+Episodes+0+to+4+by+deathmule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"deathmule","files":8,"time":1162224931,"description":"LOST SEASON 3 DISC1 Episode 0 to 4 by deathmule\n\n\n&lt;Original Air Date: 09/27/2006\n------------------------------\nEPISODE 300: recap of season 1/2\n\n\n\nOriginal Air Date: 10/04/2006\n-----------------------------\nGallery \nEPISODE 301 SYNOPSIS\n \nA Tale of Two Cities\nWe\\\\\\&amp;#039;re back...in the middle of a suburban home as a woman puts on a CD and prepares her house for guests.Who is this woman?And why is she upset?She sings along to cheer herself up as she prepares muffins for her book club meeting.During the meeting, just as a debate gets heated, the room starts shaking.Is it an earthquake?The book club members run outside to investigate -- and we see they are a part of a small community of houses.Everybody tracks the noises upwards to see a plane tear apart in mid-air.The fuselage falls in one direction while the tail section falls in another.A familiar face, Henry Gale, gives orders and we realize what we\\\\\\&amp;#039;ve just witnessed: the crash of Ocean Flight 815.\n\nDon\\\\\\&amp;#039;t let suburbia fool you -- this is the Others\\\\\\&amp;#039; home.We\\\\\\&amp;#039;ve been on the island all this time.Welcome to Season Three, folks.We\\\\\\&amp;#039;re still LOST.\n\nJack awakes on a dark steel table in a room with Plexiglass dividing it and a harness hanging from the ceiling.He tries to get out but the room is secured and locked. \n\n\n\nOriginal Air Date: 10/18/2006\n-----------------------------\nGallery \nEPISODE 302 SYNOPSIS \n\nFurther Instructions\nLocke wakes up in the jungle, disoriented, wondering how he got there.Then he hears something in the brush.It sounds like someone running.He looks over and sees Desmond run by, completely naked.Locke tries to shout out to him but can\\\\\\&amp;#039;t.Locke finds himself mute.\n\nBack at the camp, Locke builds a sweat lodge.Charlie tries to talk to him, but Locke can\\\\\\&amp;#039;t speak.He mimes that he\\\\\\&amp;#039;s going to talk to the island, and he asks Charlie to stand guard outside his structure.\n\nInside, Locke prepares a bowl of paste and then eats it.Sweating, Locke goes into a trance -- and finds Boone sitting next to him.In Locke\\\\\\&amp;#039;s vision, Boone puts him in his old wheelchair and takes him through the Sydney airport.Boone tells him someone is in danger and Locke is the only one who can save them.Is it Claire and Charlie with Aaron waiting at check-in?Sun and Jin arguing with Sayid breaking it up?Hurley and Desmond as Oceanic Air employees?Or Jack, Kate and Sawyer in line at a security checkpoint with Henry Gale as the security guard? \n\n\n\nOriginal Air Date: 10/11/2006\n-----------------------------\nGallery \nEPISODE 303 SYNOPSIS\n \nThe Glass Ballerina\nLittle seven-year-old Sun breaks a glass ballerina and lies about it to her father.She blames the maid, knowing full well she\\\\\\&amp;#039;ll be fired.Her father knows Sun is lying and is disappointed with her but accepts her story.\n\nFlash forward to the sailboat, where Sayid, Jin and Sun still wait for Jack, Kate, Sawyer, Hurley and Michael.Sayid is concerned they can\\\\\\&amp;#039;t see their signal fire and wants to sail around the mountains and light another fire.Worried about Sun\\\\\\&amp;#039;s health, Jin won\\\\\\&amp;#039;t do it.He wants to leave and claims only he can sail the boat.However, Sun reveals that she, too, can sail the boat and decides they will do what Sayid wants.\n\nIn the Hydra station, Ben learns from Colleen that \\\\\\&quot;the Iraqi\\\\\\&quot; has a sailboat and might be able find them.Ben tells Colleen to put together a team and go get the sailboat.Colleen tells Pickett about her orders, and he kisses her good-bye on the check.\n\nSawyer and Kate witness this interesting moment before they are taken out to a jungle clearing and ordered to remove the rocks. \n\n\n\nOriginal Air Date: 10/25/2006\n-----------------------------\nGallery \nEPISODE 304 SYNOPSIS \n\nEvery Man for Himself\nSawyer rigs his cage so he and Kate can escape.Ben approaches, and Sawyer grabs him.However, nothing happens.Ben tells him they turned off the electricity, and beats Sawyer unconscious.When he wakes up, he\\\\\\&amp;#039;s strapped down to a table.They shove a stick in his mouth and plunge a huge needle into his heart!\n\nLater, Ben shows Sawyer a caged rabbit.Ben scares the bunny, which falls over and dies.It had a small pacemaker inserted in its heart to give it a kick-start if it gets anxious, frightened, or tries to escape.Ben gives Sawyer a heart rate monitor and warns him that if his heart rate goes over 140 his heart will explode.And if Sawyer tells Kate, they\\\\\\&amp;#039;ll put a pacemaker in her, too.\n\nBack at the cages, Kate immediately questions him, but Sawyer ain\\\\\\&amp;#039;t talkin\\\\\\&amp;#039;.Kate has an escape plan -- she could squeeze through the bars at the top of her cage and get them out.Sawyer dissuades her.Kate doesn\\\\\\&amp;#039;t understand.They could escape and he\\\\\\&amp;#039;s telling her not to?\n\nFlashback to Sawyer in jail. \n\n\nenjoy :)","torrent":{"xt":"urn:btih:248d707606a07655df1ce80209765bedaf91f60d","amp;dn":"LOST+SEASON+3+DISC1+Episodes+0+to+4+by+deathmule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"248d707606a07655df1ce80209765bedaf91f60d","infoHashBuffer":{"type":"Buffer","data":[36,141,112,118,6,160,118,85,223,28,232,2,9,118,91,237,175,145,246,13]},"announce":[],"urlList":[]}}