{"title":"[Kung_Fu]_Wu Dang I (Carman Lee, Jiu Yan Chuen, 2004) - DVD/Rmvb","uid":3806883,"size":4822261190,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2510d4e0e8783900cc093038e68c071411b218fd&amp;dn=%5BKung_Fu%5D_Wu+Dang+I+%28Carman+Lee%2C+Jiu+Yan+Chuen%2C+2004%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":41,"time":1189810511,"description":"Wu Dang I (Carman Lee, Jiu Yan Chuen, 2004), Episodes 01-36\n\n\nWu Dang is the first cloak-and-sword TV-series in China centering on the theme of the Toaism culture. The 36-episode drama tells the saga about Toaism influential figure Zhang San-feng from his personal history, friendship, love affair, kung fu to fate.\n\nTowards the end of the Yuan dynasty, in a time of conflict and strife, many heroes arose.\nWudang held a celebration for qiu chu ji&amp;#039;s 100th birthday during which, Zhu yuanzhang, a monk from huang jue temple, ma zhi nan the goddaughter of rebel leader guo zi xing, shen rong a lady from a wealthy family and Zhang Junbao, one of qiu chu ji&amp;#039;s disciples became good friends.\nchi bilie huo lang who had been training hard in the desert for many years went to Wudang to challenge qiu. Qiu gets badly injured and lies on the border between life and death while junbao gets captured. \nZhu Yuanzhang enlists with Guo zi xing&amp;#039;s rebels but is framed forced to become a beggar. Seeking death, he jumps of a cliff, fortunately, he is saved by Junbao and recovers his confidence.\nShen Rong who had a relationship with Zhu Yuanzhang searches for him as she is pregnant, but finds that Zhu has married ma zhi nan to gain control of the rebel army. Shen Rong&amp;#039;s great sorrow causes her to have a miscarriage and dies, and Junbao is devestated with sorrow at her death.\nchi bi lie, finding out that Qiu is not dead, goes to Wudang once more to challenge him and they end up injuring each other. Before he dies, Qiu leaves behind am eight word secret mantra for Junbao. Junbao has a revelation regarding the secret mantra develops the taiji fist and renames himself Zhang SanFeng.\nAfter Zhu becomes emperor he wants to kill everybody and will not even spare zhang sanfeng. In anger, sanfeng kills the 18 dragon horsemen and barges his way past palace security to kill Zhu. Ma zhi nan, now empress, rushes to beg sanfeng not to kill Zhu. Sanfeng has no choice but to let Zhu go and retires to Wudang, no longer questioning the martial world.\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:2510d4e0e8783900cc093038e68c071411b218fd","amp;dn":"%5BKung_Fu%5D_Wu+Dang+I+%28Carman+Lee%2C+Jiu+Yan+Chuen%2C+2004%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2510d4e0e8783900cc093038e68c071411b218fd","infoHashBuffer":{"type":"Buffer","data":[37,16,212,224,232,120,57,0,204,9,48,56,230,140,7,20,17,178,24,253]},"announce":[],"urlList":[]}}