{"title":"Coast to Coast Radio Program! Commercial Free! Dec 26th thru Jan","uid":3964508,"size":615677750,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2574464974e6dde87bad5ec411fb0ed9f7f95ae3&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Dec+26th+thru+Jan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":55,"time":1199646558,"description":"No excuses, I was lazy and seriously forgot about uploading the C2C this week. Any way, here is what you freaks have been waiting for. Please SEED as this is the beginning of 2008 and let&amp;#039;s start it off with a bang. Thanks in advance and I am going to do my best to get things back on track. Later All! Stokeman out, until next time, hopefully not eleven days from now....\n\nWednesday December 26th, 2007\nUFOs and Presidents\nUFO Researcher and author Grant Cameron presented stories and documentation of U.S. Presidents and their involvement with UFO phenomena. He also discussed various presidential candidates and their UFO related experiences. Many of the current candidates,...\nHost: George Noory\nGuest(s): Grant Cameron, Stephen S. Mehler\n\nThursday December 27th, 2007\nAstronomy &amp; Asteroids\nAstronomer Phil Plait spoke about various space-related news and stories. An asteroid, 2007 WD5, has a 1 in 75 chance (possibly 1 in 25) of hitting Mars on Jan. 30th. Scientists are hopeful that the collision will occur as it would give them the opportunity... \nHost: George Noory\nGuest(s): Phil Plait, Warren Getler, Jerome Corsi\n\nFriday December 28th, 2007\nPrivacy Issues &amp; Open Lines\nFilling in for George, Ian Punnett welcomed author and consultant Andrew Colarik, who commented on various privacy-related issues during the first two hours of Friday&amp;#039;s show. Colarik spoke about the domestic satellite surveillance program, which... \nHost: Ian Punnett\nGuest(s): Open Lines, Andrew Colarik\n\nSaturday December 29th, 2007\nFood &amp; Mental Health\nClinical nutritionist and author of The Crazy Makers, Carol Simontacchi discussed the relationship between food and mental health. She pointed out that a direct causative relationship exists between the consumption of fruits and vegetables and depression... \nHost: Ian Punnett\nGuest(s): Carol Simontacchi, Howard Bloom\n\nSunday December 30th, 2007\nPredictions for 2008 - Part I\nArt Bell hosted Part I of his Annual Predictions Show, with callers invited to share one event they see coming in 2008. Here are some of the predictions Coast listeners made for 2008: Chris from NYC said that in March the price of oil will drop down... \nHost: Art Bell\nGuest(s): Open Lines\n\nMonday December 31st, 2007\nPredictions for 2008 - Part II\nArt Bell hosted Part II of his Annual Predictions Show, with callers invited to share one event they see coming in 2008. Here are some of the predictions Coast listeners had for 2008: Bill from Toronto predicted that Blackberry sales will hit $2... \nHost: Art Bell\nGuest(s): Open Lines\n\nTuesday January 1st, 2008\nPredictions Special: 2008\nKicking off the New Year, Ian Punnett hosted Coast to Coast AM&amp;#039;s annual prediction show featuring psychics and prognosticators sharing what they see coming in the year 2008. In order of the guests&amp;#039; appearances, here are some of the highlights: Trendcaster... \nHost: Ian Punnett\nGuest(s): Gerald Celente, Galen Cook, George Ure, Paul Guercio, Glynis McCants, Sean David Morton, Mark Lerner\n\nWednesday January 2nd, 2008\nAmerica&amp;#039;s Economic Crisis\nIn a 4-hour special on America&amp;#039;s economic problems, Rollye James spoke separately with four financial experts. First up was author and radio host Andre Eggelletion who discussed problems with the Federal Reserve and its historical background. The Fed..\nHost: Rollye James\nGuest(s): Michael Shedlock, Andre Eggelletion, Joe Meyer, Catherine Austin Fitts\n\nThursday January 3rd, 2008\nUFOs &amp; Parallel Realities\nAuthor and expert on alien abduction, Whitley Strieber joined Art Bell for a discussion on close encounters, drones, and parallel dimensions. Strieber&amp;#039;s latest encounter took place last month in Santa Monica where he witnessed a large object in the...\nHost: Art Bell\nGuest(s): Whitley Strieber\n\nFriday January 4th, 2008\nAvian Flu Pandemic\nArt Bell spoke with practicing internist Dr. Gary Ridenour about why he believes that avian flu represents the greatest health threat to mankind in the history of the world. The current strain of avian flu kills about 60% of the people who contract... \nHost: Art Bell\nGuest(s): Gary Ridenour\n\nSaturday January 5th, 2008\nSolar Cycle 24\nFuturist John Jay Harper discussed how Solar Cycle 24 indicates we&amp;#039;re entering a cataclysmic cycle for climate and civilization. Full recap to follow...\nHost: Ian Punnett\nGuest(s): John Jay Harper, Galen Cook","torrent":{"xt":"urn:btih:2574464974e6dde87bad5ec411fb0ed9f7f95ae3","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Dec+26th+thru+Jan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2574464974e6dde87bad5ec411fb0ed9f7f95ae3","infoHashBuffer":{"type":"Buffer","data":[37,116,70,73,116,230,221,232,123,173,94,196,17,251,14,217,247,249,90,227]},"announce":[],"urlList":[]}}