{"title":"The Immortal - Book 1 - JJ Dewey","uid":3562097,"size":213917,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:258159e4b050ada9aa4169ddab2c00962f09d8c4&amp;dn=The+Immortal+-+Book+1+-+JJ+Dewey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dontuspamme","files":1,"time":1164150524,"description":"Critically acclaimed by thousands of readers worldwide, this first installment in The Immortal series is one of today\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s most captivating works in metaphysical, new age thought. In a provocative synthesis of both fiction and non-fiction, this dramatic story draws from the author\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s many true life experiences to create a fascinating account of one man\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s encounter with a virtual immortal--John, the Beloved, the Revelator, an Apostle of Jesus, perhaps the most mysterious man in history.\n\nJoseph, the main character, perseveres in his unfolding journey to obtain greater knowledge and understanding of the higher truths and ageless wisdom...and the mysteries of the ages. What is true and what is fiction? That is for the reader to determine.\n\nSince 1997, when this book was first published, Mr. Dewey has taught one of the most active online discussion groups called The Keys of Knowledge. He has published several thousand articles and podcasts on the web, and written numerous books. Each year readers from around the world gather for a three-day symposium to hear Mr. Dewey teach them in person. The audio of these symposium sessions are currently available on CD-ROM in mp3 format.","torrent":{"xt":"urn:btih:258159e4b050ada9aa4169ddab2c00962f09d8c4","amp;dn":"The+Immortal+-+Book+1+-+JJ+Dewey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"258159e4b050ada9aa4169ddab2c00962f09d8c4","infoHashBuffer":{"type":"Buffer","data":[37,129,89,228,176,80,173,169,170,65,105,221,171,44,0,150,47,9,216,196]},"announce":[],"urlList":[]}}