{"title":"The.Holy.Quran","uid":3710050,"size":113619407,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:25b1a535f9a55bbfa88e134672c55af1aaffe408&amp;dn=The.Holy.Quran&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"haytham115","files":1,"time":1181434104,"description":"COPYRIGHT POLICY:\n\nBy submitting content on this site, you must agree to be bound by these Terms of Use. If you do not agree to these terms, you may not proceed.\n\nThe information services contained in this web site are provided on an &quot;as is&quot; basis with no waranty. To the maxium extent of permitted by applicable law, btjunkie disclaims all representation and warranties, express or implied, with respect to such information, services, products, and materials, including without limitation any implied warranties of merchantability, fitness for a particular purpose and noninfrigement. In addition, btjunkie does not warrant that the information accessible via this web site is current, complete, or error-free. In no event will btjunkie be liable for any consequential, indirect, incidental, special, or punitive damges, however caused and under any theory of liability (including negligence), arising from your use of this site or the provision of the information, services, products, and materials contained in this site, even if btjunkie has been advised of the possibilty of such damages.\n\nYou are prohibited from submitting or transmitting to or from the Site any unlawful, threatening, libelous, defamatory, obscene, or pornographic materials that would violate any law or the rights of others, including without limitation, laws against copyright infringement. Violation of these restrictions may result in restricting or limiting your access or use of the Site. btjunkie also reserves the right to remove any users submission at its own discrection. We also reserve the right to suspend or terminate your access to this site, at any given time without prior notice or liability.\n\nbtjunkie, may, but is not obligated to, monitor or review any areas on the Site where users submit or transmit Users Subbmisions, and the substance of any User Submissions.\n\nTo the maximumextent permitted by law, btjunkie will have no liability related to User Submissions arising under the laws of copyright, libel, privacy, obscenity, or otherwise. btjunkie disclaims any and all liability with respect to the misuse, loss, modification, or unavailability of any User Submissions.\n\nbtjunkie reserved the right, at any time, to modify, alter or update these Terms of Use and you agree to be bound by such modifications, alterations or updates.\n","torrent":{"xt":"urn:btih:25b1a535f9a55bbfa88e134672c55af1aaffe408","amp;dn":"The.Holy.Quran","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25b1a535f9a55bbfa88e134672c55af1aaffe408","infoHashBuffer":{"type":"Buffer","data":[37,177,165,53,249,165,91,191,168,142,19,70,114,197,90,241,170,255,228,8]},"announce":[],"urlList":[]}}