{"title":"WinAVI Video Converter 8.0 - Final","uid":3697077,"size":4527266,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:29abb8d6b8241a7f4db7ee083314edabb9f5fa1d&amp;dn=WinAVI+Video+Converter+8.0+-+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boorstar","files":5,"time":1180113214,"description":"WinAVI Video Converter is a ALL-IN-ONE solution for video file converting and burning, easy to use and powerful for experts. Just one click to convert with beautiful user interface. Burning VCD/SVCD/DVD is supported. It supports almost all video file formats, including AVI, MPEG1/2/4, VCD/SVCD/DVD, DivX, XVid, ASF, WMV, RM, QuickTime MOV, Flash SWF. WinAVI Video Converter has the fastest video/audio decode/encode engine in the world, convert any media to DVD in 90 minutes with stunning video and audio quality. You can enjoy the film with your home &amp; PC DVD Player.\n\nFeatures:\n- AVI to DVD\n- AVI to MPEG\n- AVI to VCD\n- AVI to MPG\n- Flash SWF conversion\n- It can convert all formats to MPEG1/2, VCD, SVCD, and DVD and burn to VCD, SVCD, or DVD disc.\n- It can convert all video formats to AVI/WMV/RM/ASF/Divx/Xvid\n- QuickTime MOV conversion.\n- Real DVD Navigator encoder included.\n- DirectAC3 technology supports AC3 5.1, which is state of the art technology. It is up to 20% faster with AVI files including AC3 audio.\n- Real Dolby AC3 audio encoder included.\n- Burning VCD/SVCD/DVD.\n- Stunning video and audio quality.\n- User-friendly interface that is easy to use.\n- Has the option to preview the video in real-time.\n- Has the option to automatically shutdown your computer when the conversion has been completed.\n\nNote: If you want to converter any format to RM, you should download RMSDK first, please click here&gt;&gt;,and unzip it to the sub-directory &quot;HelixSDK&quot; of the location which you installed WinAVI Video Converter 8.0 Beta.\n\nHow to install RMSDK:\n1. The file only can be used for WinAVI Video Converter 8.0 (beta).\n2. In the normal way of installing the WinAVI Video Converter 8.0, the installation will run the RMSDK automatically; you have no need to do with the RMSDK.\n3. While the WinAVI Video Converter 8.0 haven&amp;#039;t installed in the normal way, the RMSDK will be installed automatically under C:, please copy and save the directory under C:HelixSDK to \\WinAVI Video Converter.\n\nWhat&amp;#039;s new in WinAVI Video Converter 8.0:\n01. New DVD Menu/Navigation Information/Multiplex Video Mixing engines developed. Support to create DVD menu/naviagation information and input multiplex video mixing.\n02. Support rip DVD to any format, etc. Xvid+MP3....\n03. Support to select multiple audio and subtitle streams.\n04. Brand-new MPEG Encoder, which specifies more preferences.\n05. Support to output MPEG file in it&amp;#039;s elementary streams.\n06. Support to output MPEG2 PS (Program Stream) and TS (Transport Stream).\n07. Support Closed GOP function.\n08. Support to encode MPEG C-VBR (Constant-Variable Bitrate).\n09. Support to encode Divx-HD format.\n10. Rewrite MPlex Component, which supports to encode any picture size and avoid buffer overrun/copy to speed up conversions.\n11. Support to select MPEG1/2 aspect ratio and automatically choose proper bitrate according to picture size.\n12. Support to synthesize DVD subtitle streams.\n13. Support to real time preview source video while doing settings.\n14. Support to adjust volume/brightness/contrast for output files.\n15. Add audio and video sync function.\n16. Add an indicator for final file size.\n17. Support to select video decoder/splitter. Solved the problem on the compatibility between different decoders.\n18. New method of MOV/Real Media decoding. Now converting MOV/Real Media to any format will be much perfecter.\n19. New DVD-burning engine, more stable.\n20. Support to set the start and end point of conversions.\n21. Fixed all known bugs.\n\nHomepage - http://www.winavi.com/en/index.htm","torrent":{"xt":"urn:btih:29abb8d6b8241a7f4db7ee083314edabb9f5fa1d","amp;dn":"WinAVI+Video+Converter+8.0+-+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29abb8d6b8241a7f4db7ee083314edabb9f5fa1d","infoHashBuffer":{"type":"Buffer","data":[41,171,184,214,184,36,26,127,77,183,238,8,51,20,237,171,185,245,250,29]},"announce":[],"urlList":[]}}