{"title":"pamas kiidstime 19 4 kinderfilms op 1","uid":3574671,"size":4704568286,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2ba56dd563bd68445e311e0bf5c1239485cf4c8d&amp;dn=pamas+kiidstime+19+4+kinderfilms+op+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lowiekuipers","files":48,"time":1165802684,"description":"Pamas KidsTime 19\n\nDombo (1941) DD5.1\nDe nieuwe zoon van Mrs. Jumbo wordt belachelijk gemaakt vanwege zijn gigantische oren, en krijgt de naam Dumbo mee. Dumbo wordt aan het werk gezet bij de clowns van het circus waar zijn moeder werkzaam is. Het is aan zijn enige vriend, een muis, om Dumbo zijn potentieel te laten benutten.\n\nAssepoester (1950) DD5.1\nAssepoester is de geadopteerde dochter van een vrouw van hoge afkomst. Ze wordt als slaaf behandeld in haar eigen huis. Terwijl haar moeder en haar slechte stiefzusters naar een groot bal zijn krijgt ze een verassend bezoek van een vriend. Disney versie van het bekende sprookje.\n\nAladdin (1992) DD5.1\nAladdin is een jongen van de straat die in een druk dorp woont, samen met zijn aapje Abu. Als Princes Jasmine het leven in het paleis zat wordt, besluit ze zich onder het volk te mengen. Ze komt Aladdin tegen, en hij wordt verliefd. Aladdin wordt gevangen genomen, om vervolgens voor de slechte Jafar (de adviseur van de Sultan) een mysterieuze lamp te vinden.\n\nJasmine&amp;#039;s betoverende verhalen (2005) DD2.0\nSpring op Disney&amp;#039;s vliegende tapijt en vlieg mee met Prinses Jasmine naar een duizelingwekkende wereld van plezier, vriendschap en pure betovering.\nIn deze 3 verhalen neemt Jasmine het op tegen een gewiekste zeemeermin die een oogje op Alladin heeft. Vervolgens ontwikkelt zich een raadsel wanneer Jasmine, Alladin, de Geest en de Sultan het geheim ontdekken achter veel bijzondere kracht van een tovenaar. Ook leert Prinses Jasmine lessen over vriendelijk en barmhartig zijn wanneer ze is veranderd in een &amp;#039;straatrat&amp;#039; en zich buiten de muren van het paleis moet zien te redden..\n\n\nCover:\n- Incl. HQ cover\n\nAudio:\n- DD5.1 of DD2.0 (ligt aan source)\n- NL gesproken\n","torrent":{"xt":"urn:btih:2ba56dd563bd68445e311e0bf5c1239485cf4c8d","amp;dn":"pamas+kiidstime+19+4+kinderfilms+op+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba56dd563bd68445e311e0bf5c1239485cf4c8d","infoHashBuffer":{"type":"Buffer","data":[43,165,109,213,99,189,104,68,94,49,30,11,245,193,35,148,133,207,76,141]},"announce":[],"urlList":[]}}