{"title":"Student Writing Center","uid":3817192,"size":1153503068,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2d2eaa732b789e287bc55333f12f703b8ce7468a&amp;dn=Student+Writing+Center&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dragonlady1973","files":3,"time":1190602100,"description":"Student Writing Center\n\nSpecial Student Features\nUnlike any other Processor\n\nBibliography Maker - automatically formats bibliographies for over 20 reference types, including books, encyclopedias, dictionaries, magazines, newspapers, films, lectures, interviews and more.\n\nGrammar Tips - give help with punctuation, capitalization, plurals, abbreviations, and numbers plus definitions of commonly confused words.\n\nWriting Tips - detail how to write research papers, essays, book reports, resumes, coverletters, journals, news stories and more: all grammar and writing tips based on the best selling student handbooks, Writers Inc and Write Source 2000.\n\nTitle Page Maker - automatically formats the title page so that the title, student&amp;#039;s name, teacher&amp;#039;s name, subject, date and page numbering are set just right every time.\n\nJournal with Password - is ideal for keeping class notes, science lab notes, a travel log, or a personal journal; includes a calendar for organizing your writing by day, month and year.\n\nStudent Writing Center and Printmaster Homework Helpers\n\nInstallation instructions:\n\nThese instructions assume that the AutoPlay feature of Windows is turned on. (AutoPlay is usually enabled when you install Windows on your computer. See your Windows documentation for more information.)\n\n1. Insert the CD into your CD_ROM drive.\n2. Click on Continue at the install prompt to begin the setup process.\n3. Follow the on-screen instructions to complete the set up process.\n\nTo start the program from the start menu:\nClick on the Start button. Then choose Programs, The learning Company, Student Writing Center\n\nTechnical support:\nOur online technical support system offers 24-hour service and product information. The website features troubleshooting tools, the latest software updates and more!\nGo to http:\\www.riverdeep.net/learning company","torrent":{"xt":"urn:btih:2d2eaa732b789e287bc55333f12f703b8ce7468a","amp;dn":"Student+Writing+Center","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d2eaa732b789e287bc55333f12f703b8ce7468a","infoHashBuffer":{"type":"Buffer","data":[45,46,170,115,43,120,158,40,123,197,83,51,241,47,112,59,140,231,70,138]},"announce":[],"urlList":[]}}