{"title":"Daryl Bradford Smith 2006 Interviews **MUST LISTEN** (911/Septem","uid":3589934,"size":1075889824,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2e8af62a0f67088253dfaec31f90a42a6ba36d8d&amp;dn=Daryl+Bradford+Smith+2006+Interviews+%2A%2AMUST+LISTEN%2A%2A+%28911%2FSeptem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goy","files":232,"time":1167958149,"description":"Spread the word: 9/11 was not an inside job but a Zionist job.\n\nFurthermore, the 9/11 truth movement is under their control and there is currently a desperate effort on their part to bury these emerging facts under deception and obfuscation.\n\nFor example, the Zionist-controlled group Scholars for 9/11 Truth (Alex Jones, James Fetzer, Webster Tarpley, Jim Hoffmann, Morgan Reynolds, et al) deliberately lend credence to moronic and nonsensical notions such as that planes did not hit the twin towers but were inserted into the video feeds using bluescreen technology, energy-beams fired from space or from WTC 7 knocked down the towers, or that nuclear bombs brought them down.\n\nThe group was principally formed to discredit the research of respected physicist Professor Steven E. Jones, a man of courage and character, who has direct evidence for the use of thermates (powerful conventional explosives) from his analysis of molten steel from the WTC site (watch his November 11th 2006 lecture at UC Berkeley[http://video.google.com/videoplay?docid=9210704017463126290]).  Professor Jones withdrew from the group in December 2006 and helped form a new group, Scholars for 9/11 Truth and Justice [http://schol.digitalstyledesigns.com/pages/faqs2.html].\n\nIt is also worth mentioning that most 9/11 videos (notably Loose Change and In Plane Site) are deception, with the exception of Eric Hufschmid&amp;#039;s Painful Deceptions [http://video.google.com/videoplay?docid=1336167662031629480] - one of the first to challenge the official story, released in 2002 - and the recent 9/11 Mysteries [http://video.google.com/videoplay?docid=-6708190071483512003], the only one yet to actually expand on Painful Deceptions.\n\n\nVirtually everyone leading the 9/11 truth movement is misdirecting attention from the true perpetrators, blaming Bush and Cheney, or some nebulous group such as the &quot;Illuminati&quot;, the &quot;Globalists&quot;, or the &quot;New World Order&quot; (especially Alex Jones, one of the most insidious of the Zionist puppets).\n\nThe true perpetrators, as you will learn, belong to a Zionist criminal network who operate out of Israel.\n\nThis group has control of the world&amp;#039;s banking system, the world&amp;#039;s media, and pull the strings behind many of the world&amp;#039;s leaders.  September 11th is only the tip of the iceberg.\n\nHaving looked into this for oneself and established it beyond doubt as fact (which is actually not so difficult as this is not some &quot;conspiracy theory&quot; which falls apart the more one looks into it, but actually &quot;falls together&quot; the more one challenges and researches it) it demands a radical paradigm shift to accommodate its stark and disturbing reality and to avoid falling into denial, dismissing it as just another &quot;conspiracy theory&quot;.\n\nDaryl Bradford Smith&amp;#039;s The French Connection [http://www.iamthewitness.com] is, and has been for the past year or so, one of the very few beacons of truth on the internet (and, of course, but for the power of the internet as a medium of free expression unique in history this truth could never have come out as it has).  This torrent contains an archive of interviews from The French Connection from 8th November 2005 to 28th December 2006, with a chronologically ordered playlist.  It is also available for direct download from http://www.eternallyalone.com/FrenchConnectionArchive.html, or the files can be downloaded individually from The French Connection website.","torrent":{"xt":"urn:btih:2e8af62a0f67088253dfaec31f90a42a6ba36d8d","amp;dn":"Daryl+Bradford+Smith+2006+Interviews+%2A%2AMUST+LISTEN%2A%2A+%28911%2FSeptem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e8af62a0f67088253dfaec31f90a42a6ba36d8d","infoHashBuffer":{"type":"Buffer","data":[46,138,246,42,15,103,8,130,83,223,174,195,31,144,164,42,107,163,109,141]},"announce":[],"urlList":[]}}