{"title":"Lion Maru","uid":3841344,"size":443463433,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2ec9f4387cc2983e925da9d7842d8a5cf6b0d16d&amp;dn=Lion+Maru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"griffie","files":4,"time":1192332632,"description":"Kaiketsu Lion Maru (VHS title: Magic of the Ninja) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0287236/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0287236/&lt;/a&gt;\nA ninja swordsman, able to transform into a lion-headed warrior, defends Japan from an army of demons who murdered his master. Edited down to make a sort of stand-alone episode.\nVHS Rip (20 year old tape,) MP3 VBR Mono. NTSC. DIVX6.7. Bad english dubbing, no subtitles.\nAbout a 7 of 10 for video/audio quality, because the tape was a rental and recorded at EP.\n\n\n\nFuun Lion Maru\nFuun Lion Maru (Storm Cloud Lion Maru) takes place in feudal Japan, the time of the samurai and ninja. Such programs were common in Japan at the same time as westerns were popular in the USA. \nThe age of civil wars in Japan has come to an end. There should be peace, but the forces of darkness never rest. A new group has arisen which seeks to conquer and inslave. \nAfter the older brother of Dan, Shishimaru is murdered by the evil group Mantle, Dan, Shishimaru steels a rocket pack which gives him the power to &quot;Rocketto Lion Maru&quot; into Fuun (Storm Cloud) Lion Maru. (Although the same actor who played Shishimaru in Kaiketsu Lion Maru plays Dan, Shishimaru they are different characters.) \nAfter cutting the monsters Fuun Lion Maru rests his sword on his arm, then raises the sword to make a slicing motion in the air. As he brings the sword back down to his shoulder the monster explodes. Once the monster is dead Fuun Lion Maru reverts back to Dan, Shishimaru. \n\nNot really happy with how this turned out, the DVD has some interesting interlacing going on that I need to find out a little more about. Very watchable with some minor interlacing artifacts. Random episode.\nDVD Rip, AC3 audio. NTSC. DIVX6.7. Japanese audio, no subtitles. 1 episode.\n\nMore to come.\n\n","torrent":{"xt":"urn:btih:2ec9f4387cc2983e925da9d7842d8a5cf6b0d16d","amp;dn":"Lion+Maru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec9f4387cc2983e925da9d7842d8a5cf6b0d16d","infoHashBuffer":{"type":"Buffer","data":[46,201,244,56,124,194,152,62,146,93,169,215,132,45,138,92,246,176,209,109]},"announce":[],"urlList":[]}}