{"title":"Skysweeper Prof. 5.11 regged","uid":3795380,"size":10169965,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2f1e962ec8430785124353f9b3488b50c1a7dec8&amp;dn=Skysweeper+Prof.+5.11+regged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hansoff","files":4,"time":1188929600,"description":"SkySweep Professional is the most sophisticated member of the SkySweeper product family. The Professional versio is targeted toward Government Agencies, Professional Radio Monitoring and the advanced HAM or Utilities SWL. But, the PRO version is still simple enough that a hobbyist looking for a more advanced decoder will be pleased with it&amp;#039;s ease of use and state of the art advanced features.SkySweeper PRO  contains all the features of SkySweeper standard, but contains very advanced signal analyzers and decoding tools. There are analyzers for signal and modulation analysis such as a high resolution FFT, modulation speed, signal phase analyzers as well as bit domain analyzers. In addition there are several generic (universal) decoders (FSK, MFSK, MPSK, MSK, PAM and PSK) which are used to decode known/unknown transmissions. The generic decoders combined with universal bit tools provide the very best tools in the market for digital transmission decoding and analysis. These &quot;generic&quot; analyzers can be configured to almost any type of transmission mode. The more advanced the user, the more advanced the tools can become.","torrent":{"xt":"urn:btih:2f1e962ec8430785124353f9b3488b50c1a7dec8","amp;dn":"Skysweeper+Prof.+5.11+regged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1e962ec8430785124353f9b3488b50c1a7dec8","infoHashBuffer":{"type":"Buffer","data":[47,30,150,46,200,67,7,133,18,67,83,249,179,72,139,80,193,167,222,200]},"announce":[],"urlList":[]}}