{"title":"aesma daeva - 2002 - the eros of frigid beauty (symphonic metal)","uid":3702377,"size":152765431,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3016e14adc77b8fab7a40bd734ab3a7d4b0eb934&amp;dn=aesma+daeva+-+2002+-+the+eros+of+frigid+beauty+%28symphonic+metal%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zaftra","files":12,"time":1180683269,"description":"The Eros Of Frigid Beauty displays a change of style for the symphonic metal band Aesma Daeva. Replacing Rebecca Cords&amp;#039; vocals are three new vocalists; Melissa Ferlaak contributing to tracks three and four; Adena Brumer singing for tracks two, three, four, and seven; Sara Williamson taking the rest with tracks one and six. While their styles vary, the effect continues the tradition of haunting vocals woven into the broad instrumentation, providing powerful harmonies and entrancing melodies.\n\nOpening the album with powerful trumpets and deadly guitar riffs &quot;Lysander&quot; continues with the rhythmic ups and downs which fans of their first release will be familiar with. &quot;Devotion&quot; perpetuates the intense mood of the CD with driving guitars and piercing vocals, which leads into the much quieter &quot;In My Holy Time&quot; a constantly shifting meld of guitars, drums, and voice. &quot;The Eros of Frigid Beauty&quot; and &quot;Overture&quot; range in style between fast and hard, slow and soft, and the balance achieved in between. &quot;The Minstrell Song&quot; is much more synthesizer-inspired with its pulsing keyboard opening and their persistence in the background. &quot;Lysander II&quot; is fast, jarring, melodic, and closes the album out with a quiet solo from Adena Brumer.\n\n&quot;The Eros Of Frigid Beauty&quot; is a much more refined album than &quot;Here Lies One Whose Name Was Written In Water&quot;, with the first album containing many more synthesized sounds and a more consistent vocal performance. &quot;The Eros of Frigid Beauty&quot; is overall very solid musically, great sounding and well played, offering a much deeper sound and higher production values than Aesma Daeva&amp;#039;s first album.\n\nMp3 @ 320\n\n01 - Lysander. 06:36\n02 - Devotion. 02:39\n03 - In My Holy Time. 13:24\n04 - The Eros Of Frigid Beauty.\t18:03\n05 - Overature. 04:21\n06 - The Minstrel Song. 04:57\n07 - Lysander II. 05:24\n08 - Disdain (Flower Mix). 05:26\n09 - Sanctus (Film Version). 02:43\n","torrent":{"xt":"urn:btih:3016e14adc77b8fab7a40bd734ab3a7d4b0eb934","amp;dn":"aesma+daeva+-+2002+-+the+eros+of+frigid+beauty+%28symphonic+metal%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3016e14adc77b8fab7a40bd734ab3a7d4b0eb934","infoHashBuffer":{"type":"Buffer","data":[48,22,225,74,220,119,184,250,183,164,11,215,52,171,58,125,75,14,185,52]},"announce":[],"urlList":[]}}