{"title":"20070518 - UK - Ch.4 - Unreported World - 6 of 10 - Zimbabwe","uid":3691290,"size":367896576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31f721ac7a66a49f091b97a51d7aa496d04fe8df&amp;dn=20070518+-+UK+-+Ch.4+-+Unreported+World+-+6+of+10+-+Zimbabwe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grimerking","files":1,"time":1179534846,"description":"Zimbabwe: Inside Mugabe&amp;#039;s Land of Fear\n\nFriday 18 May 2007\n\nReporter Evan Williams and Director Siobhan Sinnerton reveal startling claims that the Mugabe Government is using the supply of AIDS drugs and food aid to gerrymander upcoming elections.\n\nAs Zimbabwe spirals ever deeper into repression and starvation, an Unreported World team just back from three weeks travelling undercover through the country reveals startling claims that the Mugabe Government is using the supply of AIDS drugs and food aid to gerrymander upcoming elections.\n\nReporter Evan Williams and Director Siobhan Sinnerton travel as tourists to avoid the scrutiny of Mugabe&amp;#039;s pervasive intelligence service. They meet members of the political opposition, women who have been imprisoned and tortured, families desperate for food and struggling with 2000 percent inflation, and the tragic households headed by children orphaned by the AIDS pandemic.\n\nWilliams and Sinnerton arrive just as the government intelligence service launches a new campaign of repression, abducting and beating scores of opposition members across the country.\n\nArriving at the country&amp;#039;s second largest city, Bulawayo, the team talk to church leaders and members of a new underground movement. The picture they are given is bleak: on top of the repression, a lack of food, jobs and medical services is causing massive hardship. Williams and Sinnerton interview women activists who say they were jailed for days with their babies and subjected to humiliating abuse.\n\nOne opposition MDC Party MP claims that you&amp;#039;re more likely to get access to government food and AIDS drugs if you are a supporter, or member of, the ruling Zanu-PF Party. She says if you are not a Zanu-PF supporter you will have more trouble obtaining these life-saving services. She claims this also includes the delivery of food from international aid organisations.\n\nAvoiding detection by Mugabe&amp;#039;s ubiquitous secret police and intelligence services, the team are taken into rural villages rarely seen by the outside world. They find that severe shortages of food and medicine is particularly hitting the orphans left behind by the ravages of AIDS. One priest tells Williams that there are tens of thousands of orphans in the countryside struggling to survive. He&amp;#039;s trying to set up an orphanage for some of them but can&amp;#039;t afford food or clothes.\n\nTheir team&amp;#039;s final leg is a tense journey through the capital Harare. Here, a human rights lawyer tells Unreported World that the police are now systematically torturing suspected opposition members and preventing legal representation for those taken in.\n\nIt&amp;#039;s not just suspected opposition activists who are being targeted. One journalist describes suffering four days of brutal torture at the hands of senior police officers. His &amp;#039;crime&amp;#039; was trying to report for an opposition newspaper and he was warned he would be killed if he continued working. He was arrested at the same time as a TV journalist who was abducted and killed for allegedly sending TV pictures of the police beating of opposition leaders out to foreign broadcasters.\n\nIn Harare&amp;#039;s sprawling townships Williams and Sinnerton find plenty of brave but tragic child-headed house-holds struggling just to find food every day, following the death of both parents from AIDS.\n\nAs the team leaves the country, it&amp;#039;s clear that in what was once one of Africa&amp;#039;s wealthiest, best educated countries entire generations are being &quot;dumped to die&quot; by a callous, corrupt government.\n\nFile Information\n\nDVBT-T (Freeview) Capture\nConverted using Gordian Knot\nResolution = 640x352\nVideo Codec = XviD\nAudio = 128kbps CBR","torrent":{"xt":"urn:btih:31f721ac7a66a49f091b97a51d7aa496d04fe8df","amp;dn":"20070518+-+UK+-+Ch.4+-+Unreported+World+-+6+of+10+-+Zimbabwe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f721ac7a66a49f091b97a51d7aa496d04fe8df","infoHashBuffer":{"type":"Buffer","data":[49,247,33,172,122,102,164,159,9,27,151,165,29,122,164,150,208,79,232,223]},"announce":[],"urlList":[]}}