{"title":"The Silent Years - The Silent Years (2006) 320 MP3 [by JCP]","uid":3861560,"size":96371719,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:322fb2c1f3f6ee111b91d3e54b06b6d0d6cbed3f&amp;dn=The+Silent+Years+-+The+Silent+Years+%282006%29+320+MP3+%5Bby+JCP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"da_risk","files":13,"time":1193519658,"description":"Taken from Pitchforkmedia.com\n\n\nThe artwork for the first Silent Years album features a menagerie of small plastic animals cavorting in dioramas, predators and prey mingling under unspoken truce. It&amp;#039;s so cute I was half expecting some kind of twee onslaught when I put the disc in the player, but instead I got something a world apart from its packaging. This Detroit band offers a highly melodic brand of pretty straightforward indie rock, tinged with just a bit of unusual instrumentation and a lot of analog keyboards in the mix to nudge things slightly left of center. \n\nLead vocalist Josh Epstein is a strong singer whose voice reminds me of so many other things it doesn&amp;#039;t wind up reminding me of anything at all in the end. He&amp;#039;s the principle writer, too, and he uses that versatile voice to its fullest extent, penning a series of fine hooks that the band arranges with a collective ear toward nuance and breathing space. Most of these songs feature moments where the band stops to collect itself amidst a hail of effects or omnichord. &quot;Take the Money Out&quot; is a good example, with its big, pounding chorus offset by welcome moments of reflection where the beat drops away and the instruments gather for the next assault on the hook. \n\nThe album begins strongly and ends even more strongly, with four of the best songs slotted consecutively at its close. &quot;Take the Money Out&quot; begins this run, and &quot;Sharks&quot; and &quot;The Devil Wears Sunshine&quot; feed off of its momentum-- the former especially sets up a nice tension between the band&amp;#039;s purest power pop tendencies and their desire to tweak the edges and catch the listener off guard with unexpected pauses. Closer &quot;Lost at Sea&quot; is a simple acoustic ballad backed with mallet percussion that gives Epstein one of his best vocal showcases. It&amp;#039;s a fairly standard &quot;we&amp;#039;ve both changed&quot; song lyrically, but he gets maximum emotion from it with his falsetto. \n\nBack at the front of the album, &quot;No Secrets&quot; gives him another immediately gripping melody to work with, and the band waxes new wave with the catchy keyboard motifs that answer the vocals. There are only a few flaws: the mix is a little off on &quot;This Town&quot;, where Epstein and his clever lyric get lost behind the mildly distorted guitar, and bedroom recording &quot;Devil Got My Woman&quot; nods to early blues in its refrain, but is ultimately a throwaway comma before the heavyweight back third of the album kicks in. \n\nEven the weaker songs have some excellent moments, such as the vocal harmony and mbira interlude in &quot;Aisleways&quot;, which won me over more quickly than the chorus. The Silent Years is a good debut album from astute pop craftsmen who should have enough tricks up their sleeves to last beyond a group&amp;#039;s initial burst of creativity. \n\n-Joe Tangari, January 05, 2007\n","torrent":{"xt":"urn:btih:322fb2c1f3f6ee111b91d3e54b06b6d0d6cbed3f","amp;dn":"The+Silent+Years+-+The+Silent+Years+%282006%29+320+MP3+%5Bby+JCP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322fb2c1f3f6ee111b91d3e54b06b6d0d6cbed3f","infoHashBuffer":{"type":"Buffer","data":[50,47,178,193,243,246,238,17,27,145,211,229,75,6,182,208,214,203,237,63]},"announce":[],"urlList":[]}}