{"title":"Architect - I went out shopping to get some noise[FLAC - LOSSLES","uid":3843113,"size":476761362,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:34414cea4b61c795191b111a316d2c284605df06&amp;dn=Architect+-+I+went+out+shopping+to+get+some+noise%5BFLAC+-+LOSSLES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"99AM","files":19,"time":1192463888,"description":"FLAC files + CUE sheet + covers\nReleased in April 2004\n\n\nTrack Listing:\n1. Anger Management\n2. Belgian Connection\n3. ICL Feelings\n4. Colorado 6AM\n5. Unlike\n6. Dievorce\n7. Colorfusion\n8. Grand Diesel\n9. Fifth Puppy\n10. Unlike [Reaktor Version]\n11. Charles B\n12. Beyer Dynamic\n13. Moonshine\n\nReview from Release Magazine (9 out of 10 rating):\nDaniel Myer (Haujobb) is back once again with Architect and what an album it is. Gone is the furious drum?n?bass which comprised the debut &quot;Galactic Supermarket&quot;. Myer is now experimenting with electro; re-defining the genre as he goes along while simultaneously taking it to the next level. &quot;Anger Management&quot; kicks it all off and is quite pleasurable. &quot;Belgian Connection&quot; follows it up packing much authority. Throughout the whole of &quot;I Went out Shopping?&quot; there is an underlying current of darkness, intensity, alienation and profound sadness. Smooth beats, amazing synthesis and cold, sterile atmospheres? albums such as this are to be savored. Nine of these tracks have been heard already via the Myer list and differ very little except that they are no longer inferior grade MP3:s. Of the other four previously unreleased pieces, one is a twisted take on the classical piece &quot;Moonlight Sonata&quot; while another is a remixed version of the track &quot;Unlike&quot;. I cannot stress enough how impressed I am with &quot;Moonshine (live version)&quot;.\nArchitect?s new album has been six years in the making and much like some of his other projects (Hexer, S?Apex, and Myer) it shows a far more experimental, innovative side. As per the norm, this second release is similar to the first in name only; Dejan is not involved, one would hope he?s doing his own thing with Dots&amp;Dashes.\nI do not think a lot of Haujobb?s fans are going to enjoy this album - at first - but if you like what is being put out on the Mikrolux and Psi49 labels, this thing is going to devour you. Now if he?d only work with Holger Flinsch, what a meeting of the minds that would be.\n\nCUEtools\nConverts between different file formats (flac-&gt;wav) and different cue types (seperate files-&gt;single file). you need .NET 2.0 to use it.\n\nEnjoy!","torrent":{"xt":"urn:btih:34414cea4b61c795191b111a316d2c284605df06","amp;dn":"Architect+-+I+went+out+shopping+to+get+some+noise%5BFLAC+-+LOSSLES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34414cea4b61c795191b111a316d2c284605df06","infoHashBuffer":{"type":"Buffer","data":[52,65,76,234,75,97,199,149,25,27,17,26,49,109,44,40,70,5,223,6]},"announce":[],"urlList":[]}}