{"title":"Mike Malloy 01-31-07","uid":3608126,"size":107048190,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:348a55751ddb09a0e48b2475ab21105a78769431&amp;dn=Mike+Malloy+01-31-07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tolow2ce","files":3,"time":1170316584,"description":"Wednesday January 31, 2007\n\nWhile Chucklenutz struts around Wall Street bragging about &quot;his&quot; booming economy, the Senate moves to stop his killing spree in Iraq and perhaps prevent an unprovoked attack on Iran.\n\nHow will Cheney react? When Wolf Blitzer asked him last week what a vote in Congress could do to stop the war escalation in Iraq, Darth Cheney growled: &quot;It&amp;#039;s not going to stop us.&quot; Sure makes you wonder who the &quot;us&quot; is he&amp;#039;s referring to. Is it Halliburton? It&amp;#039;s clearly not the American people whom he allegedly represents. We&amp;#039;re obviously not part of his team and he knows it. Can you imagine Al Gore making this kind of power-mad statement when he was VP? Can you imagine Bill Clinton calling himself &quot;The Decider?&quot;\n\nAnd now Bush is seeking even MORE limitless power over federal regulatory agencies?\n\nThis letter to the editor appeared in today&amp;#039;s Atlanta Journal-Constitution:\n\n&quot;President Bush&amp;#039;s power grabs are relentless\n\nFirst he lied us into a war of choice, then came warrantless domestic wiretapping, advocacy of torture and reading your private mail. Quite a list, but he&amp;#039;s not done yet. \n\nPresident Bush&amp;#039;s newest executive order claims the power to install appointees to oversee policy development in all federal agencies, such as the Environmental Protection Agency and the Occupational Safety and Health Administration. He&amp;#039;s opposed to any regulatory policy that restricts Big Business, yet he&amp;#039;s in favor of regulators to regulate the creation of said policy. \n\nWatching Bush&amp;#039;s power grab is like watching grass grow. You can&amp;#039;t really see it happening, but one day, you walk outside and realize it&amp;#039;s time to mow the lawn.&quot;\n\nDAVID L, Atlanta\n\nSo Truthseekers, when our &quot;elected&quot; leaders turn against us and actively work against our own best interests, what choice do we have but to impeach? \n\nWhat is taking us so long?\n\n--KBM\n\nJoin the Fun and Frivolity 800-989-1480!","torrent":{"xt":"urn:btih:348a55751ddb09a0e48b2475ab21105a78769431","amp;dn":"Mike+Malloy+01-31-07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348a55751ddb09a0e48b2475ab21105a78769431","infoHashBuffer":{"type":"Buffer","data":[52,138,85,117,29,219,9,160,228,139,36,117,171,33,16,90,120,118,148,49]},"announce":[],"urlList":[]}}