{"title":"Human.v2.0 and Robot.Race.XviD.AC3.Samples.avi","uid":3564585,"size":651926958,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3629b99921db0925dc30c3b744089283eaee8e1e&amp;dn=Human.v2.0+and+Robot.Race.XviD.AC3.Samples.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"feedbacker","files":5,"time":1164469475,"description":"\nThe Title of video &quot;Human v2.0&quot; is misleading (may be on purpose by its creator so that intelligent people watch it)\n\nHeart Patients need not watch this video.\nWarning, please do not watch video if u r a weakling, god fearing, easily scareable etc.\n\n\n*) All the * marked are my personal comments i got in fury while compressing this video.\n\n\nI was frightened to death while watching this video, because :\n\n\n1) Watch the sick scientists talking about Human Machine interfacing.\n\n*) Will the terrorists use it and what will be wars like with such technologies ?\n\n\n\n2) Look what they did to the Bulls and how they are using the poor Rat. \nAfter the Monkey guess who was NEXT. Watch the Human Guinea pig.\n\n*) That poor disabled kid, they are using him in the name of cure. They have no regrets about all this. Perfect recipe for creation of The MATRIX.\n\n\n\n3) The SINGULARITY is coming. (Watch it in the Sample.avi)\n\n*) And these fools are amorously telling us about it.\n\n\n\n4) Artellects are GODs ?\n We are about to be reduced to levels of Mosquitoes.\n\n*) Will they keep us at least as specimens after GigaDeath ?\n\n\n\n5) Watch how a mere Monkey took a quantum leap in evolution with an idea that he got and evolved beyond human capacity within a second while humans were using him in experiments.\n\n*) And the scientists have no shame about it.\n\n\n\n6) Decoding of human brain.\n\n*) Beware, the Artificial Brain is growing in labs; and no one can even stop it; For military needs it. Why cant they let us live happily ? \nThis as an act of war against humans for it threatens our existence.\n\n\n\n7) The Psychotics have already built the Quantum computers\n\n*) and are foolishly proud about it, just watch their arrogant laugh.\n\n\n\n8) The war against Machines Began in 1978\n\n*) Are u even aware of this ?\n\n\n\n9) Heard about the Unabomber, he killed 3 and injured 29 people, but is he the hero of the future ? Ask the CIA why.\n\n*) Wana join Freedom Club ? I mean we gota do something dam it, we just cant sit and watch our own demise. \n\n\n\n10) If things are so grim, who knows whats incubating in the secretive labs of DARPA.\nDoes all this sounds funny ?\nWatch &quot;The Great Robot Race&quot; for DARPAs plan.\n\n*) Now they dont even require Foreigners for recruitment since no proud American join military anymore.\n\n\n\nThis is a High Quality Maximum Compressed Video, For the best results it watch in 800x600 resolution mode and set the DivX 6.4 player video preference to &quot;Full Deblocking with Sharpness&quot;.\n","torrent":{"xt":"urn:btih:3629b99921db0925dc30c3b744089283eaee8e1e","amp;dn":"Human.v2.0+and+Robot.Race.XviD.AC3.Samples.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3629b99921db0925dc30c3b744089283eaee8e1e","infoHashBuffer":{"type":"Buffer","data":[54,41,185,153,33,219,9,37,220,48,195,183,68,8,146,131,234,238,142,30]},"announce":[],"urlList":[]}}