{"title":"The Outer Limits - 6x19 - Zig Zag.avi","uid":3707246,"size":213385216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36d43160722288dcee92aeb87d05f56b50c8006a&amp;dn=The+Outer+Limits+-+6x19+-+Zig+Zag.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"walicsiechce2","files":1,"time":1181173227,"description":"The Outer Limits - 6x19 - Zig Zag\n\nThe bombs are in place, ready to destroy the super-computers at the Department of Information Technology. \nSPOILER\nInside, the members of the Syndrome, the anti-technology group that planted the bombs, lay dead or dying. All of them, that is, except Cliff Unger - or as he calls himself now, Zig Fowler. Unger has his finger on the detonator as he negotiates with Pete Yastremski, the head of the department and, as the two men talk and FBI agents prepare to storm the building, we move back in time, through the hours, days and years leading up to the attack . We see how Unger, once a rabidly pro-technology cyber-columnist, led the attack, using a plan devised by Fowler, a mysterious cyber-terrorist who was hunted by Yastremski down several years earlier. We see the tension between Unger and Syndrome stalwarts like Dell Tinker and Roy Chance, who don\\&amp;#039;t trust him, and his blossoming romance wit Weatherman, the group\\&amp;#039;s only female members. And we see how Unger was driven to join the group after his identity chip, which all citizens in this society have implanted in the palm of their hands, apparently malfunctioned and began to identify him as Zig Fowler.\n \n \n\nDirected by: James Head          Written by: Alan Katz, Nora O\\&amp;#039;Brien\n\nStarring: Frank Whaley, Leslie Hope, John Amos, David McNally, J.R. Bourne and Vincent Gale","torrent":{"xt":"urn:btih:36d43160722288dcee92aeb87d05f56b50c8006a","amp;dn":"The+Outer+Limits+-+6x19+-+Zig+Zag.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d43160722288dcee92aeb87d05f56b50c8006a","infoHashBuffer":{"type":"Buffer","data":[54,212,49,96,114,34,136,220,238,146,174,184,125,5,245,107,80,200,0,106]},"announce":[],"urlList":[]}}