{"title":"Aaron.Russo.-.America Freedom To Fascism","uid":3791495,"size":733028352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:371204f84dae0dd0435795ae01b234b4d1d325c8&amp;dn=Aaron.Russo.-.America+Freedom+To+Fascism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"le4rner","files":1,"time":1188639396,"description":"Born in Brooklyn and raised on Long Island, producer Aaron Russo began promoting rock and roll shows at local theaters while still a high school student. He then worked for his family&amp;#039;s undergarment business, where in 1963, he designed the first ladies bikini under wear. Five years later the twenty four year old entrepreneur opened his own nightclub in Chicago called the Kinetic Playground which became a driving force in the music business, where Aaron helped create the careers of many legendary performers, such as Led Zeppelin. Aaron was responsible for bringing them to America for the first time. He also promoted some of the 60&amp;#039;s most successful rock acts, including The Who, Janis Joplin, The Grateful Dead and Jefferson Airplane.\n\nIn 1972, Russo began his seven year partnership with Bette Midler, who became a superstar during his management of her career. In 1975 he produced the Tony award- winning &quot;Clams on the Half-Shell Revue,&quot; which starred Bette Midler and Lionel Hampton. At the time it was the most successful ten-week broadway revue in history, grossing more than $1.8 million. While serving as Midler&amp;#039;s manager, Russo created and managed the Manhattan Transfer. Later his roster would include such personalities as David Keith, Frederic Forest, Susan Sarandon and other notable clients.\n\nWhen Russo turned to producing feature films, his production of &quot;The Rose&quot;, introduced Bette Midler to motion picture audiences. Midler received an Academy Award nomination as best actress. &quot;The Rose&quot; is considered by many to be the classic rock n&amp;#039; roll film. Russo also produced &quot;Trading Places,&quot; starring Eddie Murphy and Dan Aykroyd, which has become a Christmas classic, and &quot;Teachers,&quot; starring Nick Nolte, Morgan Freeman, and Ralph Macchio.\n\nOver the past years, Russo has received numerous awards for his achievements. They include a Grammy, a Tony, an Emmy for producing the best television special of the year &quot;OL&amp;#039; Red Hair is Back,&quot; starring Dustin Hoffman and Bette Midler, plus many gold and platinum records. To date his films have been nominated for six Academy Awards, as well as seven Golden Globes. His films have won three Golden Globes, as well as the Image Award.\n\nHe is now writing, producing, and directing a new feature film/documentary titled &quot;America...From Freedom To Fascism&quot;. The film is an expose of the Internal Revenue Service, and proves conclusively there is no law requiring an American citizen to pay a direct unapportioned Tax on their labor. The film is very provocative and is receiving standing ovations at its previews.\n\nIn 1996 Russo made a political video entitled &quot;Aaron Russo&amp;#039;s Mad as Hell&quot;, which was a hit throughout America. He was asked by the people of Nevada to run for governor and he made the decision to do so. The powers that be in Nevada scoffed at his decision to run for governor but were very surprised when he finished second with nearly thirty percent of the vote, beating the sitting lieutenant governor. In January of 2004, he declared his candidacy for the Libertarian Party&amp;#039;s nomination for President of the Untied States. At the Convention in May, Russo won the first two ballots, but not a majority. He was defeated on the third and final ballot. He then channelled his energy into writing/directing America: From Freedom to Fascism. ","torrent":{"xt":"urn:btih:371204f84dae0dd0435795ae01b234b4d1d325c8","amp;dn":"Aaron.Russo.-.America+Freedom+To+Fascism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"371204f84dae0dd0435795ae01b234b4d1d325c8","infoHashBuffer":{"type":"Buffer","data":[55,18,4,248,77,174,13,208,67,87,149,174,1,178,52,180,209,211,37,200]},"announce":[],"urlList":[]}}