{"title":"20070518 - UK - Dispatches Gordon Brown - Fit For Office","uid":3691300,"size":735819776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:377c578f5a58d0073be65f791fb2e9f35e10b280&amp;dn=20070518+-+UK+-+Dispatches+Gordon+Brown+-+Fit+For+Office&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grimerking","files":1,"time":1179535763,"description":"UK Channel 4 - Dispatches\n\nGordon Brown: Fit For Office?\n\nSome very senior figures on Gordon Brown&amp;#039;s own side are certain he is unfit for office: one has called him &quot;control freak&quot; and another &quot;psychologically flawed&quot; and one serving cabinet minister has said he&amp;#039;d be a &quot;f***ing disaster&quot; as Prime Minister.\n\nOver the last nine months Dispatches has carried out the most in-depth study ever done for television on the Chancellor, interviewing cabinet ministers, MPs, top civil servants, economists, journalists and friends. The programme, presented by Peter Oborne, forensically examines why these claims have been made by some of Gordon Brown&amp;#039;s colleagues.\n\n&quot;I&amp;#039;ve been a political journalist for fifteen years and have closely followed the career of Gordon Brown. I have written pieces that both criticize and praise the Chancellor but one thing is unarguable - he is a massive politician of exceptional gifts, the kind of figure that comes along once in a generation - and in a few weeks time he&amp;#039;ll be Prime Minister. And yet some very senior figures on his own side are certain he is unfit for office - one has called him a &amp;#039;control freak&amp;#039;, another &amp;#039;psychologically flawed&amp;#039; and one serving cabinet minister has said he&amp;#039;d be a &amp;#039;f***ing disaster&amp;#039;,&quot; says Peter Oborne.\n\nDispatches forensically examines why these claims have been made by some of Gordon Brown&amp;#039;s colleagues, and whether they are true. And it will ask the biggest question of all - should we, the public, share these fears of Gordon Brown holding ultimate power? Over the last nine months Dispatches has carried out the most in-depth study ever done for television on the Chancellor, based on in-depth interviews with more than a 100 witnesses who include cabinet ministers, MPs, top civil servants, economists, journalists, and friends.\n\nSo what sort of Prime Minister will Gordon Brown be? And the heart of the answer to that is a puzzle thrown up by the research - the contrast between the cold antipathy often felt by colleagues and officials and the warm, private man known to his closest friends.\n\nIt&amp;#039;s clear that Gordon Brown can be a warm man capable of individual acts of great kindness. He&amp;#039;s also a man of deep political drive who seems to operate through a secretive and very small circle of trusted intimates and advisers; a group who have tended to be lesser talents who run no risk of outshining him. Senior civil servants describe in great detail what they observed.\n\nAgain and again examples are given of how Brown snubbed, cut, bullied, ignored and ploughed his own furrow. Even friends acknowledge the problem. The film examines a double allegation of a refusal to collaborate with his colleagues allied to vindictiveness against those who threaten to stand in his way. These character traits have mainly been concealed from the public but they have shown themselves in a series of feuds, particularly with potential challengers; for example his clashes with Robin Cook, Mo Mowlam, Peter Mandelson and Alan Milburn.\n\nBrown&amp;#039;s relationship with Blair is also put under scrutiny. Brown arrived at 11 Downing Street still believing he should be the man in No.10. He&amp;#039;d been given by Blair unprecedented authority over economic and domestic policy. Brown has interpreted this as a licence to defy No. 10.\n\nNumerous and authoritative accounts of Brown&amp;#039;s behaviour in government, the sulks and surliness, refusal to co-operate - according to one extremely well-placed insider he even stormed into No 10 and hurled obscenities at Tony Blair - paint a very different picture from the warm man loved by his friends.\n\nIn conclusion Peter says, &quot;Gordon Brown is going to be the next Prime Minister. It&amp;#039;s important for all of us - except perhaps the Conservative opposition - that he should be a success. But we&amp;#039;re taking a giant leap in the dark. Gordon Brown is a brilliant man, capable of great warmth and human decency - but he&amp;#039;s also very closed, clannish, suspicious, tormented and very difficult to deal with. The success of his premiership depends on whether, when he attains his lifetime ambition and enters No.10 Downing Street, he can become a changed character.&quot;\n\nFile Information\n\nDVBT-T (Freeview) Capture\nConverted using Gordian Knot\nResolution = 640x352\nVideo Codec = XviD\nAudio = 128kbps CBR","torrent":{"xt":"urn:btih:377c578f5a58d0073be65f791fb2e9f35e10b280","amp;dn":"20070518+-+UK+-+Dispatches+Gordon+Brown+-+Fit+For+Office","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"377c578f5a58d0073be65f791fb2e9f35e10b280","infoHashBuffer":{"type":"Buffer","data":[55,124,87,143,90,88,208,7,59,230,95,121,31,178,233,243,94,16,178,128]},"announce":[],"urlList":[]}}