{"title":"New.Applications.&amp;.Software.of.Sept.20.07-LegalTorrents","uid":3813239,"size":69854156,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3790117cb51177642f8235da9eab2e4dc29667f0&amp;dn=New.Applications.%26.Software.of.Sept.20.07-LegalTorrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LegalTorrents","files":63,"time":1190308759,"description":"Pack Includes 10 Different Apps:\n\nWinUpdates List Version 1.2\n\nWinUpdatesList displays the list of all Windows updates (Service Packs and Hotfixes) installed on your local computer. For hotfix updates, this utility also displays the list of files updated with these hotfixes. In addition, it allows you to instantly open the Web link in Microsoft Web site that provides more information about the selected update, uninstall an update, copy the update information to the clipboard, or save it to text/HTML/XML file.\n\nSpeedFan Version 4.33\n\nSpeedFan monitors fan speeds, temperatures and voltages in computers with hardware monitor chips. It can even access S.M.A.R.T. info for those hard disks that support this feature and show hard disk temperatures too, if supported. It can even change the FSB on some hardware. At the lowest level, it is a hardware monitor software, but its main feature is that it can control fan speeds according to the temperatures inside your pc, thus reducing noise and power consumption.\n\nSkype 3.5.0.239\n\nSkype is free and simple software that enables you to make free calls anywhere in the world in only minutes. Skype uses innovative P2P (peer-to-peer) technology to connect you with other users. It is quick and easy to install and offers several features, including SkypeOut calling from Skype to regular and mobile phones worldwide, free conference calling, and secure file transferring. Skype calls have better sound quality than your regular phone and are highly secure, with end-to-end encryption.\n\nRivaTuner Version 2.04\n\nRivaTuner is a powerful tweaking utility for NVIDIA based cards. All series of Detonator drivers have a lot of undocumented registry entries. Some of them donÂ´t affect anything, but some are very useful. In general they cannot give you big performance boots but they can improve image quality and solve some compatibility problems. This utility will help you to change all undocumented registry entries.\n\nPidGin Application\n\nPidgin is a multi-protocol instant messaging client for Linux, BSD, MacOS X, and Windows. It is compatible with AIM (Oscar and TOC protocols), ICQ, MSN Messenger, Yahoo, IRC, Jabber, Gadu-Gadu, and Zephyr networks.\n\nPidgin users can log in to multiple accounts on multiple IM networks simultaneously. This means that you can be chatting with friends on AOL Instant Messenger, talking to a friend on Yahoo Messenger, and sitting in an IRC channel all at the same time.\nPidgin supports many features of the various networks, such as file transfer (coming soon), away messages, typing notification, and MSN window closing notification. It also goes beyond that and provides many unique features. A few popular features are Buddy Pounces, which give the ability to notify you, send a message, play a sound, or run a program when a specific buddy goes away, signs online, or returns from idle; and plugins, consisting of text replacement, a buddy ticker, extended message notification, iconify on away, and more.\n\nMXPlay Beta Version 1.1\n\nMXPLAY is all about the audio experience. It is the only player that renders your music library in a 3D audiospace, providing a rich, immersive &quot;live&quot; audio experience (especially with headphones).\n\nIt supports all the popular file types (MP3, AAC, OGG, WMA, FLAC, ALAC) and also allows you to mashup your music with videos from the web. It has a growing library of plug-in extensions including: Last.fm, MP3tunes and Nintendo WiiMote.\n\nFeatures:\n\n* Take control of your music with the 3D AudioSpace\n* Organize and import your music from anywhere*\n* Browse the web in MXPLAY and discover new music\n* Share what you discover with friends\n\n\nProcess Explorer:\n\nProcess Explorer shows you information about which handles and DLLs processes have opened or loaded.\nThe Process Explorer display consists of two sub-windows. The top window always shows a list of the currently active processes, including the names of their owning accounts, whereas the information displayed in the bottom window depends on the mode that Process Explorer is in: if it is in handle mode you&amp;#039;ll see the handles that the process selected in the top window has opened; if Process Explorer is in DLL mode you&amp;#039;ll see the DLLs and memory-mapped files that the process has loaded. Process Explorer also has a powerful search capability that will quickly show you which processes have particular handles opened or DLLs loaded.\n\nThe unique capabilities of Process Explorer make it useful for tracking down DLL-version problems or handle leaks, and provide insight into the way Windows and applications work.\n\nWhat&amp;#039;s new in Version 11.0:\n\n* New treelist control for better UI responsiveness\n* Asynchronous thread symbol resolution on threads tab of process properties\n* More flags on groups in security tab and SID display\n* Thread IDs on threads tab\n* On-line search uses default web browser and search engine\n* Vista ASLR column for processes and DLLs\n* Vista Process and thread I/O and memory priorities in process and thread properties\n* Vista Process and thread I/O and memory columns\n* PROCESS_QUERY_LIMITED_INFORMATION support on process permissions on Vista\n* Run as limited user runs with low IL on Vista\n* Reports information for all object types on Vista\n* Show details for all processes elevation menu item on Vista\n* Supports replacement of task manager on Vista\n* /e to launch elevated\n* /s switch to select a process at startup\n* Compiled w/ASLR, DEP\n* Faster startup\n* Miscellaneous bug fixes and minor improvements\n\nIPaddress Version 2.0.5\n\nWant a quick view of your IP Address? Then get IPaddress. ItÂ´s a tiny utility that checks your IP Address and lets you copy it to the computerÂ´s clipboard. Easily paste it from there into whatever application or document that requires it.\n\nDisk Heal Application Version 1.37\n\nApplications : Windows : English\nDisk Heal is a useful tool that performs many useful functions including tweaks, fixes disk problems and more! Visit the Â´featuresÂ´ page on the home page for an extensive description of all its features.\n\n\n\nCrystal CPUID Version 4.13.2.343\n\nCrystalCPUID is a useful application that shows detailed information about the processor, the chipset, bios and cache. It contains a real time clock checker and the function to change the multiplier and voltage on systems with AMD K7/K8 prozessors.\n\nFeatures:\n\n* Support AMD64/EM64T\n* Intel SpeedStep Control (AT YOUR OWN RISK)\n* AMD K6/K7/K8 Multiplier/Voltage Change (AT YOUR OWN RISK)\n* VIA CyrixIII/C3 Multiplier Change (AT YOUR OWN RISK)\n* Multiplier Management\n* MSR Editor/MSR Walker (AT YOUR OWN RISK)\n* Clock, Cache, System Clock, Multiplier\n* Feature Flags\n* CPUID\n* Process Rule\n* Code Name\n* Multi Processor\n* PCI Device List\n* Chipset/VGA information\n* BIOS Information\n* Change Dialog Font\n* Change Wallpaper\n\nBelarc Advisor Version 7.2.20.8\n\nBelarc Advisor shows all the hardware and software installed on your PC right in your Web browser. You will see personalized advice on how well software and hardware products will work with your computer, along with a detailed description of your computer profile. All of your profile information is kept in privacy on your PC and is not sent to a Web server. The program also keeps your software serial numbers.\n\nBaku Application Version 3.0\n\nBaku allows you to search for system registry errors and unneeded files that can be safely removed.\n\nFeatures:\n\n* Deletes empty folders, Â´HistoryÂ´ folder contents, Â´Recent documentsÂ´ folder contents, Â´TempÂ´ folder contents, temporary internet files, cookies.\n* Searches Windows log files, shortcuts to missing files and folders and user specified file types.\n* Registry scan removes unused and obsolete keys, including ActiveX/COM, Application Paths, Fonts, Help files, Icon files, Sound files, Uninstall Programs and Windows Installer.\n* The registry is automatically backed up before any changes are made.\n\nA-Squared Free Version 3.0.0.362\n\nScans the computer for malicious software (Malware). The term Malware describes Trojan Horses, Dialer, Worms, Spyware and others. a-squared Free is specialized in finding and removing them securely. The disk scan checks all files on your disks for Malware. The scanner also scans for Spyware Traces and Tracking Cookies. The included Memory Scan detects Malware immediately without the need to scan the whole harddisk to make a quick security check. Currently more than 200,000 different types of Malware can be removed. After the scan has finished you can select which Malware files you want to remove automatically. Free daily online updates provides best protection against Malware. Secure your PC and stop hackers now!\n\nAdd Remove Pro Application\n\nAdd/Remove Pro displays the entries in the Add/Remove Programs list of Windows Registry, checks if each is valid, and uninstalls the selected program or removes the entry from the list.\n\nAbyss Web Server\n\nAbyss Web Server is a free personal web server. Though small, it supports CGI scripts, FastCGI, ISAPI extensions, ASP.NET, server-side includes (SSI), download resuming, caching negotiation, logging, custom error pages, password protection, IP address control, aliases, custom MIME types, index files, custom directory listings, anti-leeching, and bandwidth throttling.\n\nIt also features an automatic anti-hacking system and an intuitive multilingual remote Web management interface. With Abyss Web Server X1, hosting your Web site and your PHP, Perl, Python, ASP, or ASP.NET scripts takes only a few minutes.\n\n\n\n-LEGAL TORRENTS\n\nPurpose:\n\ncreate a balance, share the already free stuff,\npublic domain works, freeware, free music,\nfree ebooks, articles, manifestos, movie trailers, and more.\n\nshow the copyright owners that torrent\nwebsites shouldn&amp;#039;t bear the responsibility\nof what their users upload, torrent websites\nare very much similar to google..\n\nusers upload what they want to upload,\ndownload what they want to download,\nand search for what they want to search..\n\nby creating this balance and sharing the already free\nstuff, we hope to take the pressure of torrent websites..\n\n","torrent":{"xt":"urn:btih:3790117cb51177642f8235da9eab2e4dc29667f0","amp;dn":"New.Applications.%26.Software.of.Sept.20.07-LegalTorrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3790117cb51177642f8235da9eab2e4dc29667f0","infoHashBuffer":{"type":"Buffer","data":[55,144,17,124,181,17,119,100,47,130,53,218,158,171,46,77,194,150,103,240]},"announce":[],"urlList":[]}}