{"title":"Redshift - 1996 Redshift (Newage EM 2006 Remaster)","uid":3556517,"size":121332091,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:37d16e500257ed8630f42861903b255354ea6619&amp;dn=Redshift+-+1996+Redshift+%28Newage+EM+2006+Remaster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blissynths","files":11,"time":1163408802,"description":"Album Information\n===================\n Album:               Redshift (2006 Remaster)\n Artist:              Redshift\n Year:                1996/2006\n Genre:               Newage space-music\n Label:               Distant Sun\n Series Name:         Remaster\n\nFile Information\n================\n \n Encoded With:        LAME 3.90.3 --alt-preset extreme -m s\n Encoded At:          VBR 226-262 kbit/s 44 KHz Stereo\n ID3 Tags:            Set, v1.1, v2.3\n Cover Image present: YES\n Covers:              CD-Front-Back\n\n \nTrack Listing:\n==============\n  1 -( 18:43) - (VBR 262) Redshift\n  2 -(  8:25) - (VBR 259) Spin\n  3 -(  4:01) - (VBR 251) Shine\n  4 -( 30:17) - (VBR 239) Blueshift\n  5 -(  2:47) - (VBR 226) Blueshift - Pt.II\n=============\n Number of Files: 5\n Total Duration:  1:04:13\n Total Size:      114.15 MB\n\n NFO Created:     02-Nov-2006  23:59:47, by Randy\n\nPThe opening title track at times sounds so close to ?Rubycon? that it could be. But why not? It?s among the greatest albums ever made in any sphere of music. The music emerges from a malaise of organic effects then introduces mellotron choirs and classic synths which you just know are going to be a precursor for depth-charge sequences. When the low synth drone starts it?s time to fasten your seat belts, and glue down the ornaments. The oscillators of the Moog groan into action as the filters try to get a handle on them. The sequencer marshals the sound into a mesmeric rhythm, and the mellotron returns to complete the picture. The sequence pattern hardly stays static for a moment. The way the whole sound is engulfed to end the section is a master stroke, and the rich chords which close the track are nigh on unsurpassable. ?Spin? is Redshift?s acknowledgement to the part which NODE have played in kick starting the resurgence in this style of New Age Synthmusic. This has all the hallmarks of NODE?s extreme approach with over-driven oscillators and relentless sequencing. Impressive is an understatement, but don?t expose anyone of a frail disposition to it.\n\n?Shine? packs a lot of variety into its relatively short timeslot. At the heart is a powerful sequence which at times is fleshed out by symphonic textures, and at others simplistic effects. A gem of a piece.\n\nThe epic ?Blueshift? closes the album, and what a track this is. The magnificent opening gives way to weird, almost industrial, effects which in turn merge into the sequence run. And when I say sequencing, I mean Sequencing with a capital S! I advise you to just sit back and immerse yourself in the awesome beauty and power of this piece. Hypnotic and narcotic, it really does explore the heights to which EM can reach. And as for the last section of the album, well I won?t say too much - just be prepared for a &quot;surprise&quot;! To think that this is Redshift?s &quot;starter for 10&quot; almost beggars belief. It?s a completely awe inspiring example of power synthesis which is destined to catapult Redshift into the hearts and minds of Electronic Music fans world-wide. Take it from me, it?s that good. \n\n","torrent":{"xt":"urn:btih:37d16e500257ed8630f42861903b255354ea6619","amp;dn":"Redshift+-+1996+Redshift+%28Newage+EM+2006+Remaster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37d16e500257ed8630f42861903b255354ea6619","infoHashBuffer":{"type":"Buffer","data":[55,209,110,80,2,87,237,134,48,244,40,97,144,59,37,83,84,234,102,25]},"announce":[],"urlList":[]}}