{"title":"Republic A Novel of America's Future by Charles Sheehan-Miles","uid":3959066,"size":2245574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:388564e7bcde40303da1377ffa403831da141636&amp;dn=Republic+A+Novel+of+America%5C%27s+Future+by+Charles+Sheehan-Miles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"pirateskream","files":1,"time":1199329273,"description":"Welcome to the America of the future: an intrusive federal government; economy going down the tubes; and terrorism, domestic and foreign, wracking our nation. In 2016 America has become a place of fear and suspicion. Terrorism and government crackdowns have brought on a cycle of spiraling inflation and unemployment. Basic civil liberties are at risk in a country changed, yet frighteningly familiar.\n\nA prominent citizen and commander in the West Virginia National Guard, Ken Murphy, must protect his family and his country, and identify where his loyalties lay in an increasingly dangerous conflict.\n\nCopyright Â© 2007 Charles Sheehan-Miles This work is licensed under a Creative Commons Attribution-Non Commercial-No Derivatives 2.5 License. You may copy or distribute the electronic version of this book freely, in unaltered form. You may not create derivative works or use this work for any commercial purpose without the permission of the author.\n\nAny resemblance to real people, living or dead, is unintentional, with the exception of certain named historical characters. Printed in the United States of America","torrent":{"xt":"urn:btih:388564e7bcde40303da1377ffa403831da141636","amp;dn":"Republic+A+Novel+of+America%5C%27s+Future+by+Charles+Sheehan-Miles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"388564e7bcde40303da1377ffa403831da141636","infoHashBuffer":{"type":"Buffer","data":[56,133,100,231,188,222,64,48,61,161,55,127,250,64,56,49,218,20,22,54]},"announce":[],"urlList":[]}}