{"title":"20070524 - Dispatches - Bin Wars","uid":3699368,"size":735696896,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:39506f8e26e465d7ad908fab589c1c61813c0cb5&amp;dn=20070524+-+Dispatches+-+Bin+Wars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grimerking","files":1,"time":1180365465,"description":"UK Channel 4\n\nDispatches - Bin Wars\n\nDispatches investigates whether the nation&amp;#039;s anger over fortnightly collections is justified, examining why the changes have been brought about and why they have resulted in a level of protest reminiscent of the petrol crisis of 2001.\n\nIs the reduction in service necessary to improve our recycling rates as the government has claimed? Or are we facing a new threat to our health with mounting piles of rotting rubbish?\n\nUsing scientific analysis, this film provides hard facts about the bacteria breeding in our bins and investigates whether fortnightly collections are impacting on vermin populations.\n\nDispatches travels across the country to meet residents who are so incensed by the reduction in collections and the policing of their rubbish disposal that they are staging a variety of protests, including refusing to pay their council tax.\n\nThe film will examine the wider issues surrounding the disposal of rubbish including what happens to recyclable waste recycling rates in the UK and the reliance on landfill sites to deal with our domestic rubbish.\n\nWe want you to contribute to the bin debate by sending us your own rubbish stories and pictures by email or mobile phone. Join the bin bloggers at Binwatch\n\nFile Information\n\nDVBT-T (Freeview) Capture\nConverted using Gordian Knot\nResolution = 640x352\nVideo Codec = XviD\nAudio = 128kbps CBR\n\n\nPlease keep seeding after you finish downloading. Documentaries are more of a niche item than blockbuster movies. If you want me to keep recording and sharing them, help me out...","torrent":{"xt":"urn:btih:39506f8e26e465d7ad908fab589c1c61813c0cb5","amp;dn":"20070524+-+Dispatches+-+Bin+Wars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39506f8e26e465d7ad908fab589c1c61813c0cb5","infoHashBuffer":{"type":"Buffer","data":[57,80,111,142,38,228,101,215,173,144,143,171,88,156,28,97,129,60,12,181]},"announce":[],"urlList":[]}}