{"title":"HALLOWEEN 2K7  - SCARY AS HELL EDITION","uid":3960258,"size":799712894,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3985062a6ad01dd3a08a75057498965f201917dc&amp;dn=HALLOWEEN+2K7++-+SCARY+AS+HELL+EDITION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"3Raz0r","files":3,"time":1199403743,"description":"HALLOWEEN 2K7 (aka Rob Zombie&amp;#039;s Halloween) - SCARY AS HELL EDITION\n\n*******************************************************************\n!!! this is a fanedit. It was altered from the original release !!!\n*******************************************************************\n\ntagline: Silently his horror creeps\noriginal film name: Halloween (2007) by Rob Zombie\nnew film name : Halloween 2K7 - Scary As Hell Edition\nfilm studio name : Dimension\nedit crew name : 3Raz0r\nDate Original Film Was Released : 08 2007\nDate Edit Was Released : 01 2008\nOriginal Runtime : 121 minutes\nNew Runtime : 113\nAmount of time Cut/Added : about 20 minutes cut / 12 minutes added\n\nCuts removed/added/extended :\n- deleted or altered all scenes in which Michael was speaking\n- deleted sexual references made by Judith and Laurie\n- deleted most of Ismael Cruz (Danny Trejo) talking to Michael\n- deleted all but one of Deborah Myer&amp;#039;s visits at Smith&amp;#039;s Grove\n- deleted almost every live session of Loomis and Michael\n- deleted over the top parts of the raping scene (aka Noel Kluggs&amp;#039; tongue twister)\n- deleted Morgan Walker&amp;#039;s stupid question about Michael&amp;#039;s whereabouts\n- deleted Loomis appearing at the cemetery\n- deleted Michael pressing Loomis&amp;#039; eyes inside (he has no blood and is alive later on)\n\n- added Michael leaving the hospital\n- added Michael on the graveyard\n- added alternate Loomis&amp;#039; arriving at the cemetery\n- added my own credits\n\nFanedit details (please add here details about DVD contents as well as video and audio information):\nWhen I watched RZ&amp;#039;s Halloween I was not hapy with quite a lot of decisions he made, because they rather took away than added to the thrill. Of course his version comes with way more blood and gore than the originals, but we all know that horror is not just the gruesome kills.\nWhat annoyed me most was Michael speaking. It seemded that the intention of RZ was to create a profile of Michael Myers, show the path he went to become a monster. The idea is nice, however, it does not fit to him. Michael Myers is the boogeyman, he is not just a human psychopath. Bullets can&amp;#039;t kill him so easily, hits can&amp;#039;t hurt him, he has incredible power without ever having trained. It is part of RZ&amp;#039;s movie to present Michael as supernatural, but taking that route also means to NOT show his development as a boy who was raised in the wrong family. No one becomes Michael Myers.\nSo, in my version he does not speak at all, not a single word ever. And his silence always was scary. This alteration lead to lots and lots and even more cuts to make this possible without destroying the plot.\nNext thing I did not like was Michael&amp;#039;s mother. Although well acted, she is to nice for what she does and how she lives. A lot of her dialogue was deleted to make her more of the unsatisfied-wth-her-entire-life stripper mum that she is.\nLoomis as a child psychologist did not make to much of an impression on me, especially not in the first half, because his documentary movies don&amp;#039;t fit to what he does or says to Michael. I reduced this part to him really thinking that Michael is a psychopath. You will see that his acting is way more believable than in the original.Ã‚Â´, especially inhis &quot;these eyes&quot; speech, which felt out of place, because the boy he was talkinn about was kind of sweet to him (aside from his previous killings that is).\nI also reduced some of the sex talk of the teenagers, one scene with Michael&amp;#039;s sister and one with Lory. Call me prude, but it felt totally over the top.\nThere were a lot of other tweaks and cuts, for audio and video. Finally I really like my result, which runs 113 minutes.\n\nYour intention for this fanedit:\nI want RZ&amp;#039;s Halloween to be more in the spirit of the classics and make it much scarier by removing, what did not work or was over the top. A smarter, more to the point, very sinister edit.\n\n\nYour way to achieve your intention:\nSlicing, cutting, removing, moving, splitting, cursing, taking millions of breaks, crying, swearing, stabbing, re-creating, recreating recreations, staying calm, trying to stay calm, focusing, concentrating, smoking, drinking, sleeping, re-arranging, searching for sound files, giving up, getting on it again, finishing.\n\nHardware and software information (what did you use to create your fanedit):\nMy nice computer. His name is Dofudome (don&amp;#039;t fucking die on me).\nWomble. Goldwave. Besweet. DVD LAB PRO. Pro Show Gold.\n\nAdditional Comment:\nNever give up. never surrender.\nWho am I?\nI am 3Raz0r, I like horror movies and I dig fanedits.\n\nTime needed for the edition: 4 weeks\npersons involved: my beautiful self\n\nAdditional information links: \nimdb: http://www.imdb.com/title/tt0373883/\n\nVisit http://www.fanedit.org for more information on fanedits.\n\nIf you own the original DVD, you can legally watch this.","torrent":{"xt":"urn:btih:3985062a6ad01dd3a08a75057498965f201917dc","amp;dn":"HALLOWEEN+2K7++-+SCARY+AS+HELL+EDITION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3985062a6ad01dd3a08a75057498965f201917dc","infoHashBuffer":{"type":"Buffer","data":[57,133,6,42,106,208,29,211,160,138,117,5,116,152,150,95,32,25,23,220]},"announce":[],"urlList":[]}}