{"title":"e - TextEditor version 1.0.2 (Aug 17 2007)","uid":3794610,"size":4873319,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3ab59113ecf4386e015d374d5401d11f34e948b3&amp;dn=e+-+TextEditor+version+1.0.2+%28Aug+17+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DJKamilion","files":3,"time":1188864293,"description":"E is a new text editor for Windows, with powerful editing features and        \n quite a few unique abilities. It makes manipulating text fast and easy,       \n and lets you focus on your writing by automating all the manual work. You     \n can extend it in any language, and by supporting TextMate bundles, it         \n allows you to tap into a huge and active community.                           \n Take control and make writing fun and fast again. Snippets automate           \n tedious and repetitive typing, saving you time and effort. Powerful bundle    \n commands transforms the text to your needs. By letting the computer do the    \n manual work, you get the freedom to concentrate on your writing.              \n You can leverage the full power of a unix scripting environment, right        \n from within e. Close integration with cygwin gives you access to the full     \n range of UNIX shell tools and lets you extend e with your choice of           \n languages like Ruby, Perl, Python and more. If you have any task that         \n could benefit from automation, you can be sure that e is up to it.            \n Make the editor fit the way you work. Everything in e from the syntax         \n highlighting themes to bundle commands and keyboard shortcuts can be          \n customized.                                                                   \n TextMate is the award winning editor for MacOS X, that has revolutionized     \n the way text editors work. By supporting TextMate bundles, e makes you        \n part of a huge and vibrant community. Whatever task or language you need      \n to work with, there is a good chance that someone has already made a          \n bundle with all the needed adaptations.                                       \n Most people have tried saving a document under all kind of &quot;creative&quot;         \n names to keep track of old revisions. In e you can write and revise           \n without worrying about losing your prior work.                                \n You can commit regular milestones of your documents (with comments and        \n labels), and track your progress with the combined timeline/graph in the      \n History view.                                                                 \n                                                                               \n \n                                                                               \n 1. Unpack the release.                                                        \n 2. Install it.                                                                \n 3. Copy the included patch to Installdir and run it.                          \n 4. Patch displays regcode                                                                              in side panel. Use it. ","torrent":{"xt":"urn:btih:3ab59113ecf4386e015d374d5401d11f34e948b3","amp;dn":"e+-+TextEditor+version+1.0.2+%28Aug+17+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab59113ecf4386e015d374d5401d11f34e948b3","infoHashBuffer":{"type":"Buffer","data":[58,181,145,19,236,244,56,110,1,93,55,77,84,1,209,31,52,233,72,179]},"announce":[],"urlList":[]}}