{"title":"The_Sopranos_Sixth_Season_1_21","uid":3958980,"size":8051346260,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3afccc987d586a999c0c579834952b89340fd5c6&amp;dn=The_Sopranos_Sixth_Season_1_21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bohasusaa","files":21,"time":1199326797,"description":"Called &quot;the television landmark that leaves other landmarks in the dust,&quot; by the Washington Post, the first part of Season Six was hailed as a masterpiece by critics. In those episodes, Tony Soprano faced new challenges as his life grew increasingly more complicated. Back together with Carmela, he faced the reality that their kids were no longer children, and yet not grown. And with Johnny Sack in prison, the always-tense relations between the New Jersey and New York families were strained even further. \n\nAs Season Six continues, he&amp;#039;ll be facing new stresses, including life-altering decisions at home, pressure from the law, and trouble on the job that leaves no one - no one - above suspicion. \n\nCreator David Chase&amp;#039;s drama series stars three-time EmmyÂ® winners James Gandolfini as Tony Soprano and Edie Falco as Tony&amp;#039;s wife Carmela, plus Lorraine Bracco as therapist Dr. Jennifer Melfi, EmmyÂ® winner Michael Imperioli as Tony&amp;#039;s nephew Christopher Moltisanti, and Dominic Chianese as Uncle Junior. Also on hand for Season six are regulars Robert Iler as Anthony Soprano, Jr., Jamie-Lynn Sigler as Meadow Soprano, Tony Sirico as Paulie Walnuts, and Steven Van Zandt as Silvio Dante. \n\nAida Turturro, who plays Tony&amp;#039;s sister Janice, returned to the show as a series regular, as well as Steven R. Schirripa as Bobby &quot;Bacala&quot; Baccalieri, John Ventimiglia as Artie Bucco, and Vincent Curatola as Johnny Sack. \n\nOther Season Six cast members of The Sopranos are Ray Abruzzo as Carmine, Frank Vincent as Phil Leotardo, Peter Bogdanovich as Dr. Elliot Kupferberg, Vincent Pastore as &quot;Big Pussy&quot; Bonpensiero, Joe Gannascoli as Vito Spatafore, Max Casella as Benny, Lenny Venito as Murmur, Carl Capotoro as Little Paulie, Dan Grimaldi as Patsy, Katherine Narducci as Charmaine Bucco, Sharon Angela as Rosalie Aprile, Maureen Van Zandt as Gabrielle Dante and Toni Kalem as Angie Bompensiero. \n\nGuest stars for the sixth season include Daniel Baldwin, Sydney Pollack, Nancy Sinatra, Jonathan LaPaglia, David Margulies, Geraldo Rivera, Ken Leung, Frank John Hughes, Jerry Adler, Tim Daly, Frankie Valli, Hal Holbrook, Ben Kingsley, Julianna Margulies, Treach, Ron Leibman, Elizabeth Bracco and Lord Jamar. \n\nTHE SOPRANOS is a production of HBO Original Programming, Brad Grey Television and Chase Films; executive producers, David Chase, Brad Grey, Ilene S. Landress, Terence Winter; co-executive producers, Henry J. Bronchtein and Matthew Weiner; supervising producers, Diane Frolov &amp; Andrew Schneider; producers, Martin Bruestle and Gianna Smart.\n","torrent":{"xt":"urn:btih:3afccc987d586a999c0c579834952b89340fd5c6","amp;dn":"The_Sopranos_Sixth_Season_1_21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3afccc987d586a999c0c579834952b89340fd5c6","infoHashBuffer":{"type":"Buffer","data":[58,252,204,152,125,88,106,153,156,12,87,152,52,149,43,137,52,15,213,198]},"announce":[],"urlList":[]}}