{"title":"TuneUp Utilities 2007 v6.0.2311-TE","uid":3813109,"size":10673303,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3b10a3f6ac862417af89173c303b9eb7db13b4a6&amp;dn=TuneUp+Utilities+2007+v6.0.2311-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1190303231,"description":"Here is the critcally acclaimed TuneUp Utilities 2007. TuneUp is pretty self explanatory, it tunes up your computer to make it run faster and it also supposed to help remove crashes. In personal experience with these types of programs, when they claim to fix problems that crash your computer, they usually make it worse. New in ?07 is TuneUp Disk Doctor and TuneUp Disk Space Explorer, and also includes Vista support. If this is your cup of tea, then enjoy!\n\nCompared to the previous version, TuneUp Utilities 2007 has been completely revised and extended with new, exciting features.The new TuneUp Utilities 2007 will make Windows even faster, more comfortable and more secure than ever. Configuring the system, making backups and performing maintenance can be easily carried out using the intuitive user interface - all easily done in one program at a single glance.\n\nProgram Features:\n\n    * Configures Internet Explorer 7, Firefox 2, Windows Media Player 11 and Office 2007\n    * Automatically eliminates errors in the file system\n    * Allows for simple clean-up of your disk drives\n    * Deletes sensitive data using the secure DoD 5220.22-M and Gutmann methods\n    * Scans your system for settings that might be slowing it down and corrects them\n    * Reliably and completely removes unnecessary applications including their registry entries\n","torrent":{"xt":"urn:btih:3b10a3f6ac862417af89173c303b9eb7db13b4a6","amp;dn":"TuneUp+Utilities+2007+v6.0.2311-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b10a3f6ac862417af89173c303b9eb7db13b4a6","infoHashBuffer":{"type":"Buffer","data":[59,16,163,246,172,134,36,23,175,137,23,60,48,59,158,183,219,19,180,166]},"announce":[],"urlList":[]}}