{"title":"Superman Returns: The AdigitalMan Cut SL","uid":3696159,"size":4511791431,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3c25b003e41e9a93d52233cb8c138357eba0f4c0&amp;dn=Superman+Returns%3A+The+AdigitalMan+Cut+SL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xtomo1978x","files":13,"time":1180025297,"description":"ADigitalMan      \nwhat is it about?This is a tighter and more in the sense of the Supermnan predecessors made edit thatalso includes several of the deleted scenes. A true fan made this. \n\noriginal film name: SupermanReturns\nfilm studio name: WB\n\n\nDate Original Film Was Released: 06 21 2006 \nDate Edit Was Released: 19 JAN 2007 \n\nOriginal Runtime: 154 min\nNew Runtime: 154 min \nAmount of time Cut/Added: 5 minutes added/ 5 minutes cut \n\n\nCuts removed/added/extended:\n\nThe scenes in the first 20 or so minutes are rearranged. At the end of the credits, when we zoom into earth, we move to Ma Kent doing the dishes (using the deleted pan-down and with a few subsequent shots removed to get to the &quot;happening&quot; more quickly.) \nSmall trim to the start of the Vanderworth scene. This rearrangement allows the Vanderworth scene to play with the audience. Is it Ma Kent talking to Clark, or is it something else? \nInstead of the cornfield flashback, we have the shot of Clark and the shovel, followed by the X-ray newspaper scene. \nExpanded version of the Lex/Kitty boat scene, where Kitty gets catty. \nAs the camera zooms through the &quot;ice&quot; to the fortress, part of the dialogue about the unnatural weather pattern and the crystals are inserted as a voiceover. \nBrando is cut. It was redundant to Superman II, plus when you consider that we should see no more Brando after his energy was exhausted, it made sense to remove it. Instead, we cut away after Kitty&amp;#039;s line &quot;You act like you&amp;#039;ve been here before.&quot; Which Lex Has. He didn&amp;#039;t need a refresher course from Jor-El. \nExpanded conversation with Clark &amp; Ma Kent, introducing Ben Hubbard. This uses that GREAT line about keeping the world from spinning, and that Cameron-worthy dissolve from the spinning baseball to the Daily Planet building. It expands on Clark&amp;#039;s reluctance to still be Superman, and further underscores the theme that the world moved on without him. \nAdded source music behind the bar scene with old and new Jimmy. Listen carefully. \nLikely to be the best change in the film, Stalkerman is cut without losing any of the exposition of Richard and Lois. The scene cuts from the cab ride to the exterior of the house. Lois never gives a lying &quot;no&quot; response about being in love with Superman, giving the scene MUCH more emotional resonance. Superman&amp;#039;s flight through metropolis comes AFTER this scene, meeting the Jor-El voiceover seamlessly. \nAs the kryptonite shard is removed in the hospital, the shot of it landing in the glass is slowed down, a bigger sound effect is added, and the scene fades to black. Then &quot;Superman is Dead.&quot; \nIn a change directly described by The Bizzle, the Daily Planet scene is trimmed down so we don&amp;#039;t see or even hear about the crowd until we finally see it as Richard drops Lois off. The whole scene is tighter and has greater impact. \nLex&amp;#039;s Paradise scene is moved to a post-credits sequence. This heightens the impact that Lois&amp;#039; revelation about Jason gives Superman the will to live by allowing him to disappear from the hospital quicker. (The sun apparently sets as fast as it does in X3, but whaddayagonnado?) \n\nDVD - Features: \n\n154 minutes NTSC \nstatic menu with audio \n\nwww.Fanedit.org\n \n","torrent":{"xt":"urn:btih:3c25b003e41e9a93d52233cb8c138357eba0f4c0","amp;dn":"Superman+Returns%3A+The+AdigitalMan+Cut+SL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c25b003e41e9a93d52233cb8c138357eba0f4c0","infoHashBuffer":{"type":"Buffer","data":[60,37,176,3,228,30,154,147,213,34,51,203,140,19,131,87,235,160,244,192]},"announce":[],"urlList":[]}}