{"title":"Unity Sound System at Munich -2005- Dubplates and selections","uid":3816663,"size":37693036,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f1f488bd518d59d896cfb9a4e23d4899ee20a09&amp;dn=Unity+Sound+System+at+Munich+-2005-+Dubplates+and+selections&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kan1","files":3,"time":1190571887,"description":"Unity Sound was created at the end of 1997 by three reggae addicts. The name of &quot;Unity&quot; was found after weeks of search. The significance of this word is very important to the members because it represents a part of their identity. The purpose of the sound is to bring all people together, no matter what their skin colour, race or religion, simply through the power of Jah music.\n\nUnity Sound is inspired by heritage sounds like Stone Love, Renaissance, Killamanjaro and David Rodigan having listening to many soundtapes imported from London, New York and Jamaica. Old veterans in Geneva (Addis, Designer, Postman) also contributed to this evolution and helped Unity grow.\n\nFrom the start, the crew decided to build their own speaker boxes to become an original sound system. After consulting some books and checking &quot;Jah Tubby&amp;#039;s&quot; plans on the net Unity started their own boxes in 1999. At the same time the crew began to record dubplates and accumulate various technical apparatus (amplifiers, consoles, ..).\n\nUnity&amp;#039;s dub box is very deep and brings together topical and foundation artists from Jamaica, Europe and the U.S.A. Just to name a few, when listening to Unity Sound you get specials from: Max Romeo, John Holt, Horace Andy, Shinehead, Capleton, Sizzla, Anthony B, Luciano, Beres Hammond, Chuck Fender, Ward 21 and many more.\n\nIn 2000 two more selectors joined the team. Since then they all stand together like five fingers on Jah&amp;#039;s hand to spread good vibes everywhere around.\n\nUnity is mostly known as a juggling sound but does also participate in musical clashes. In 2003 Unity became one of the most wanted sounds in the country by winning the 1st ever &quot;Geneva Clash&quot;, eliminating 3 other sounds including Freebass Digital and New Generation.\n\nAfter years of good selections Unity is becoming more recognised, yet remains modest.. &quot;time will tell&quot; &quot;unity is strength&quot; &quot;strength is the power&quot;","torrent":{"xt":"urn:btih:3f1f488bd518d59d896cfb9a4e23d4899ee20a09","amp;dn":"Unity+Sound+System+at+Munich+-2005-+Dubplates+and+selections","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f1f488bd518d59d896cfb9a4e23d4899ee20a09","infoHashBuffer":{"type":"Buffer","data":[63,31,72,139,213,24,213,157,137,108,251,154,78,35,212,137,158,226,10,9]},"announce":[],"urlList":[]}}