{"title":"liars and theives","uid":3959452,"size":753491964,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3fcf3eb4ac67d97b887f2e4fd096ab2e3d2da696&amp;dn=liars+and+theives&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hater-hater","files":11,"time":1199318727,"description":"the first book to the in the series.   i uploaded the 2nd book first because i checked it out from the library first.\n\nLiars and Thieves is Stephen Coonts as you&amp;#039;ve never seen him before-a story as chilling as it is unforgettable. Tommy Carmellini, a CIA operative who is unafraid to walk both sides of the law to attain his objective, uncovers a dark conspiracy that leads to the highest levels of the American government-and to a ruthless manipulator who will stop at nothing to keep a decades-old secret.Liars and Thieves opens as Carmellini is sent to post guard duty at a farmhouse in West Virginia&amp;#039;s remote Allegheny Mountains, where top government operatives are debriefing a star defector: the ultimate KGB insider, a man with records on every operation and every dirty trick the shadowy intelligence agency has ever run, from Lenin to Putin.Carmellini arrives to find the guards shot dead and a ruthless team of commandos--American commandos--killing everyone in sight, then setting the house on fire. He escapes in a hail of bullets with what seems to be the sole survivor, a stunningly attractive translator who then steals his car, abandoning him, after a deadly mountain car chase.But one other person survived the massacre: The man whose fractured memory holds the KGB&amp;#039;s most embarrassing secrets, including something for which someone will kill to keep it quiet. Carmellini teams up with his mentor, Admiral Jake Grafton, and together they track down the amnesiac defector. From there, the hunt is on as they become the target of a lethal squad of killers who can only be taking direction from someone very close to the president. From a bloody ambush at a posh Virginia estate, to assassinations on the decaying streets of inner city Washington, to a makeshift safe house at Grafton&amp;#039;s Delaware summer home, no place is outside the ruthless conspiracy&amp;#039;s reach. Carmellini and Grafton must learn to tell friend from foe as they fight their way through a poisonous wilderness of intrigue, all the way to a presidential convention in New York City-and to the surprising identity of someone standing on the verge of absolute power who has jeopardized the safety of the entire nation to prevent a dark secret from ever seeing the light of day.","torrent":{"xt":"urn:btih:3fcf3eb4ac67d97b887f2e4fd096ab2e3d2da696","amp;dn":"liars+and+theives","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fcf3eb4ac67d97b887f2e4fd096ab2e3d2da696","infoHashBuffer":{"type":"Buffer","data":[63,207,62,180,172,103,217,123,136,127,46,79,208,150,171,46,61,45,166,150]},"announce":[],"urlList":[]}}