{"title":"Korn","uid":3550633,"size":90766201,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:408485609bf636137eec09e9c68de6ce7292b618&amp;dn=Korn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neogeo64_36","files":26,"time":1162564866,"description":"Drummer David Silveria, guitarist Munky (a.k.a. James Shaffer), and bassist Fieldy (Reginald Arvizu) were involved with Rick Morrill in the band L.A.P.D. (Love And Peace Dude). It was later changed to stand for Laughing As People Die in order to be taken more seriously as a band. During the mid-80s, Fieldy and Head (Brian Welch) were also members of rock group Rig Tyme. &amp;#039;Head&amp;#039; took his nickname (an unwanted one) from the &amp;#039;large&amp;#039; size of his head, not from any sexual or drug related quality, &amp;#039;Munky&amp;#039; a reference to his primate-like feet while &amp;#039;Fieldy&amp;#039; was an abbreviation of &amp;#039;Garfield&amp;#039;, in honor of the bassists prominent cheeks. Reginald, Arvizu had also subbed for a Keith Galloway-fronted band named Pretty Boy Floyd, although not the familiar glam outfit of the same name. L.A.P.D. undertook gigs around southern California and contracted a label deal with independent label Triple-X Records, resulting in a 12&quot; single and an album entitled &amp;#039;Who&amp;#039;s Laughing Now&amp;#039;, both released in 1992. When L.A.P.D. folded, due to time honoured musical differences, Morrill forged Supermodel with erstwhile Sexart personnel.\n\nDuring 1993 Jonathan Davis got together with Human Waste Project for their first demo tape dueting with vocalist Aimee Echo on a strictly non-saccharine cover version of &amp;#039;This Town&amp;#039; by The Go-Go&amp;#039;s. This recording was to be unearthed on a subsequent Korn bootleg. (Such was the fascination between fans of both bands that during late 1997 the acts convened once more in the recording studio to lay down a further take on the song interbred for use as a Korn single B side). Munky, Head, Fieldy, and Silveria in the meantime, had assembled Creep. Whilst on the lookout for a singer, Silveria was headhunted for Mike Muir&amp;#039;s Infectious Grooves, but opted to remain with his colleagues. Whilst on the hunt for a singer the quartet spotted Davis performing with Sexart at John Bryan&amp;#039;s Bar. Auditions in Huntington Beach secured the band&amp;#039;s new frontman.\n\nKorn would be the name of the band, chosen because no-one would forget it. Their manager Larry Weintraub thought it was so bad that they would never get a record deal with it. Davis then proposed another name to Weintraub: they would name the band after him, and be called &amp;#039;Larry&amp;#039;. Weintraub gave in at this point, and got them signed within three months under their original name of Korn, with Jonathan developing the logo with the infantile reversed &amp;#039;R&amp;#039;. The band released their self-titled debut album, Korn, through Epic/Immortal Records in October , 1994. Korn is arguably the album most responsible for the rise of nu metal and has been a vital influence to legions of other bands of the genre including Limp Bizkit, Coal Chamber, Adema, and Slipknot, earning Korn the frequent nickname &amp;#039;godfather of nu-metal.&amp;#039;\n\n","torrent":{"xt":"urn:btih:408485609bf636137eec09e9c68de6ce7292b618","amp;dn":"Korn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"408485609bf636137eec09e9c68de6ce7292b618","infoHashBuffer":{"type":"Buffer","data":[64,132,133,96,155,246,54,19,126,236,9,233,198,141,230,206,114,146,182,24]},"announce":[],"urlList":[]}}