{"title":"24c3-2155-en-universe_on_supercomputers.mp3","uid":3953250,"size":24487691,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:409faea0598e458dfda21a0e80c32df66dbf42da&amp;dn=24c3-2155-en-universe_on_supercomputers.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"num42","files":1,"time":1198978140,"description":" &lt;a href=&quot;http://events.ccc.de/congress/2007/Fahrplan/events/2155.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://events.ccc.de/congress/2007/Fahrplan/events/2155.en.html&lt;/a&gt;\n\nSpeakers:     \t Mark Vogelsberger\n\nSimulating the Universe on Supercomputers\n\nThe evolution of cosmic structure\n\nThe evolution of structure in the Universe is one of the hottest topics in Cosmology and Astrophysics. In the last years the so-called $Lambda$-CDM-model could be established also with great help of very large computer simulations. This model describes a Universe that consists mainly of dark components: 96% are made of dark energy and dark matter. Ordinary matter made up of baryons give only 4% to the total content of the Universe. The talk will present recent results with the main focus on computational methods and challenges in that field. A state-of-the-art computer code for running these calculations will be presented in detail.\n\nThe talk will describe recent progress in the field of cosmic structure formation and will mainly focus on computational problems and methods carrying out such large simulations on the fastest Supercomputers available today. At the end of the talk I will also briefly discuss a new method we developed to access the dark matter structure in the Milky way to a scale that was just impossible some month ago with current Supercomputers.\n\nTo describe the evolution of the Universe from the Big Bang to what we see today is a quite hard task. It took many years until we reached an understanding and model that fits the observations we get by telescopes and satellites. Great steps in justifying this model were possible because of computer simulations. These simulations calculate the evolution of the universe from a short time after the Big Bang to present time. Comparing the results of these simulations with observations was a major proof for the correctness of the $Lambda$-CDM model. The simulation itself is highly complicated because the main force driving the evolution of the universe is gravitation in an expanding space. And this force acts over extremely large distances. This makes computations very expensive and large computers and efficient algorithms are needed to handle this problem. The biggest simulation ever done in that field is the Millennium Run, carried out by our institute. It took one month of computation on a 512-CPU-Cluster at the Max Planck Society Computing Center. Even with this computer power it is only possible to simulate the dark part of the universe. So the simulation only includes dark matter and dark energy. There are no galaxies, stars, planets or even smaller objects. The dynamical range that would be needed to simulate all together is just so large, that it is totally impossible to run this on any computer today or in the future. Nevertheless to get real galaxies in the Millennium simulation they are added in a post processing by so called Galaxay-Formation-Algorithms. These take the dark matter distribution given by the simulation and populate it with galaxies based on some astrophysical models. This way one can create a universe with shining galaxies a so called Mock Universe. From the dark matter distribution itself one can also learn a lot, make statistics and compare them to observational data. It is quite impressive that the structures forming in the computer simulation look exactly like the structure galaxies and clusters of galaxies in the real universe. Recently a researcher group simulated a Milky Way like dark matter structure with an extremely high resolution to get more insights into the Dark Matter around us. This so called Via Lactea Simulations used NASA&amp;#039;s fastest project Colombia Supercomputer for about one month to finish the calculation.\n\nThe talk will mainly focus on numerical techniques how to run such a simulation. As an example the state-of-the-art code Gadget (Springel, 2005) will be presented. This code was used to calculate the Millennium Simulation. It is at the moment the leading code for cosmological simulations.\n\nAt the end of the talk a new method will be presented that increases the resolution of all simulations done so far by an enormous factor.","torrent":{"xt":"urn:btih:409faea0598e458dfda21a0e80c32df66dbf42da","amp;dn":"24c3-2155-en-universe_on_supercomputers.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"409faea0598e458dfda21a0e80c32df66dbf42da","infoHashBuffer":{"type":"Buffer","data":[64,159,174,160,89,142,69,141,253,162,26,14,128,195,45,246,109,191,66,218]},"announce":[],"urlList":[]}}