{"title":"Star Trek-the original series-Vol.1-Eps.2-3 (DivX.Wide)","uid":3819259,"size":731553845,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:41c9e87d5211b34e09f849cc8d50638d097eea74&amp;dn=Star+Trek-the+original+series-Vol.1-Eps.2-3+%28DivX.Wide%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skippytroy","files":5,"time":1190763299,"description":"This first DVD volume of episodes from the original Star Trek begins with a show that saved the series even before it launched. &quot;Where No Man Has Gone Before&quot; was actually the second Trek pilot produced by Gene Roddenberry after NBC rejected &quot;The Cage&quot; (now a subject of cult fascination). A retooled cast now included William Shatner as Captain James R. Kirk (the middle initial T came later), Leonard Nimoy as Mr. Spock, George Takei as Ensign Sulu, and James Doohan as Chief Engineer Montgomery Scott. (DeForest Kelley, Nichelle Nichols, and Walter Koenig signed on in subsequent episodes.) A lot of thought went into scriptwriter Samuel L. Peeples&amp;#039;s story about a crewman named Gary Mitchell (Gary Lockwood) who has a close relationship with Kirk and some natural ESP abilities. When the Enterprise approaches an energy barrier at the edge of the galaxy, Mitchell metamorphoses into a godlike being with silver eyes, awesome psychic abilities, and a rapidly developing ego. As Mitchell becomes an increasing threat to the ship, Kirk is faced with making a terrible choice to save his crew. \nThe episode locked in the very character and themes of Star Trek: science fiction stories told in mortal terms, the conflict between relationships and duty, and a strong emphasis on exploring personalities. Lockwood&amp;#039;s disciplined, modulated performance was a big plus. (He went on, of course, to play astronaut Frank Poole in 2001: A Space Odyssey.) \n\nThe second show in this volume was the tenth to air, &quot;The Corbomite Maneuver.&quot; While exploring an uncharted region of the galaxy, the Enterprise encounters a cube-shaped alien probe (a predecessor of Borg vessels?) that Kirk promptly destroys. That action brings the wrath of a spaceship called the Fesarius, which locks the Enterprise in a tractor beam from which it can&amp;#039;t escape. The show is perhaps best known for something of a surprise ending when the &quot;captain&quot; of the Fesarius (played by Clint Howard, brother of Ron and child star of TV&amp;#039;s Gentle Ben) is revealed. Directed by Joseph Sargent (Colossus--The Forbin Project). --Tom Keogh \n\nProduct Description\n&quot;Where No Man Has Gone Before&quot; (Ep.2): An energy barrier heightens the psionic abilities of two crew members. &quot;The Corbomite Maneuver&quot; (Ep.3): Krik bluffs an alien ship to prevent the Enterprise from being destroyed. \n\n","torrent":{"xt":"urn:btih:41c9e87d5211b34e09f849cc8d50638d097eea74","amp;dn":"Star+Trek-the+original+series-Vol.1-Eps.2-3+%28DivX.Wide%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c9e87d5211b34e09f849cc8d50638d097eea74","infoHashBuffer":{"type":"Buffer","data":[65,201,232,125,82,17,179,78,9,248,73,204,141,80,99,141,9,126,234,116]},"announce":[],"urlList":[]}}