{"title":"Zachary Gresser - Clarke II - The Album","uid":3579443,"size":57860443,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46b31795ba38756a9c57f27d328ded42d9e4043c&amp;dn=Zachary+Gresser+-+Clarke+II+-+The+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thewrangler","files":15,"time":1166476154,"description":"1. Prelude\n2. Erica\n3. Alec, I Love You\n4, Toni, Shake Ya Ass (Feat. Fred Kennedy)\n5. I Broke Up\n6. Reach For the Stars\n7. Interlude (The Empty Hallway)\n8. Fed Kennedy\n9. Where is God?\n10. Next Stop, Heaven (Feat. The Kleptomaniacs)\n11. Yankee Doodle\n12. Overture\n\n--\n\nThis album comes from Ithaca College, NY, where a group of friends inspired artist Zachary Gresser to create a musical representation of the happenings in his friends minds and spirits. The artist, Zachary Gresser, writes this on the back cover:\n\nClarke 2,\n\nSometimes, a raging torrent of madness. Sometimes, a melodrama consisting of paralleling those social conflicts in our own lives- with that of fictional television characters. Always, a place I consider home. Not for its physical appearance, nor its undistinguishable, but always present odor. The community. The people. The ragtag group of kids who are all just trying to find a place for themselves in this unfamiliar environment. This album is the culmination of all the experiences, varying from the complications of terminating long-distance relationships to the philosophic inquiry of the existence of god. My goal was to take Clarke 2?s improvisational spirit and turn it into improvisational music. Music- inspired by the undying love for living in the present of whatever moment is being created within Clarke 2. That is where the spirit of youth lives. That is where we live.\n\nMy wish to you, listening to this album, is to be able to feel that spirit through the power of melody. So go ahead, laugh at the inexcusable vulgarities of my lyrical wit, cry at the sadness of losing an old train conductor... and most importantly live.","torrent":{"xt":"urn:btih:46b31795ba38756a9c57f27d328ded42d9e4043c","amp;dn":"Zachary+Gresser+-+Clarke+II+-+The+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46b31795ba38756a9c57f27d328ded42d9e4043c","infoHashBuffer":{"type":"Buffer","data":[70,179,23,149,186,56,117,106,156,87,242,125,50,141,237,66,217,228,4,60]},"announce":[],"urlList":[]}}