{"title":"AZTEK SUN - PROMO-SAMPLER ( NEW SWEDISH HARD ROCK )","uid":3950704,"size":68499656,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:476c1b18973a3a4fd20e613119d1d29875f7c6e4&amp;dn=AZTEK+SUN+-+PROMO-SAMPLER+%28+NEW+SWEDISH+HARD+ROCK+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bcullop1989","files":6,"time":1198835019,"description":"VOTES AS THE BEST UNSIGNED HARDROCK ACT IN 4 MAJOR MUSIC MAGZ, NOW WITH A BRAND NEW CD &quot; BRAND NEW BREATH &quot;.\n\nTHIS IS THEIR PROMO CD - ONLY FOR RADIOSTATIONS, LABELS..ETC...\n\n\nBorn in Southside-Sweden and raised by the LA-Rock scene we found ourselves makin an album that we hope more people than us will enjoy....no one really knows the whole story how the band got together in this setting... I guess....it all took shape in a daze of beer nÃ‚Â´ whiskey......we assume...thatÃ‚Â´s our story and weÃ‚Â´re stickinÃ‚Â´ to it! The album that was finished in April, wich has had the workingname of &quot;Brand New Breath&quot;, is a 12 track raw Hard Rock album. ItÃ‚Â´s been Recorded, Mixed and Mastered, and the band is currently seeking a label to pick it up and release it. \n\n\nREVIEW FROM HARD ROXXEN ( US )\n\n&quot;ONE ON THE BEST NEW BANDS AROUND, THIS IS DIFFERENT, THIS IS FRESH....THIS IS GREAT.&quot;\n\nREVIEW FROM MYMETAL ( UK - ONLINE )\n&quot;AZTEK SUN LEAVES ME WITH A TASTE FOR MORE, THIS IS OLD SCHOOL HARDROCK PRESENTED FRESH.....GIVE ME A SHOT OF JACK D!&quot;\n\n \n\nREVIEW FROM METAL REVOLUTION ( DKK )\nBrand New Breath and it contains ten up-tempo rockin&amp;#039; but also some softer tracks. The music and sound is very decent and reminds me a lot of some glam rock bands from the LA scene of the late 80s, esp. bands like LA Guns, Guns &amp;#039;n Roses, Skid Row and other similar acts. I like the voice of Magnus, it is quite unusual and particular, and not something that I would necessary connect to Swedish scene. It is also the best thing I can say about this band, they sure are unique and innovative, quite different from anything I usually listen to these years. It is awesome pleasure to see that some other people still enjoy old-school hard-rock with soft ballads and kick ass lyrics. It is true hard rock filled with adrenaline, but also with metal and rock &amp;#039;n&amp;#039; roll elements to it all. Almost all of the 12 songs presented here are riff-based but also with big deal melody to it all. The band is looking for a label to release this album and present it to the wider metal audience. So if you can help in any way then please visit -email- the band.\n\n\nREVIEW FROM CATHOUSE ( ITALY )\n\nAZTEK SUN is a good band from south sweden, which was formed with a chat in front of a good whiskey and a beer. Their influences are clearly the ones of the old Los Angeles music scene; the first L.A.Guns, The kinky Faster Pussycat, Guns n&amp;#039; roses, they all are somehow appearing in this album that was recorded and mixed by the band itself, they are now waiting for a lable ready to distribute it. 12 song of hot rock, the rhythm is never slowing down, Magnus and Krille guitar games are dominating this cd,Brian plays the drums at the highest speed, and Dave&amp;#039;s bassguitar is pure adrenaline in every played note.Magnus voice is particular, he is not a pure screamer but he is fascinating and his voice is warm and able to suit every song.It&amp;#039;s hard to find a particular song to describe because they are all well done and worthy.So just to show you some of them... The title track Brand New Breath has a riff that stick in your mind immediately, and Break down makes us feel like the swedish scene will never stop to give us great surprises. These guys surely deserve a good deal so that they will be able to show how good they are and achieve a good number of fans. Last but not least another song which sounds like our thought, our scream: &quot;Same shit, Same day&quot;-...When everyday feels like the previous one and the next one, a true rebellion song. Well done! In Italian... http://www.cathouse.it/recensioni20065.htm\n\n\nREVIEW FROM HOLLYWOOD UNSIGNED ( US )\n\n&quot;IF YOU LIKE MOTLEY CRUE, SKID ROW, BACKYARD BABIES.....YOU WILL LOVE THIS. I DO, IT ROCKS&quot;\n\nwww.myspace.com/azteksun","torrent":{"xt":"urn:btih:476c1b18973a3a4fd20e613119d1d29875f7c6e4","amp;dn":"AZTEK+SUN+-+PROMO-SAMPLER+%28+NEW+SWEDISH+HARD+ROCK+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"476c1b18973a3a4fd20e613119d1d29875f7c6e4","infoHashBuffer":{"type":"Buffer","data":[71,108,27,24,151,58,58,79,210,14,97,49,25,209,210,152,117,247,198,228]},"announce":[],"urlList":[]}}