{"title":"Airwolf - part of Seasons 2 &amp; 3","uid":3559869,"size":3711946752,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:484e20e66c8ef44a169b30c6944d8d6a73cbb948&amp;dn=Airwolf+-+part+of+Seasons+2+%26+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MadMax23","files":10,"time":1163855184,"description":"Here are a few episodes of the 80s series \\&quot;Airwolf\\&quot;. These are all the ones I\\&amp;#039;ve managed to compile over the past year - and I haven\\&amp;#039;t been able to find any more recently - which means that there aren\\&amp;#039;t a heck of a lot of these available.\n\nAirwolf -\n\nStarring:\n\nJan-Michael Vincent as Stringfellow Hawke\nAlex Cord as Michael Cole Briggs-Smith III (Archangel)\nJean Bruce Scott as Caitlynn\nEarnest Borgnine as Dominick Santini\n\nCreator and Executive Producer - Donald P. Belisario\n\nEpisodes:\n\n2x01 - Sweet Britches - Hawke is called into rescue an old \\&amp;#039;Nam buddy in a small Texas town run by a corrupt sherriff (Le Gault), when he meets a Texas Air Deputy (Scott) who helps to bail him out. \nGuest Stars:\nLance Le Gault\nJeff MacKay\nGuich Koock\nRobert Pierce\nand James Whitmore Jr. as Sam Houston\n\n* * * \n\n2x11 - Random Target - Hawke and Santini are asked to do a favor for a fellow airman, when they accidentally fly over a secret meeting of a mob boss (Birman) who schemes  to take over the United States.\nGuest Stars:\nAnne Lockhart\nLen Birman\n\n* * * \n\n2x13 - The American Dream - Hawke seeks to help out a old Vietnamese friend out with his farm, from being attacked by a fellow countryman (Soon-Tech) who is running an extortion racket. \nGuest Stars:\nJames Shigeta\nJohn Fujioka\nMarilyn Tokuda\nF. William Parker\nBuelah Quo\nand Soon-Teck Oh as Minh\n\n* * *\n\n2x14 - Firestorm - Santini helps out a drunk friend (Roche) who he used to fly with in the Navy in World War II, who sees strange UFO-like lights at night - which leads to him and Hawke getting captured by an old Vietnam General (Campanella) with designs to start World War III.\nGuest Stars:\nEugene Roche\nJoseph Campanella\n\n* * *\n\n2x15 - Moffett\\&amp;#039;s Ghost - Hawke and Santini encounter a virus within Airwolf\\&amp;#039;s computer systems created by Airwolf\\&amp;#039;s designer - and have to call in a computer programmer who worked outside of the F.I.R.M. on the Airwolf project.\nGuest Stars:\nRobin Riker\nDeborah Pratt\nDonald Hotton\nSpecial Guest Star - David Hemmings as Moffett\n\n2x16 - The Truth About Holly - Hawke and Santini travel to Mexico to rescue Santini\\&amp;#039;s niece (Howard) from a Mexican warlord. The niece, suddenly develops an infatuation for Hawke, tries to kill Caitlynn and Hawke is forced to rescue them both.\nGuest Stars:\nBarbara Howard\nRick Jason\nLuke Askew\nDavid Ruprecht\n\n* * *\n\n2x19 - Dambreakers - Hawke flies a reporter to a religious community and later discovers a secret plot from within to destroy one of the largest dams in the western U.S.\nGuest Stars:\nMarjoe Gortner\nGregory Walcott\nDevon Ericson\nand Heather McNair\n\n* * * \n\n2x20 - HX1 - Hawke suspects his long-lost brother is alive when a top-secret helicopter is stolen by a group that he believes only could\\&amp;#039;ve been pulled off by members of his Special Ops Veitnam unit - only to discover that it was done by another member who he thought had been killed during the Vietnam War.\nGuest Stars:\nMichael Halsey\nP.J. Soles\nSam Melville\nCharles Cyphers\nPeggy McCay\nFrank Marth\nand Chris Connelly as Saint John Hawke\n\n* * *\n\n2x21 - Severance Pay - A friend of Hawke\\&amp;#039;s who was retiring, gets denied his pension and later goes nuts - only to help inadvertantly discover a mole within the F.I.R.M. \nGuest Stars:\nMartin Milner\nDeborah Pratt\nEd Crick\nSpecial Guest Star - Arte Johnson\n\n* * *\n\n3x01 - The Horn of Plenty - Hawke is called to work for a jewelry conglomerate and is later seduced by the daughter of the man (Lynch) who owns the jewelry conglomerate and has designs on capturing Airwolf. ([Swedish?] Subtitled - Possible VHS rip - not DVD Quality - but watchable)\nGuest Star:\nCatherine Hickland\nSpecial Guest Star - Richard Lynch\n\n\nAs always - enjoy!","torrent":{"xt":"urn:btih:484e20e66c8ef44a169b30c6944d8d6a73cbb948","amp;dn":"Airwolf+-+part+of+Seasons+2+%26+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"484e20e66c8ef44a169b30c6944d8d6a73cbb948","infoHashBuffer":{"type":"Buffer","data":[72,78,32,230,108,142,244,74,22,155,48,198,148,77,141,106,115,203,185,72]},"announce":[],"urlList":[]}}