{"title":"[Synth / Electronic] ascii.Disko (2003)","uid":3573971,"size":106610889,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:49952b6be26cf3d9f7f87ded0923381441d25417&amp;dn=%5BSynth+%2F+Electronic%5D+ascii.Disko+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xenu dot net","files":14,"time":1165709302,"description":"Ascii.Disko\nRelease Date: October 21, 2003\nGenre: Electronic, Synth-pop\nwww.asciidisko.com\n\n\nAscii.Disko is Kat D.D.Rokk, who used to be the guitarist and main man with the ever popular but meanwhile split-up Stoner rock heroes Slown, currently the guitarist and keyboarder of the magnificent sci-fi indie rockers Venus Vegas and apart from that also working as a producer (tigerbeat).  Borrowing from ?80s synth pop, acid house, electronica, and techno, ASCII Disko gives us twelve tracks of manic indie electronica that will have you grooving along in no time.\n\nAmongst the utter bombardment of electronic music these days, especially from the &quot;underground&quot;, spotting the gems remains the most fun pursuit about the whole thing, really.. With Ascii Disko, you need look no further. While it's undoubtdedly a retro album in that it will bring to mind some of the best alternative electro moments of the 80s, at the same time it's very progressive, reaching forward by using soundscapes of the past in a very creative manner. More to its credits that it's sung in German giving us a break from all the english-speaking releases out there (especially from German bands for that matter). Its lyrics are again reminiscent of that 80s vibe, daily observations of a world spinning round without necessarily much sense to it, comments on trends and people waking by and fading away. It has also this well felt vibe of romanticism to it, which, due to the analog sounding synth beats (metallic claps included) will easily remind of that &quot;new-romantic&quot; scene of the 80s with the only difference being the great production and the even greater execution of the whole concept..\n\nIf you're into electronic music you absolutely need to hear this! \n\nSurely everyone knows the feeling: the irresistible urge to move when you?re at the disco and they play the song you?ve been waiting for all night ? and you even forget the young lady whose attention you?ve been trying to get for weeks ? just to make a complete idiot of yourself by going crazy ape shape on the dancefloor (and feeling incredibly sexy while doing so?.). Or the moment when you hear something entirely new for the first time that instantly takes hold of you ? without your pals first having to approve that it?s cool.\nAscii.Disko is such a case. It?s no use trying to classify it.\n\nI mean how do you want to explain the thrill of dancing the night away to the most thrilling sound to people who don?t dance? Feel it. Dance. Or learn how to. Waste your youth ? and enjoy it, damn it.\n\n\n\nTrack Listing\n\n1. Immer\n2. Ne Travailler Jamais\n3. Strassen\n4. Cool\n5. Jetzt\n6. Aldimarkt\n7. Einfach\n8. Jack Your Body to the Beat\n9. Moi, Je Veux\n10. Photos\n11. Schanze\n\n\nKids, always remember Xenu is your friend.\n\nwww.xenu.net\n","torrent":{"xt":"urn:btih:49952b6be26cf3d9f7f87ded0923381441d25417","amp;dn":"%5BSynth+%2F+Electronic%5D+ascii.Disko+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49952b6be26cf3d9f7f87ded0923381441d25417","infoHashBuffer":{"type":"Buffer","data":[73,149,43,107,226,108,243,217,247,248,125,237,9,35,56,20,65,210,84,23]},"announce":[],"urlList":[]}}