{"title":"F1 Grand Prix Monaco 2007 DVD","uid":3699656,"size":4509016064,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ae3dd3f2f589d7199660b1b4c90464c686c58d6&amp;dn=F1+Grand+Prix+Monaco+2007+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"joredos","files":11,"time":1180387856,"description":"Audio is bulgarian\nTV is BTV\n\nMonaco Grand Prix (Grand Prix de Monaco) is a Formula One race held each year on the Circuit de Monaco. Run since 1929, it is widely considered to be one of the most important and prestigious automobile races in the world alongside the Indianapolis 500, the Daytona 500 and the 24 Hours of Le Mans. Its history, the spectacle of the event, and the glamour associated with it, result in the race being considered &quot;the jewel of the Formula One crown&quot;.[1]\n\nThe first race in 1929, was organised by Antony Noghes through the &quot;Automobile Club de Monaco&quot;, and was won by William Grover-Williams, driving a Bugatti. The event was part of the pre-Second World War European Championship and was included in the first Formula One World Championship in 1950. The race is held on a narrow course laid out in the streets of Monaco, whose many elevation changes and tight corners make it one of the most demanding tracks in Formula One. In spite of the relatively low average speeds it is a dangerous place to race.\n\nBrazil&amp;#039;s Ayrton Senna won the race more times than any other driver, with six victories, five of them consecutively from 1989 to 1993. However it is Graham Hill, a 5-time winner of the race in the 1960s, who is known as &quot;Mr Monaco&quot;","torrent":{"xt":"urn:btih:4ae3dd3f2f589d7199660b1b4c90464c686c58d6","amp;dn":"F1+Grand+Prix+Monaco+2007+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae3dd3f2f589d7199660b1b4c90464c686c58d6","infoHashBuffer":{"type":"Buffer","data":[74,227,221,63,47,88,157,113,153,102,11,27,76,144,70,76,104,108,88,214]},"announce":[],"urlList":[]}}