{"title":"Hacking Democracy","uid":3552888,"size":864219476,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4af22abd11a217b57d6472618d38bb36f22f849e&amp;dn=Hacking+Democracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lestab79","files":1,"time":1162884705,"description":"720x486 (NTSC) DivX rip of the HBO documentary Hacking Democracy\n\n-------------------------------------------------------------------------------------\n\nElectronic voting machines count about 87% of the votes cast in America today. But are they reliable? Are they safe from tampering? From a current congressional hearing to persistent media reports that suggest misuse of data and even outright fraud, concerns over the integrity of electronic voting are growing by the day. And if the voting process is not secure, neither is America&amp;#039;s democracy. The timely, cautionary documentary HACKING DEMOCRACY exposes gaping holes in the security of America&amp;#039;s electronic voting system.\n\nIn the 2000 presidential election, an electronic voting machine recorded minus 16,022 votes for Al Gore in Volusia County, Fla. While fraud was never proven, the faulty tally alerted computer scientists, politicians and everyday citizens to the very real possibility of computer hacking during elections.\n\nIn 2002, Seattle grandmother and writer Bev Harris asked officials in her county why they had acquired electronic touch screen systems for their elections. Unsatisfied with their explanation, she set out to learn about electronic voting machines on her own. In the course of her research, which unearthed hundreds of reported incidents of mishandled voting information, Harris stumbled across an &quot;online library&quot; of the Diebold Corporation, discovering a treasure trove of information about the inner-workings of the company&amp;#039;s voting system.\n\nHarris brought this proprietary &quot;secret&quot; information to computer security expert Dr. Avi Rubin of Johns Hopkins University, who determined that the software lacked the necessary security features to prevent tampering. Her subsequent investigation took her from the trash cans of Texas to the secretary of state of California and finally to Florida, where a &quot;mini-election&quot; to test the vulnerability of the memory cards used in electronic voting produced alarming results.\n\nAs the scope of her mission grew, Harris drew on the expertise of other computer- science experts, politicians and activists, among them: Andy Stephenson, candidate for secretary of state in Washington state; Susan Bernecker, Republican candidate in New Orleans; Kathleen Wynne, an activist from Cleveland; Dr. Herbert Thompson, chief security strategist, Security Innovation, Inc.; Ion Sancho, supervisor of elections for Leon County, Fla.; and Harri Hursti, a computer-security analyst. Academics, public officials and others seen in interview footage include: Deanie Lowe, supervisor of elections, Volusia County, Fla.; Mark Radke, marketing director of Diebold; David Cobb, presidential candidate, Green Party; and Rep. Stephanie Tubbs-Jones of Ohio.\n\nDiebold software, or other software like it, is installed in thousands of counties across 32 states. David Dill, professor of computer science at Stanford, says the problem is that there are &quot;lots of people involved in writing the software, and lots of people who could have touched the software before it went into that machine. If one of those people put something malicious in the software and it&amp;#039;s distributed to all the machines, then that one person could be responsible for changing tens of thousands of votes, maybe even hundreds of thousands, across the country.&quot;\n\nIn Florida, Leon County supervisor of elections Ion Sancho presided over a trial &quot;mini-election&quot; to see if the vote could be hacked without being detected. Before votes were actually cast, computer analyst Harri Hursti &quot;stuffed the ballot box&quot; by entering votes on the computer&amp;#039;s memory card. Then, after votes were cast, the results displayed when the same memory card was entered in the central tabulating program indicated that fraud was indeed possible. In other words, by accessing a memory card before an election, someone could change the results - a claim Diebold had denied was possible.\n\nUltimately, Bev Harris&amp;#039; research proved that the top-secret computerized systems counting the votes in America&amp;#039;s public elections are not only fallible, but also vulnerable to undetectable hacking, from local school board contests to the presidential race. With the electronic voting machines of three companies - Diebold, ES&amp;S and Sequoia - collectively responsible for around 80 percent of America&amp;#039;s votes today, the stakes for democracy are high.","torrent":{"xt":"urn:btih:4af22abd11a217b57d6472618d38bb36f22f849e","amp;dn":"Hacking+Democracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af22abd11a217b57d6472618d38bb36f22f849e","infoHashBuffer":{"type":"Buffer","data":[74,242,42,189,17,162,23,181,125,100,114,97,141,56,187,54,242,47,132,158]},"announce":[],"urlList":[]}}