{"title":"Prison Break seizoen 1 (dutch sub)","uid":3947750,"size":46484759075,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4b0b15c2ad0e6c7ebff7bc55348880ed59346fe4&amp;dn=Prison+Break+seizoen+1+%28dutch+sub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"master_loader","files":-1,"time":1198619360,"description":"Prison Break Seizoen 1\n\nSpeelduur:\t17 uur\nGenre:\t\tThriller\n\nDe meeste mensen zouden er veel voor over hebben om te vertrekken uit de gevangenis, maar Michael Scofield is er alles aangelegen om in de gevangenis te komen. \nZijn broer Lincoln is ter dood veroordeeld voor de moord op de broer van de vice-president.\nHij blijft volhouden onschuldig te zijn en de enige manier om hem te redden is van binnenuit.\n\nMichael laat de blauwdrukken van de gevangenis op zijn lichaam tatoeeren en bedenkt een ingewikkeld vluchtplan.\nNadat het hem is gelukt om in dezelfde gevangenis als zijn broer terecht te komen, begint de race tegen de klok. \nHij heeft nu al zijn kennis, moed en geluk nodig... net als de hulp van de meest verwerpelijke en gevaarlijke medegevangenen.\n\n\n***Al mijn torrents:http://thepiratebay.se/user/master_loader***\n\n\nDvd 1\n\n\nAflevering 1\nPILOT\n\nBouwkundig ingenieur Michael Scofield laat zich opzettelijk gevangen nemen om de ontsnapping van zijn broer Lincoln vanuit de gevangenis te kunnen organiseren.\nHij is er namelijk stellig van overtuigd dat zijn broer Lincoln ten onrechte ter dood is veroordeeld.\n\nAflevering 2\nALLEN\n\nVoor de uitvoering van zijn plannen vraagt Michael de hulp van zijn medegevangenen. Hierbij maakt hij echter ook vijanden.\n\nAflevering 3\nCELL TEST\n\nMichael weet niet of hij Sucre kan vertrouwen en wil zijn loyaliteit op de proef stellen. Sucre weigert echter mee te werken en vraagt om overplaatsing naar een andere cel.\nAbruzzi laat merken wel te willen doen aan Michaels ontsnappingsplan.\n\nAflevering 4\nCUTE POISON\n\nMichael vreest dat zijn nieuwe psychotische celmaat zijn plan zal verraden. Veronica neemt een andere advocaat in de arm als zij nieuw bewijsmateriaal voor lincolns zaak ontdekt.\n\n\nDvd 2\n\nAflevering 5\nENGLISCH, FITZ OR PERCY\n\nKellerman en Hale chanteren gevangenisdirecteur Pope om Michael naar een andere gevangenis over te plaatsen.\nMichael moet snel handelen om de overplaatsing te voorkomen.\n\nAflevering 6\nRIOTS, DRILLS AND THE DEVIL (part 1)\n\nAls Michael achter dreigt te raken met zijn ontsnappingsplan, veroorzaakt hij een enorme rel door het airconditioningsysteem van de gevangenis te saboteren.\nVeronica wijst Nicks hulp af in Lincolns zaak, omdat zij hem steeds minder vertrouwt.\n\nAflevering 7\nRIOTS, DRILLS AND THE DEVIL (part 2)\n\nTerwijl de rel voortduurt, moet Michael Sara tegen de medegevangenen beschermen. Abruzzi en Sucre gaan samenwerken om de ontsnapping te bespoedigen.\n\nAflevering 8\nTHE OLD HEAD\n\nTot grote ontzetting van Michael is een oude opslagruimte, die cruciaal is voor zijn plan, omgebouwd tot pauzekamer voor de bewakers.\nBuiten de gevangenis komt het leven van Nick, Veronica en LJ ernstig in gevaar.\n\n\nDvd 3\n\n\nAflevering 9\nTWEENER\n\nNu Lincoln om het leven van zijn zoon vreest, wordt zijn drang om uit de gevangenis te ontsnappen alleen maar groter.\nMichael neemt een moeilijke beslissing als blijkt dat de verwerpelijke T-Bag jongere medegevangenen seksueel blijft lastigvallen.\n\nAflevering 10\nSLEIGHT OF HAND\n\nOm zijn ontsnappingsplan te kunnen voortzetten moet Michael de verblijfplaats van Fibonacci prijsgeven, een onschuldige man die op de dodenlijst van de maffia staat.\nKellerman en Hale krijgen onverwachte hulp bij hun jacht op LJ.\n\nAflevering 11\nAND THEN THERE WERE 7\n\nIedereen, en vooral Sara, is geschokt als Michaels &amp;#039;vrouw&amp;#039; voor een echtelijk bezoek langskomt. Tijdens haar bezoek geeft zij Michael een belangrijke sleutel voor zijn ontsnappingsplan.\n\nAflevering 12\nODD MAN OUT\n\nNu de ontsnapping steeds dichterbij komt, blijkt dat een man moet afvallen en de mannen kiezen voor T-Bag.\nMaar die heeft hele andere ideeen. Ondertussen rennen Veronica, Nick en LJ nog steeds voor leven.\n\n\nDvd 4\n\n\nAflevering 13\nEND OF THE TUNNEL\n\nEnkele uren voor Lincolns executie begint het team aan hun wanhopige en stoutmoedige ontsnappingspoging.\nBuiten de gevangenis keren de gefrustreerde samenzweerders zich tegen elkaar.\n\nAflevering 14\nTHE RAT\n\nNa de mislukte ontsnappingspoging stelt Michael alles in het werk om Lincolns executie uit te stellen.\nOndertussen vraagt Sara haar vader, de gouveneur, om Lincolns gratie te verlenen.\n\nAflevering 15\nBY THE SKIN &amp; THE TEETH\n\nLincolns executie wordt uitgesteld door een telefoontje van de rechter. Lincoln denkt zijn vader te hebben gezien tijdens de geplande executie.\nMichael werkt aan een nieuw ontsnappingsplan. Veronica laat een lijk opgraven in de hoop meer bewijs voor Lincolns onschuld te vinden.\n\nAflevering 16\nBROTHER&amp;#039;S KEEPER\n\nUit een reeks flashbacks blijkt de oorsprong van Michaels ontsnappingsplan en hoe elk van de andere mannen in de gevangenis terecht is gekomen.\n\n\nDvd 5\n\n\nAflevering 17\nJ-CAT\n\nMichael wordt in een isoleercel geplaatst. Nu is het aan Sucre om de tunnel onder de pauzekamer van de bewakers te verbergen voordat die ontdekt wordt.\n\nAflevering 18\nBLUFF\n\nMichael vraagt om haywire&amp;#039;s hulp, zodat hij zich het ontbrekende stukje van de blauwdruktatoeage kan herinneren.\nT-Bag en C-Note moeten samenwerken om een belangrijk pokerspel te winnen.\n\nAflevering 19\nTHE KEY\n\nEr verschijnt een persoon uit Lincolns verleden die verklaart waarom hij in de val is gelokt.\nAls Abruzzi terugkeert naar de gevangenis, wordt T-Bag zenuwachtig.\n\nAflevering 20\nTONIGHT\n\nNu Bellick is vastgebonden en gekneveld, raakt het ontsnappingsplan in een stroomversnelling. Sara is geschokt als Michael zijn geheim aan haar verteld.\n\n\nDvd 6\n\n\nAflevering 21\nGO\n\nDe gevangenen proberen te ontsnappen via de psychiatrische afdeling. Nick zet Veronica op het verkeerde been in de hoop zijn vader te kunnen redden.\n\nAflevering 22\nFLIGHT\n\nDe gevangenen hebben het veilig over de muur gered, maar nu begint er een dodelijke klopjacht.","torrent":{"xt":"urn:btih:4b0b15c2ad0e6c7ebff7bc55348880ed59346fe4","amp;dn":"Prison+Break+seizoen+1+%28dutch+sub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0b15c2ad0e6c7ebff7bc55348880ed59346fe4","infoHashBuffer":{"type":"Buffer","data":[75,11,21,194,173,14,108,126,191,247,188,85,52,136,128,237,89,52,111,228]},"announce":[],"urlList":[]}}