{"title":"Cosmogonia[Into.the.Abyss]","uid":3860697,"size":113676371,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b0febe9c86065c023e1569db38c3c7d1ff4d9a5&amp;dn=Cosmogonia%5BInto.the.Abyss%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uncommon.muse","files":15,"time":1193472980,"description":"Enjoy and Seed, Seed, Seed.\t\nfrom curiousinnuendo\n\n\nCOSMOGONIA BY INTO THE ABYSS;\nLABEL: ALICE IN WONDERLAND; \nA MULTIFACETED DREAMY WORK, POWERFUL AND SENSITIVE. DARK WAVE\n\n\nINTO THE ABYSS are one of the most wellknown underground Psychedelic Rock acts of the 90&amp;#039;s. Their unique sound has established them as one of the most innovative new guitar oriented bands.\nWithin the private chambers of the soul...\n\n      Exploring new fields. Invoking the spirits to weave bridges between all elements so that the listener, free from all thoughts, can wander through the labyrinthine oceans of the psyche, carried off by a psychedelic soundscape in a world full of revelations and visions. Possessing the power of expressiveness, fearless of treading new paths, experimenting, ever risking. Thus clad, INTO THE ABYSS have been playing a prominent part within the Alternative Underground music.\n\n    * The alchemy lies in various patterns: driving rhythms, surging guitar sounds, analogue synths, unusual samples, groovy loops, thrilling violin passages and last but not least the turbulent voice of Jannis Kalifatidis.\n\n      Especially on their third album &quot;COSMOGONIA&quot; the band prove themselves more dynamic and psychedelic than ever: The seeming opposites of wah wah guitars and ambient elements are part of INTO THE ABYSS just like the natural phenomenon of light and darkness. The band offers a danceable and hallucinogenic dose of music drifting into new worlds of sound.\n    * The broad musical spectre of the musicians is effectively displayed within the splendid arrangements, revealing influences ranging from Psychedelic Rock to the tradition of the Near and Middle East, with instruments such as oud and ney. At the same time the lyrics reinforce the whole with poetically powerful pictures, which are influenced by Literature and Ancient Mythology, but most of all express the band&amp;#039;s philosophy of life.\n\nFOR MORE INFO ABOUT &quot;COSMOGONIA&quot; AND HISTORY OF INTO THE ABYSS VISIT http://comig.net/abyss/history.htm\n","torrent":{"xt":"urn:btih:4b0febe9c86065c023e1569db38c3c7d1ff4d9a5","amp;dn":"Cosmogonia%5BInto.the.Abyss%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0febe9c86065c023e1569db38c3c7d1ff4d9a5","infoHashBuffer":{"type":"Buffer","data":[75,15,235,233,200,96,101,192,35,225,86,157,179,140,60,125,31,244,217,165]},"announce":[],"urlList":[]}}