{"title":"the great raid","uid":3952617,"size":910410425,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b53e40ef5c7f9831178b864e63345a5ee30aa6e&amp;dn=the+great+raid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hater-hater","files":11,"time":1198945501,"description":"Synopsis\n\nBefore General Douglas MacArthur could fulfill his stirring promise of &quot;I shall return&quot; and re-take the Philippines from Japanese control, a remarkable rescue mission would have to take place. Captured American soldiers had been held at the notorious Cabanatuan prison camp for more than 33 months. Emaciated and ill from brutal mistreatment, a mere 511 POWs remained from the 25,000-strong force that MacArthur had been ordered to abandon on February 23, 1942.\n\nOn the morning of January 28, 1945, a small band of Army Rangers set out on an audacious and daring rescue effort: to penetrate 30 miles into Japanese controlled territory, storm the camp, and escape with the POWs, carrying them if necessary.\n\nWilliam B. Breuer recounts in searing, meticulous detail-based largely on interviews with survivors-the hellish battles of Bataan and Corregidor; the horrors of the Bataan death march; and the harrowing efforts of guerilla fighters. A classic of its kind, The Great Raid tells the full story of this episode with a breadth and depth of detail that goes far beyond other accounts-including Hampton Sides&amp;#039;s best-selling Ghost Soldiers. The Great Raid is a thrilling true-life adventure story and an inspiring testament o American heroism and grit. And as retired four-star General Barry McCaffrey asserts in his introduction, The Great Raid is an &quot;important book for our current military and political leaders to read.&quot;\nMore Reviews and Recommendations\nBiography\n\nWilliam B. Breuer is the acclaimed and award-winning author of thirty-four books, focusing on World War II, the CIA, and the FBI, as well as the Korean War. Fourteen of his books have been selections of the Military Book Club. He lives in Cleveland, Tennessee.\n\nGeneral Barry McCaffrey as a combat officer has twice received the Distinguished Service Cross and has been awarded three Purple Heart medals. A retired four-star general, he has served as director of the White House Office of National Drug Control Policy and is now a national security analyst for NBC News. ","torrent":{"xt":"urn:btih:4b53e40ef5c7f9831178b864e63345a5ee30aa6e","amp;dn":"the+great+raid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b53e40ef5c7f9831178b864e63345a5ee30aa6e","infoHashBuffer":{"type":"Buffer","data":[75,83,228,14,245,199,249,131,17,120,184,100,230,51,69,165,238,48,170,110]},"announce":[],"urlList":[]}}