{"title":"Adobe Flex Builder 2.0.1.55577","uid":3595768,"size":176983076,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d56a529b3e7bf9c85486045e1e2808f9b98d487&amp;dn=Adobe+Flex+Builder+2.0.1.55577&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xenn00","files":2,"time":1168769756,"description":"Adobe Flex Builder 2.0.1.55577\n\nAdobeÂ® Flex? 2 revolutionizes the way people interact with the web Adobe Flex 2 is the most complete, powerful application development solution for creating and delivering cross-platform rich Internet applications (RIAs) within the enterprise and across the web. It enables the creation of expressive and interactive web applications that can reach virtually anyone on any platform. Enterprises can use Flex to quickly build and deploy applications that improve the user experience, boost the bottom line, and analyze data to enable better business decisions.\n\nAdobeÂ® Flex? Builder? 2 is an Eclipse? based IDE for developing rich Internet applications (RIAs) with the Adobe Flex framework. Using Flex Builder 2, developers can quickly build and deploy applications that are expressive, intuitive, and rich in interactivity. Flex Builder 2 is a productive development environment that makes it easy for developers to customize their applications to match the desired look and feel. \nThe addition of Adobe Flex Charting 2 lets developers easily add insightful and dynamic charts or graphs to any Flex application for rich, interactive data visualization. Just drag and drop chart types into the applications, link them to a data source, and charting components are dynamically rendered on the client. It&amp;#039;s then easy to add drill-down actions, rollovers, and other interactivity that makes charts even more useful, leading to better business decisions.\n\n= AdobeÂ® Flex? Builder? 2: Key features = \n\nPowerful coding tools\nDevelop rich applications using a powerful Eclipse? based IDE that includes editors for MXML, ActionScript, and CSS, providing syntax coloring, statement completion, code collapse, quick fixes, and more.\n\nIntegrated compiler\nIncrease developer productivity by accelerating the build-debug cycle and providing immediate error reporting using the integrated incremental compiler.\n\nVersion control\nAutomatically keep a local history of every file in a project, making it easy to back out changes and revert to a previous version.\n\nInteractive debugging\nQuickly track down and resolve problems using the integrated debugger to set breakpoints, inspect variables and expressions, change values, and monitor trace messages.\n\nRich visual layout\nAssemble and preview Flex application interfaces in design view using a rich library of built-in or custom components.\n\nStyling and skinning\nCustomize the appearance of an application using CSS and graphical property editors to quickly set the most commonly used properties and preview the results in design view.\n\nRich data visualization\nCreate data dashboards and interactive data analysis by simply dragging and dropping a chart type and linking it to a data source using the Flex Charting library, available as an add-on to Flex Builder 2 or as a standalone product.\n\nRich data access and binding\nInvoke web services or request XML or other data via HTTP using a rich, built-in library of data access services. Take advantage of more advanced data management capabilities, including real-time data streaming, automated data synchronization, and direct access to methods on server-side Java? objects using Flex Data Services 2.\n\n= Flex Data Services 2: Key features = \n\nData synchronization\nRemove the complexity and error potential from the rich-client data synchronization process using a robust, high-performance data synchronization engine between client and server.\n\nData paging\nEasily manage and use large record sets using a built-in, efficient paging engine.\n\nOCC (ODC)\nEliminate interference with application flow caused by temporary network service disconnects using embedded messaging capabilities to ensure reliable delivery of data.\n\nData push\nPush data to thousands of concurrent users without polling, providing up-to-the-second views of critical data such as stock trader applications, live resource monitoring, shop floor automation, and more. \n\nPublish/subscribe messaging\nPublish and subscribe to message topics in real time with the same reliability, scalability, and overall quality of service as traditional thick client applications, enabling the creation of critical, more complex applications such as logistics handling, inventory control, stock trading, and more. \n\nIn-context collaboration\nCreate applications that concurrently share in-context information with other users, enabling new application concepts such as &quot;co-browsing,&quot; which allows users to share experiences and collaborate in real time with other users.\n\n= Flex Charting: Key features = \n\nRich component library\nBuild visually rich applications with a library of interactive charts, including area, bar, bubble, candlestick, column, line, pie, plot, and high-low/open-close.\n\nComplete control\nCustomize applications with total control over colors, fonts, and label styles via CSS.\n\nBuilt-in support for data binding and data access\nFlex Charting is fully integrated with the general infrastructure for effects, styles, data binding, and drag and drop in Adobe Flex, and will work seamlessly with Flex Data Services.\n\nFully documented extensibility API\nCustomize charts with drill-down, rollover, and other interactivity, or use base classes to build entirely new chart types.\n\nHomepage - http://www.adobe.com/products/flex/\n","torrent":{"xt":"urn:btih:4d56a529b3e7bf9c85486045e1e2808f9b98d487","amp;dn":"Adobe+Flex+Builder+2.0.1.55577","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d56a529b3e7bf9c85486045e1e2808f9b98d487","infoHashBuffer":{"type":"Buffer","data":[77,86,165,41,179,231,191,156,133,72,96,69,225,226,128,143,155,152,212,135]},"announce":[],"urlList":[]}}