{"title":"Nekromantik-1987.........FFF","uid":3815122,"size":737807366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50b2ca2726f7a5a5daab50c70b4018fd3e80acc3&amp;dn=Nekromantik-1987.........FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFuckFrank","files":1,"time":1190456853,"description":"IMDB review......\n\n\n&amp;#039;Nekromantik&amp;#039; shows the flavor of a bloodthirsty Luis Bunuel, in a exploring of the most absurd existences of humanity. The loving couple Rob and Betty live together in their apartment, packed with metal wires, Charlie Manson photos and glass jars full of eyeballs and organs! Rob are working at Joe&amp;#039;s Streetcleaning Agency, who deals with plenty of car traffic accidents, and he usually take some body parts home for the collection which they both show a strange obsession to. One day Rob bring home a whole worm eaten corpse! To make the movie more deep, we also see who the poor fella was. They&amp;#039;re both in ecstasy, and they bring it to their bed and have sex with it! People can take it for what they like. Some people might get turned on by it, but I don&amp;#039;t think that was the intention. It rather seems to portrait the relationship between two people linked by their necrophiliac needs. It is a beautifully, yet ugly story. Since the relationships happens to escalate, and Betty walks out on Rob together with their &quot;friend&quot;. Rob slowly fall into madness, in scenes that resemble an insane mix of &amp;#039;Tetsue&amp;#039; and &amp;#039;Repulsion&amp;#039;, when he get the self-awareness that he&amp;#039;s addicted to ever-escalating sexual excitement. Don&amp;#039;t start to slag on the actors! Daktari Lorenz and Beatrice Manowski are both very believable and convincing, and show a great chemistry. Manowski gets some extra point, for making her way with the corpse look highly erotic in a very weird way. The music is stunningly beautiful by the way. &amp;#039;Nekromantik&amp;#039; is hypnotic ultra-realism that wades through every manner of depravity. Not for the squeamish, but beyond anything released for the Blockbuster crowd. Recommended. \n\nlater/FFF","torrent":{"xt":"urn:btih:50b2ca2726f7a5a5daab50c70b4018fd3e80acc3","amp;dn":"Nekromantik-1987.........FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50b2ca2726f7a5a5daab50c70b4018fd3e80acc3","infoHashBuffer":{"type":"Buffer","data":[80,178,202,39,38,247,165,165,218,171,80,199,11,64,24,253,62,128,172,195]},"announce":[],"urlList":[]}}