{"title":"Pirates of the Caribbean: At World's End","uid":3948652,"size":2103493517,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50bd262dd033bf3cb3b381171f2ba0fbbc68e01b&amp;dn=Pirates+of+the+Caribbean%3A+At+World%5C%27s+End&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ssj2_goha","files":1,"time":1198694171,"description":"After Elizabeth, Will, and Captain Barbossa rescue Captain Jack Sparrow from the the land of the dead, they must face their foes, Davy Jones and Lord Cutler Beckett. Beckett, now with control of Jones&amp;#039; heart, forms a dark alliance with him in order to rule the seas and wipe out the last of the Pirates. Now, Jack, Barbossa, Will, Elizabeth, Tia Dalma, and crew must call the Pirate Lords from the four corners of the globe, including the infamous Sao Feng, to gathering. The Pirate Lords want to release the goddess Calypso, Davy Jones&amp;#039;s damned lover, from the trap they sent her to out of fear, in which the Pirate Lords must combine the 9 pieces that bound her by ritual to undo it and release her in hopes that she will help them fight. With this, all pirates will stand together and will make their final stand for freedom against Beckett, Jones, Norrington, the Flying Dutchman, and the entire East India Trading Company\n\nAppleTV and iTunes playable, NOT iPod. Artwork, Tagged, and Chapters","torrent":{"xt":"urn:btih:50bd262dd033bf3cb3b381171f2ba0fbbc68e01b","amp;dn":"Pirates+of+the+Caribbean%3A+At+World%5C%27s+End","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50bd262dd033bf3cb3b381171f2ba0fbbc68e01b","infoHashBuffer":{"type":"Buffer","data":[80,189,38,45,208,51,191,60,179,179,129,23,31,43,160,251,188,104,224,27]},"announce":[],"urlList":[]}}