{"title":"Kill.Bill.Vol.1.Japanese.Cut.NTSC.DVDR-NIGHTJAR","uid":3543116,"size":4771658077,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5184422117efe49a327eee9fb698e1bd26b3f35c&amp;dn=Kill.Bill.Vol.1.Japanese.Cut.NTSC.DVDR-NIGHTJAR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cantak","files":98,"time":1161395552,"description":"--&gt; NIGHTJAR PRESENTS &lt;--\n\n\nKill Bill: Vol. 1 Japanese Cut (2003)\n\nRelease Info \n\nRuntime.....: 113 \nGenre.......: Action/Crime/Thriller \nImage.......: .iso \n \n[x] Widescreen (16:9) \n[x] English DTS \n[x] English DD 5.1\n[x] NTSC\n[x] Menus\n\nSubtitles \n\n[x] English\n\nAs almost everyone must know by now, the version of Kill Bill Vol. 1 released in Japan is slightly \n\ndifferent from the one released in the West. Most famously, part of the fight in the House of Blue Leaves \n\ngoes into black and white in Western prints (in order to circumvent the MPAA?s phobia of excessive amounts \n\nof red blood). While Tarantino has, on several occasions, claimed that the Japanese version, which \n\nfeatures the House of Blue Leaves sequence in full colour as well as various other shots that were deleted \n\nor altered to avoid an NC-17 rating in the Western prints, is not a ?director?s cut? but simply an \n\nalternative version, this would seem to contradict his repeated marketing of the film in Japan as \n\n?full-strength Kill Bill?. Here is a complete list of the differences between the Western and Japanese \n\nversions (stolen shamelessly from IMDB):\n\n- The opening scene between The Bride and Vernita Green has two alternate angles shown when The Bride asks \n\nfor a towel instead of keeping the overhead shot. \n- In the anime sequence, one of Boss Matsumoto\\&amp;#039;s men has his face smashed into a wall twice, rather then \n\njust once. \n- In the anime sequence, when O-Ren Ishii kills Matsumoto and tells him to look at her face, she asks him \n\nto look at more facial features (nose, chin. etc.) to be recognized, and then before pulling the knife \n\nout, there is a close up shot of her moving the knife up his stomach and then finally pulling it out. \n\nThere are a couple of close up shots of Matsumoto\\&amp;#039;s face as he\\&amp;#039;s dying as well that were eliminated from \n\nthe US print and then a pan up shot of Matsumoto\\&amp;#039;s blood covered and disemboweled body. \n- The \\&quot;House of Blue Leaves\\&quot; fight is not only in full color, but features about 9 new shots missing from \n\nthe US print which include:\n\n- A close up of the first female Crazy 88 (Julie Manase) gargling blood after being pinned to a wodden \n\npillar by a sword. This shot, while cut from the US version of Vol 1, showed up in the end credits of the \n\nUS cut of Vol 2. \n- A shot of The Bride stabbing two Crazy 88s at once using her own sword as well as another Crazy 88\\&amp;#039;s \n\nsword. \n- A ten foot high super backflip that The Bride executes before landing back down to pop out one of the \n\nCrazy 88\\&amp;#039;s eyes. This shot appeared in the TV spot teaser, but disappeared soon after. \n- The Bride jabbing a Crazy 88 in the throat with her \\&quot;snake fist\\&quot;, and the partially armless Sofie Fatale \n\ngiving a disgusted reaction. \n- A shot of another female Crazy 88 attacking only to get slashed in the throat and spraying blood \n\neverywhere. \n- The first appearance of the \\&quot;Kid Crazy 88\\&quot; (the one who gets spanked with the sword). In this shot, we \n\nnow find out why he\\&amp;#039;s missing a mask later on. As he\\&amp;#039;s about to attack The Bride, she swipes his mask off. \n\nWe see he\\&amp;#039;s just a kid, and he gives the universal \\&quot;don\\&amp;#039;t hurt me\\&quot; sign. The Bride has a look of shock on \n\nher face in realizing he\\&amp;#039;s just a kid, so she grabs him, throws him across, knocking 3-4 Crazy 88 into a \n\nblood filled mini pool. This shot of the 3-4 falling, while cut from the US version of Vol 1, also showed \n\nup in the end credits of the US cut of Vol 2. Overall, this \\&quot;mini scene\\&quot; helps establish The Bride\\&amp;#039;s look \n\nof surprise even more when she sees the young Crazy 88 the last time... and his follow up \\&quot;don\\&amp;#039;t hurt me\\&quot; \n\nlook even funnier. \n- A shot of a Crazy 88 getting slashed across the chest and spraying blood all over a wall. \n- When The Bride jumps onto the shoulders of one of the Crazy 88, after she slashes another one across the \n\nface, the Crazy 88 she\\&amp;#039;s standing on tries to attack her from below. She parries the attack and cuts his \n\nhands off. The shot then cuts to the forward sommersault. \n- Since the fight is already in color, the close up \\&quot;eye shot\\&quot; of The Bride blinking is cut. Instead, the \n\nfirst part of the close up before she blinks is shown, however, at the point when she normally blinks, \n\nthere is a replacement medium shot of her standing slightly fatigued and holding her sword out.\n\n- Finally, after the \\&quot;House of Blue Leaves\\&quot; fight, is the most infamous of the missing scenes and that is \n\nSofie Fatale\\&amp;#039;s extended \\&quot;trunk interrogation\\&quot; scene. After The Bride warns Sofie about cutting off \n\nsomething, instead of cutting back to Sofie in the hospital, The Bride is shown grabbing Sofie\\&amp;#039;s arm and \n\nscreams \\&quot;GIVE ME YOUR OTHER ARM!\\&quot;. Sofie starts to panic, but then The Bride chops off her other arm, \n\ncausing blood to splash onto the screen and Sofie begins screaming again.\n\nAlso, the Japanese cut replaces the ?Old Klingon Proverb? at the beginning of the film with a dedication \n\nto filmmaker Kinji Fukasaku.\n\n\nCast Of Characters :\nUma Thurman ....The Bride \nLucy Liu ....O-Ren Ishii \nVivica A. Fox ....Vernita Green \nDaryl Hannah ....Elle Driver \nDavid Carradine ....Bill \nMichael Madsen ....Budd \nJulie Dreyfus ....Sofie Fatale \nChiaki Kuriyama ....Go Go Yubari \nSonny Chiba ....Hattori Hanzo \nChia Hui Liu ....Johnny Mo (as Gordon Liu) \nMichael Parks ....Sheriff Earl McGraw \nMichael Bowen ....Buck \nJun Kunimura ....Boss Tanaka \nKenji Ohba ....Sushi Bar Assistant \nKenji Ora ....Bald Guy (Sushi Shop)","torrent":{"xt":"urn:btih:5184422117efe49a327eee9fb698e1bd26b3f35c","amp;dn":"Kill.Bill.Vol.1.Japanese.Cut.NTSC.DVDR-NIGHTJAR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5184422117efe49a327eee9fb698e1bd26b3f35c","infoHashBuffer":{"type":"Buffer","data":[81,132,66,33,23,239,228,154,50,126,238,159,182,152,225,189,38,179,243,92]},"announce":[],"urlList":[]}}