{"title":"River Past Products Pack 2008 (The Joker)","uid":3962427,"size":125342626,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52571d0b56e5b9c22a3950cee6ebca7bedbb744f&amp;dn=River+Past+Products+Pack+2008+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":35,"time":1199538389,"description":"River Past Products Pack 2008\n\nRiver Past Develops easy-to-use audio and video recording, conversion and editing software for home and small business markets.\nI -- N -- C -- L -- U -- D -- E\n\n\n\n-= Video Software =-\nStereoPic v3.6.4\nVideo Cleaner Pro v7.6.4\nVideo Perspective v7.6.4\nVideo Slice v5.6.4\nCam 3D Webmaster Edition v3.6.4\nCam Do Webmaster Edition v3.6.4\nCrazi Video Pro v2.6.4\nDirectShow Detective v1.6.4\nDVD QuickRip v1.6.4\nPlayDV v5.6.4\nScreen Recorder Pro v7.6.4\n-= Audio Software =-\nAudio Capture v7.6.4\nAudio CD Ripper v6.6.4\nAudio Converter Pro v7.6.4\nShadowTunes v1.6.4\nTalkative v5.6.4\nWave@MP3 v3.6.4\n-= Booster Packs =-\n3GP Booster Pack v2.6.4\nAnimiated GIF Booster Pack v2.6.4\nImage Sequence Booster Pack v2.6.4\nMOV Booster Pack v3.6.4\nMPEG-2 Booster Pack v1.6.4\nMPEG-4 Booster Pack v2.6.4\nRealMedia Booster Pack v2.6.4\n\n\n\n\n-- River Past 3GP Booster\nRiver past 3GP Booster Pack is an add-on pack, which adds the ability to output 3GP video files to certain River Past and HeavyMath video software.\n\n-- River Past Audio Capture\nEasy-to-use and fast audio recording software. Record audio from sound card and output to MP3, WMA, WAV, AVI, or OGG Vorbis format. Full control over audio codec, sample rate, channel, bits per sample, and bitrate.\n\n-- River Past Audio CD Ripper\nEasy-to-use and fast batch audio extraction from CD-DA. Rip audio from audio CD, to MP3, WMA, WAV, AVI, or OGG. Full control over codec, sample rate, channel, bits per sample, and bitrate for WAV/MP3/AVI/OGG, or choose from a list profiles for WMA. \n\n-- River Past Audio Converter\nBatch convert/extract audio from AC-3, AIFF/AIFC, AU, MP3, MPA, OGG, SD2, SND, WAV, WMA, 3GPP/3GPP2, AVI, DAT, DivX, DV, IVF, MKV, QuickTime MOV, MP4, MPEG-1, MPEG-2, OGM, RA, RAM, RM, VOB, WMV, XviD, VCD, DVD, to MP3, WMA, WAV, OGG. \n\n-- HeavyMath Cam 3D\nHeavyMath Cam 3D makes 3D easy. Instead of recording two videos, capturing each to individual files and process them, live video from two webcams are processed and merged into an anaglyph stereo video in real time. You can preview the 3D effect and make adjustments instead of depending on the guesswork.\n\n-- River Past Cam Do\nView and record from webcam to AVI, WMV, DivX, XviD, MKV or OGM.\n\n-- River Past Crazi Video\nRiver Past Crazi Video is River Past&amp;#039;s solution to convert your video collection for your mobile devices.\n\n-- River Past DirectShow Detective\nDirectShow Detective helps you to verify your DirectShow installation.\n\n-- River Past DVD QuickRip\nRiver Past DVD QuickRip helps you to rip your DVD-Video disc to individual VOB files based on chapters in your computer.\n\n-- River Past GIF Booster\nRiver past Animated GIF Booster Pack is an add-on pack, which adds the ability to output Animated GIF and FLC files to certain River Past and HeavyMath video software.\n\n-- River Past Images Booster\nRiver past Image Sequence Booster Pack is an add-on pack, which adds the ability to output image (BMP, GIF, and JPG) files to certain River Past and HeavyMath video software.\n\n-- River Past MOV Booster\nRiver past MOV Booster Pack is an add-on pack, which adds the ability to output QuickTime MOV files to certain River Past and HeavyMath video software.\n\n-- River Past MPEG-2 Booster\nMPEG-2 Booster Pack enables River Past and HeavyMath video software to encode MPEG-1 and MPEG-2 video, and enables River Past audio software to encode MPEG Audio Layer-2.\n\n-- River Past MPEG-4 Booster\nRiver past MPEG-4 Booster Pack is an add-on pack, which adds the ability to output MPEG-4 video and audio files to certain River Past and HeavyMath video software.\n\n-- River Past PlayDV\nDV camcorder playback software. Resizable playback window with full control over the camcorder, including play, pause, stop, rewind, fast forward, step backward, and step forward. Support hot plug.\n\n-- River Past RealMedia Booster\nRiver past RealMedia Booster Pack is an add-on pack, which adds the ability to output RealMedia video and RealAudio audio files to certain River Past and HeavyMath software.\n\n-- River Past Screen Recorder\nFast screen recording software. Capture full screen, window, or region to AVI files, with choices of video codec. Option to capture audio from varies sources, including microphone or speakers. Full control over the codec settings.\n\n-- River Past ShadowTunes\nUse iTunes, sync to everything. Do you have an iPod? Do you use iTunes? You are not alone. Over 100 million iPod users use iTunes to manage their video and audio media files. It is a good media manager. However, iPod is not the only device you use. You have cell phones, and probably not iPhones, and most of the newer cell phones can play video and audio. You may have some other portable players, like Archos or Sansa. So, you have a problem managing your media library. Yes, you can get all of them into iTunes with some good conversion software, and for that purpose, we would like to recommend our Crazi Video. However, you probably don&amp;#039;t want to maintain multiple media libraries, each for a different cell phone or portable player model. This is why we made ShadowTunes. Use iTunes, sync to everything. You select which iTunes playlist you want to sync, and click the &quot;Sync&quot; button. All we require is that you have the device connected to the PC as an USB storage device. We copy the files if the file format is compatible, or convert it if necessary. We place the files in their correct location. Everything is done automatically. Right now, it supports Blackberry Pearl 8100 series, 8300 series, 8800 series, Sony Ericsson Walkman W200, W300, W550, W580, W600, W610, W660, W800, W810, W830, W850, W880, W900, W910, W950, W960, Sandisk Sansa E250, E260, E280 and Sansa View, and Archos players. Additional devices will be added as free minor upgrades. Note, we don&amp;#039;t sync DRM protected audio and video files - the ones you purchased on iTunes. No adware or spyware. Compatible with Windows Vista. \n\n-- HeavyMath StereoPic\nHeavyMath StereoPic is the easiest and cheapest way to take anaglyph stereo pictures.\n\n-- River Past Talkative\nEasy-to-use and fast text-to-speech. Read text to speakers or encoder to MP3, WMA, WAV or OGG Vorbi. Full control over voice, speaking speed, volume audio codec, sample rate, channel, and bitrate. Fast and Reliable with a simple text editor interface.\n\n-- River Past Video Cleaner\nEasy-to-use and fast video converter software. Convert from 3GPP/3GPP2, ASF, AVI, DAT, DivX, DV, FLC/FLI animation, animated GIF, IVF, Matroska MKV, MOV, MP4, MPEG-1, OGG Media OGM, RM/RAM and WMV to AVI and WMV, DivX, XviD, DV, MKV or OGM. \n\n-- River Past Video Perspective\nAdjust video aspect ratio with Letter Box (black strips are added) or Pan &amp; Scan (the original video is slided). Converts from 3GPP/3GPP2, ASF, AVI, VCD DAT, DivX, DV, MKV, MOV, MP4,MPEG-1, OGM, RM/RMA, WMV, and Xvid to AVI, WMV, DivX, XviD, or DV. \n\n-- River Past Video Slice\nTrim or split videos from 3GPP/3GPP2, ASF, AVI, DAT, DivX, DV, MOV, MP4, MPEG-1, RM/RAM, WMV, and Xvid to AVI, WMV, DivX, XviD, or DV. Frame accurate. Preview video to set the exact frame. Easy to use operations to set the trim and split timecode.\n\n-- River Past Wave@MP3\nRiver Past Wave@MP3 is a FREE WAV to MP3, and MP3 to WAV converter. It is extremely easy to use. Select the input file, and click &quot;Convert&quot;, that&amp;#039;s it! Convert your WAVE files to put on your portable MP3 player, or convert your MP3 files for CD.\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:52571d0b56e5b9c22a3950cee6ebca7bedbb744f","amp;dn":"River+Past+Products+Pack+2008+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52571d0b56e5b9c22a3950cee6ebca7bedbb744f","infoHashBuffer":{"type":"Buffer","data":[82,87,29,11,86,229,185,194,42,57,80,206,230,235,202,123,237,187,116,79]},"announce":[],"urlList":[]}}