{"title":"Panda Antivirus+Firewall 2007 [ Maximum protection against virus","uid":3568289,"size":24665492,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52bc38ab45b1c2e19c6089334c22876ba024fcf5&amp;dn=Panda+Antivirus%2BFirewall+2007+%5B+Maximum+protection+against+virus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MailBeta","files":2,"time":1164936110,"description":"USE THE USERNAME AND PROVIDED PASSWORD TO GET THE UPDATES\n\nNew Titanium - Maximum protection against viruses, spyware and hackers\n\nThe new Panda Antivirus + Firewall 2007 is much more than an antivirus. This solution will turn your PC into a fortress against hacker attacks and keep you safe from all types of viruses, spyware and online fraud.\n\nAlso includes:\n\n- Panda Antivirus \n- Panda AntiSpyware \n- Panda Firewall \n- Panda TruPrevent \n\n\nMaximum protection against viruses, spyware and hackers\n\n\n Latest generation antivirus \n\nAutomatically detects and eliminates all types of viruses, worms and Trojans\nNo doubt you keep photos, documents, games and other files on your PC. Panda Antivirus+Firewall 2007 protects them automatically from all types of viruses, worms and Trojans. Forget about infections!.\n\n\n Personal firewall \n\nBlocks hackers and intruders\nEnjoy the Internet without the worry of hackers and intruders infiltrating your computer. Panda Antivirus+Firewall 2007 blocks them before they can enter, turning your computer into a fortress.\n\n\n Award-winning AntiSpyware \n\nKeeps your Internet activity private\nIs your PC slower than usual? Do pop-up ads appear for no apparent reason? This could be caused by spyware. With Panda Antivirus+Firewall 2007 detects and eliminates spyware other solutions often miss, so you&amp;#039;ll be able to use the Internet without anyone snooping on you..\n\n\n\n Online fraud protection \n\nBank and shop online with complete peace of mind\nPanda Antivirus+Firewall 2007 fights new scams designed to steal your login details, account numbers and other personal information.\n\n\n Automatic daily updates \n\nThe product is automatically updated, at least once a day, to protect you against viruses, spyware and other threats. \n\n\n Tech Support 24 hours a day - 365 days a year* \n\nAny time of the day or night, 365 days a year, our technicians will answer your inquiries and resolve problems over the phone or by email. Our Antivirus Laboratory will respond as quickly as possible whenever you need our help. And thanks to our International Alert Network, you will immediately be protected against new threats. \n\n\n Installation requirements: \n\nProcessor: Pentium 150 MHz or faster\nRAM: 96 MB (256MB recommended)\nHard disk: 160 MB free space\nOperating system: Windows XP, Windows 2000 Pro, Windows Me, Windows 98\nInternet Explorer 5.01\nCD-ROM drive. \n\n\n","torrent":{"xt":"urn:btih:52bc38ab45b1c2e19c6089334c22876ba024fcf5","amp;dn":"Panda+Antivirus%2BFirewall+2007+%5B+Maximum+protection+against+virus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52bc38ab45b1c2e19c6089334c22876ba024fcf5","infoHashBuffer":{"type":"Buffer","data":[82,188,56,171,69,177,194,225,156,96,137,51,76,34,135,107,160,36,252,245]},"announce":[],"urlList":[]}}