{"title":"Tool For Cleaning Virus Burst Malware Infection","uid":3568520,"size":1740078,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53063842e85cdf76ab4fe6c0403aaa0be96187d3&amp;dn=Tool+For+Cleaning+Virus+Burst+Malware+Infection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UptownDave","files":12,"time":1164933834,"description":"This is a free tool that could have been downloaded directly from its website (and you&amp;#039;re still welcome to do so). But I&amp;#039;m seeding it here, so everyone can find it if needed. After all, when you&amp;#039;re leeching warez, you do run a greater chance of being infected by viruses, worms, malware, etc. My PC picked up the Virus Burst infection tonight,and went nuts. Even the most popular adware and anti-virus programs couldn&amp;#039;t find it, let alone get rid of it.\n\n\n-----------\n\nFrom the SmitFraudFix website...\n\n\nWhat is Virus Burst?\n\nVirusBurst, also known as VirusRescue and SpywareQuake, is another malicious rogue anti-spyware program that looks like a legitimate application for removal of spyware, but it installs a trojan in an attempt to trick you into buying the software. Once VirusBurst Trojan installs on your PC, it sends fake security messages stating that the PC is infected with spyware in order to trick you into buying the VirusBurst full version.\n\nThe VirusBurst shows the following fake security message: &quot;System detected virus activities. They may cause critical system failure. Please, use antimalware software to clean and protect your system from parasite programs. Click this ballon to get all available software.&quot;\n\n-----------\n\n\nComplete and easy instructions on using this tool are included in the Documentation file (included).","torrent":{"xt":"urn:btih:53063842e85cdf76ab4fe6c0403aaa0be96187d3","amp;dn":"Tool+For+Cleaning+Virus+Burst+Malware+Infection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53063842e85cdf76ab4fe6c0403aaa0be96187d3","infoHashBuffer":{"type":"Buffer","data":[83,6,56,66,232,92,223,118,171,79,230,192,64,58,170,11,233,97,135,211]},"announce":[],"urlList":[]}}