{"title":"Slavi`s Show 28.5.2007 Confession of Slavi","uid":3699776,"size":1090932208,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5308ad0049701c431696453318cc16f248c116bf&amp;dn=Slavi%60s+Show+28.5.2007+Confession+of+Slavi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"joredos","files":1,"time":1180393902,"description":"Slavi Trifonov`s Show is a daily sixty minute evening talk show broadcast from Monday to Friday from 22:30h 23:30h on the first private nationwide TV in Bulgaria - bTV. Although it is an external production it turned into the media emblem and basis upon which it started to build its image and prestige.\nOnly for one year the Show broke the stereotype that one broadcast can become popular only in the prime time. What is more, it extended bTV`s prime time until 23:30h and reached a rating higher than the traditionally most watched news broadcasting on the state television BNT at 20:00h. In a small country like Bulgaria with a population of 8 million people, Slavi Trifonov&amp;#039;s Show gathers every evening in front of the TV screen among two and three million viewers. As a result, the Show turned into a point of attraction for the advertisers in Bulgaria and reached advertising revenues for the media higher than those of the Champion&amp;#039;s League.\nSlavi`s Show is unique for its form in Eastern Europe because of its homogeneous form, its mixture of political cabaret and talk-show, virtuosity of live musical performances and up-to-date ballet.\nThe main genre characteristics of the show are the comments of the entertainer on current daily issues, their live musical and playful interpretation between the entertainer and Cuckoo Band, as well as the viewpoint of the special guests on the issues. The expectations towards live meetings with the characters of the show are huge which has been proven by the huge interest to the shows broadcast from outside Sofia.\nFrom a purely psychological and marketing point of view the character of Slavi Trifonov has developed and reached a popularity which according to sociological polls puts him next to Simeon Saxe Coburg-Gotha, the presidents Purvanov and Stoyanov, the footballer Hristo Stoichkov. During preelection polls Slavi Trifonov&amp;#039;s Show and Slavi himself were placed among the first three people enjoying the highest public trust. Slavi Trifonov was pointed out among those enjoying the highest confidence of the population in spite of the political or apolitical nature of the messages.\nThe specially designed video materials are additional accents and emotional and conceptual assets, contrasting the live performance in the Show\n\nFormat               : AVI\nFormat/Info          : Audio Video Interleave\nFormat/Family        : RIFF\nFile size            : 1.02 GiB\nPlayTime             : 1h 1mn\nBit rate             : 2372 Kbps\nMovie name           : Shouto na Slavi-Slavi izpoved 2\nDirector             : Ripped by Joredos\nGenre                : Show\nCopyright            : 2007\n\nVideo #0\nCodec                : DivX 5\nCodec/Family         : MPEG-4\nCodec settings/Packe : No\nCodec settings/BVOP  : No\nCodec settings/QPel  : No\nCodec settings/GMC   : 0\nCodec settings/Matri : Default\nPlayTime             : 1h 1mn\nBit rate             : 2135 Kbps\nWidth                : 720 pixels\nHeight               : 576 pixels\nAspect ratio         : 5/4\nFrame rate           : 25.000 fps\nStandard             : PAL\nResolution           : 8 bits\nInterlacement        : Progressive\nBits/(Pixel*Frame)   : 0.206\n\nAudio #0\nCodec                : MPEG-1 Audio layer 2\nPlayTime             : 1h 1mn\nBit rate             : 224 Kbps\nBit rate mode        : CBR\nChannel(s)           : 2 channels\nSampling rate        : 48 KHz\nResolution           : 16 bits\nLanguage             : Bulgarian","torrent":{"xt":"urn:btih:5308ad0049701c431696453318cc16f248c116bf","amp;dn":"Slavi%60s+Show+28.5.2007+Confession+of+Slavi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5308ad0049701c431696453318cc16f248c116bf","infoHashBuffer":{"type":"Buffer","data":[83,8,173,0,73,112,28,67,22,150,69,51,24,204,22,242,72,193,22,191]},"announce":[],"urlList":[]}}