{"title":"Sugartooth - Sugartooth &amp; The Sounds of Solid","uid":3948538,"size":91722546,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:53f7debafc677c2ac302201e83b78ea8b44cd5a9&amp;dn=Sugartooth+-+Sugartooth+%26+The+Sounds+of+Solid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"adickenson","files":25,"time":1198688301,"description":"Sugartooth appeared in the early 1990s, modeling themselves after Soundgarden. Marc Hutner (vocals, guitar) and Josh Blum (bass) formed the group after meeting each other on the California band circuit (while each fronting separate groups). They worked with two different drummers over time (Joey Castillo and Dusty Watson). The explosive success of Alternative/Grunge music and the growing appearance of bands like Candlebox prompted record companies to sign a large number of new bands as they came along; Sugartooth as a result quickly signed a contract with David Geffen, and the band\\&amp;#039;s self-titled debut was released in 1994. The song Sold My Fortune became a modest hit after appearing on an episode of Beavis and Butthead and the group regularly opened shows for Slayer, Supersuckers, Stone Temple Pilots, and Soundgarden.\n\nCastillo left the band before recording sessions began for the band\\&amp;#039;s followup album. Rather than find a new drummer, Hutner and Blum decided to use a drum machine and hired the Dust Brothers to produce the album. During recording, Sugartooth contributed the music to a song called Tortured Man that the Dust Brothers were putting together for the soundtrack to the film Private Parts. This song would later feature vocals by Howard Stern.\n\nAfter the commercial failure of their 1997 album, the band split up for good.\n\n\nAlbums\nSugartooth (1994) \nThe Sounds of Solid (1997) \nRetrieved from \\&quot;http://en.wikipedia.org/wiki/Sugartooth\\&quot;\n","torrent":{"xt":"urn:btih:53f7debafc677c2ac302201e83b78ea8b44cd5a9","amp;dn":"Sugartooth+-+Sugartooth+%26+The+Sounds+of+Solid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f7debafc677c2ac302201e83b78ea8b44cd5a9","infoHashBuffer":{"type":"Buffer","data":[83,247,222,186,252,103,124,42,195,2,32,30,131,183,142,168,180,76,213,169]},"announce":[],"urlList":[]}}