{"title":"Texas Chainsaw Massacre - The Thomas Hewitt Files.CBB","uid":3953730,"size":743215395,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55d3e880fbca6c81c44ae72943eb07eb54dc929e&amp;dn=Texas+Chainsaw+Massacre+-+The+Thomas+Hewitt+Files.CBB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boon238","files":10,"time":1199023584,"description":"*************************************************************************\n****************FANEDIT.ORG proudly presents***************************\n*************************************************************************\n*****************A fanedit by THE CBB GROUP**************************\n*************************************************************************\n*************************************************************************\n******THE TEXAS CHAINSAW MASSACRE - THE THOMAS HEWITT FILE***************\n*************************************************************************\n\n**************************INTRODUCTION***********************************\nTCM The BEginnign and TCM Remake were not that bad, but no competition to the atmosphere of the 1974 original. But still they gave the audience a more inside look into TCM and that is what brough us to the idea to create a compelte Thomase Hewitt (a.k.a. Leatherface) story by taking scenes from both movies. Since the beginning really sucked, when it came to storytelling about the first hewitt victims, these had to go completely.\n\n***************************THE EDIT**************************************\nIt was very important for us to tell a believable and continous story, so we had to erase anything that didn&amp;#039;t make sense (like the animals in the meat factory in REMAKE, when the same factory was closed for good in THE BEGINNING) for both. It was tough work to get rid of all the animals in REMAKE.\nNext thing was to find out where the movies went over the top with gore or credibility. That is why Uncle Monty wil not loose his legs in our edition. Still the Hewitt&amp;#039;s are cannibals, although there is hardly any mention of that in REMAKE, but it made somehow sense. Oer the top was Erin stabbing Andy, this would never have happened, but we kind of solved this very sufficient. Be surprised.\nFor the tension of the movie we removed the annoying and badly acted JEdidiah (the kid) almost completely from the movie and you can be sure, he won&amp;#039;t be missed. But it sure is a wonderful example of editing, how we removed him from leading our two escapies from the dungeon. Unfortunately there was no room left on the DVD to include this scene as deleted scene.\nOur movie is scare, gory, cruel and very dark, it is not for the faint of heart and we are not sure if this would have gained an R rating in the US.\n***************************AVI RELEASE DETAILS************************************\n98 minutes NTSC 1.85:1 anamorphic widescreen\nLanguages         : ENGLISH\nSubtitles         : ENGLISH\nCover art and info\n\n***********************ABOUT THIS RELEASE********************************\nThis was created from the fanedit DVD available on www.fanedit.org using AutiGK. The quality is definitely lower than the DVD release. If you care for quality and extras, check out, if the DVD is available.\n\n+++++++++++++++++++++++++++ABOUT FANEDITS+++++++++++++++++++++++++++++++++++\nSome of you might think that the universe is solid and nothing can be changed the way nature has made it. Genetics should have proven you wrong already.\nBut still some you believe that a movie, which is not so much of a universe in itself should  not be altered,is supposed to be the way it is. The CBB group disagrees with you in that totally. When a director along with his executive producers and his producers and the many more people having a say in making a movie and being responsible or taking responsiblity for a cut, decide to have a movie this or that way, they have no idea if the outcome is good or will be liked or not. Quality cannot be just created, it is far more than a few good ideas put together. We all have seen great efforts who failed in the end (best example might be Matrix Revolutions). Now are we forced to accept that a movie stays the way it is?\nThe movie stations make their personal cuts, the studios do, the producers do, the directors do and finally we have 10 different versions of the same movie material (e.G.Dawn of the Dead). Is this bad? No. It is very good this way, because the watcher, YOU, can decide, what you like best. And the CBB group thinks that touching movie material, altering it to get a new result, which could be highly enjoyable, not to joke around or make fun, but seriously tell the known story in an unknown way, can be considered  for viewing pleasure and therefore done.\nYou need to own the original DVDs of TEXAS CHAINSAW MASSACRE REMAKE and TEXAS CHAINSAW MASSACRE THE BEGINNING to legally watch this.\n\nFIND OUT MORE ABOUT FANEDITS:\nWWW.FANEDIT.ORG","torrent":{"xt":"urn:btih:55d3e880fbca6c81c44ae72943eb07eb54dc929e","amp;dn":"Texas+Chainsaw+Massacre+-+The+Thomas+Hewitt+Files.CBB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d3e880fbca6c81c44ae72943eb07eb54dc929e","infoHashBuffer":{"type":"Buffer","data":[85,211,232,128,251,202,108,129,196,74,231,41,67,235,7,235,84,220,146,158]},"announce":[],"urlList":[]}}