{"title":"Central Brain Identifier 8.2.1.0","uid":3827710,"size":288981,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56485d021f6a5c011f58dfbb4a6b7cd9e688323e&amp;dn=Central+Brain+Identifier+8.2.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fireme","files":4,"time":1191370146,"description":"The best awarding-winning solution, designed for AMD processor identification. This software recognizes more than 50 various models of the AMD processors and includes over 400 OPN numbers. It reports all the technical information and technical features you need on your processor, such as processor core name, core revision, nominal processor frequency, date of announce, OPN number, etc. Besides, it estimates the QuantiSpeed Rating for processors having a Model Number. Advanced recognition methods can accurately determine mobile, desktop and server parts of AMD processors. Powerful diagnostic capabilities provide the most complete information on processor&amp;#039;s cache memory. Central Brain Identifier is aggressively aimed to compete with well-known processor diagnostic tools. \n\nThe benefits and distinct advantages of CBId are the following: \n\nComplete identification of AMD processors. \nQuantiSpeed Rating calculation and OPN determination. \nReal-time CPU clock frequency, VCore and temperature monitoring. \nEntering the processor the low power state of Stop Grant. \nFID/VID transition for mobile AMD and AMD64 processors on the fly. \nSearch for and interpretation of performance state tables. \nDRAM timing configuration for a huge number of chipsets. \nAbility to change the feature bits of the processor. \nQuick CPU name string modification. \nFSB/DRAM frequency control for nForce2 chipset on the fly. \nAdvanced tuning of VIA V-Link bus speed parameters. \nEnhanced memory tweak set for the nVIdia nForce2 chipset and AMD64 integrated memory controller. \nHyperTransprt multiplier and bus width change. \nMemory frequency change for the AMD64 platform.","torrent":{"xt":"urn:btih:56485d021f6a5c011f58dfbb4a6b7cd9e688323e","amp;dn":"Central+Brain+Identifier+8.2.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56485d021f6a5c011f58dfbb4a6b7cd9e688323e","infoHashBuffer":{"type":"Buffer","data":[86,72,93,2,31,106,92,1,31,88,223,187,74,107,124,217,230,136,50,62]},"announce":[],"urlList":[]}}