{"title":"ENDTIME ARCHEOLOGY","uid":3603185,"size":1185265711,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:567572a0acfedd2fe1a1484e401201ef6e871ba1&amp;dn=ENDTIME+ARCHEOLOGY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"each1reach41","files":3,"time":1169683132,"description":"Michael Rood as he presents Endtimes Archaeology: Israel?s Ancient Title Deed to the Land. Almost 4 hours of information on a Two Tape Video Set! See an actual grinding stone that was left behind at Sinai ? in which the Israelites ground manna to make bread -- and Israeli arrowheads that were found among the thousands which litter the desert of Midian. ?The Rock? at Rephadim ? which split in half at the blow of Moses? staff and still evidences the erosion caused by millions of gallons of water pouring forth to quench the nation of Israel ? as well as the intact remains of the altar to the Golden Calf, will be seen through photos and video with more clarity than previously available. Recent archaeological discoveries at the real Mt. Sinai actually foretell end-time events in the Land of Israel. To understand their significance, you will journey with Michael to Har Karkoum. This mountain on the Egyptian border was one of Israel?s camping locations during their 40 years of wandering in the wilderness. You will examine some of the more than 40,000 petroglyphs which the Israelites chiseled in stone ? some of which were inscribed to mark their territory according to the Almighty?s promise to Abraham, Moses, and Joshua. And that?s not all? You will be on the edge of your seat as you watch underwater robotic-camera footage of the coral encrusted remains of Pharoah?s chariots and army strewn across the underwater land bridge in the Yam Suph (Red Sea) on which they perished. See an ancient Torah scroll rescued from Iraq just before the most recent Gulf War. See the Books of Moses as they were originally penned Â­- on the hides of an entire flock of sheep! Michael will also share his view as to where we are in relation to the Almighty?s time clock and the fulfillment of the Feasts of the LORD. During Michael?s 1999-2000 Prophecy Club tour, he stated that, ?If we have accurately corrected the Biblical Calendar (according to the Creator?s original criterion) we will see violence erupt in Israel on September 28, 2000.? Prophecy students with their eye on Israel recognize that September 28, 2000 was the very day that the current Arab/Palestinian Intifada started. The violence that began on that day has now claimed more than 3,000 lives. Michael will also share how Zechariah?s vision of thermonuclear war fits into this end-time scenario. And, of course, brimstone samples from the ancient city of Gomorrah will be available so you may see, touch and smell the righteous judgment of the Most High! 2 DVD\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s 5 hrs","torrent":{"xt":"urn:btih:567572a0acfedd2fe1a1484e401201ef6e871ba1","amp;dn":"ENDTIME+ARCHEOLOGY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"567572a0acfedd2fe1a1484e401201ef6e871ba1","infoHashBuffer":{"type":"Buffer","data":[86,117,114,160,172,254,221,47,225,161,72,78,64,18,1,239,110,135,27,161]},"announce":[],"urlList":[]}}