{"title":"Seattle Conference 1998 - Richard Hoagland, Tom Van Flandern, To","uid":3540888,"size":373313843,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:56fa62dbd45ab57f0ed4cac30951644848f4984b&amp;dn=Seattle+Conference+1998+-+Richard+Hoagland%2C+Tom+Van+Flandern%2C+To&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"geogaddi00","files":12,"time":1161090184,"description":"Richard Hoagland, Tom Van Flandern &amp; Tom Bearden - Seattle Conference 1998, organized and moderated by Elaine Smitha from \\&amp;#039;Evolving Ideas\\&amp;#039;: http://www.elainesmitha.com/\n\nDuration: 12:57:18\nBit rate: 64kbps 22kHz (six mp3 files)\nSize: 355mb  \n\nRichard C. Hoagland - http://www.enterprisemission.com/\n\nDr. Tom Van Flandern - http://metaresearch.org/\n\nLt. Col. Thomas E. Bearden (ret) - http://www.cheniere.org/\n\n\nSEATTLE CONFERENCE 1998 - historically significant with Angstrom Science Award winner Richard C. Hoagland, physicist Lt. Col. Thomas E. Bearden (ret), former Chief of Celestial Mechanics: US Naval Observatory, astronomer Tom Van Flandern and, moderator, Elaine Smitha - 9 audio tapes (converted to mp3). This nearly 13 hour presentation marks the pivotal historic beginnings of far reaching relationships in science, astronomy and health. Revelations of technological research in electromagnetics and over-unity, antigravitics and the exploded planet theory as relates to mars-earth connections challenge traditional science. Hyperdimensional physics is alive and well in more ways than we can imagine. You will want to listen to these tapes over and over to digest the vast volume of information, too abundant to capture in one sitting.\n\nMore information available here: http://www.enterprisemission.com/hyper1.html\n\n\n** The 1998 Seattle Conference and the audio recordings of the event were made possible by Elaine Smitha ( http://www.elainesmitha.com/ ) who is the host of the important talk-show, Evolving Ideas ( http://www.beyondtheordinary.net/elainesmitha.shtml )\n\nElaine Smitha author of If You Make The Rules, How Come You\\&amp;#039;re Not Boss? Minding Your Body\\&amp;#039;s Business (with foreword by Bruce Lipton). For nearly twenty years, Elaine sponsored a forum for notable speakers to present groundbreaking theories and research to a knowledge-seeking public. In 1992, Elaine created the Evolving Ideas television show as a venue for cutting edge ideas reaching millions of households in the Pacific Northwest, raising awareness and helping people to grow. \n\nElaine spent the last 10 years healing her body and transforming her life, while researching and writing her future bestselling book, inspired by mentor, Bruce H. Lipton, Ph.D. As she began integrating her outer world of materiality with her intuitive nature, Elaine incorporated scientific understanding, especially the new biology in teaching, training and professional speaking. A college instructor, professional speaker, consultant, artist and businesswoman, Smitha has a world of experience upon which to draw. As much an innovator is Elaine\\&amp;#039;s tenacity to exercise principles of self-rule, be it a career, a life-changing transformation, or an issue of health and well-being.\n\n** If you are interested in learning from Elaine Smitha, and want to support \\&amp;#039;Evolving Ideas\\&amp;#039;, you can purchase her books here: http://www.powells.com/search/DTSearch/search?PID=28060&amp;cgi=search/search/&amp;searchtype=kw&amp;searchfor=Smitha+Elaine\n\n|  Archived and seeded by !UtopiAted!Net!   ||    &lt;a href=&quot; http://utopiated.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://utopiated.net&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:56fa62dbd45ab57f0ed4cac30951644848f4984b","amp;dn":"Seattle+Conference+1998+-+Richard+Hoagland%2C+Tom+Van+Flandern%2C+To","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56fa62dbd45ab57f0ed4cac30951644848f4984b","infoHashBuffer":{"type":"Buffer","data":[86,250,98,219,212,90,181,127,14,212,202,195,9,81,100,72,72,244,152,75]},"announce":[],"urlList":[]}}