{"title":"[Kung Fu] Rush Hour 3 (Jackie Chan, 2007) EN - DVD/Rmvb","uid":3839365,"size":353309635,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5757ae03d2845ea194ab26346c873275223716f0&amp;dn=%5BKung+Fu%5D+Rush+Hour+3+%28Jackie+Chan%2C+2007%29+EN+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1192205700,"description":"Rush Hour 3 (Jackie Chan, 2007) EN\n\nStarring   Jackie Chan, Chris Tucker, Max Von Sydow, Roman Polanski, Youki Kudoh, Hiroyuki Sanada \nDirector   Brett Ratner \nComposer   Lalo Schifrin \nDirector of Photography   J. Michael Muro \nExecutive Producer   Tobias Emmerich \nProducer   Jonathan Glickman, Andrew Z. Davis, Jay Stern, Arthur M. Sarkissian, Robert Birnbaum \nScreenwriter   Jeff Nathanson \n\nDescription: In director Brett Ratner&amp;#039;s RUSH HOUR 3, African-American cop James Carter (Chris Tucker) once again reunites with Chinese inspector Lee (Jackie Chan) to both taunt and battle bad guys. Whereas the first movie was on Carter&amp;#039;s turf, and the second was set in Lee&amp;#039;s homeland, this outing finds both Carter and Lee out of their element in Paris, dealing not only with criminals, but also with the quirks of French culture. Along the way, Lee must confront his old friend Kenji (Hiroyuki Sanada) in order to save the day. Fresh off of his highly successful (though critically maligned) &quot;threequel&quot; X-MEN: THE LAST STAND, Ratner tackles the third chapter of his own popular series, which follows the second movie by six years. Once again, Tucker provides the wisecracks, while Chan, who tones down the acrobatics, remains the emotional center of the franchise. Though Sanada (SUNSHINE, RINGU) and Von Sydow (MINORITY REPORT, THE SEVENTH SEAL) add a bit of gravitas to the film, and Polanski amuses with his rare acting appearance, RUSH HOUR 3 isn&amp;#039;t quite as quick on its feet as previous installments, but it still provides plenty of slapstick comedy and relatively light action sequences, making it most readily appealing to teens.\nIn chapter three of the RUSH HOUR series, Chris Tucker and Jackie Chan team up once again for another two hours of nonstop action which takes the stars to Paris, France. Theatrical Release: August 10, 2007\n\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:5757ae03d2845ea194ab26346c873275223716f0","amp;dn":"%5BKung+Fu%5D+Rush+Hour+3+%28Jackie+Chan%2C+2007%29+EN+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5757ae03d2845ea194ab26346c873275223716f0","infoHashBuffer":{"type":"Buffer","data":[87,87,174,3,210,132,94,161,148,171,38,52,108,135,50,117,34,55,22,240]},"announce":[],"urlList":[]}}