{"title":"Shortbus (Screener)","uid":3577087,"size":3542646784,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:596fab0f9fa7cb8c9e1f1b470e75ea87fed6ebe5&amp;dn=Shortbus+%28Screener%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kef71","files":1,"time":1166172207,"description":"User Comment from IMBD: \n\n&quot;Shortbus&quot; is impossible to summarize, and in the future film students will write books about it. it&amp;#039;s hysterically funny, wonderfully smart, and totally endearing.  It&amp;#039;s also been marginalized by an infantile media that refuses to talk about anything other than the guy who can &quot;do&quot; himself. Don&amp;#039;t fall for their bait: this film is brilliant.\n\n&quot;Shortbus&quot; puts sex in perspective -- as a part of all our lives -- and thumbs its nose to the puritanical ratings board and to the puritanical country we live in.  This is a Robert Altmanesque tale of six or seven young New Yorkers, and being honest it follows their (quirky, unflinchingly honest, hysterically funny) sex lives too.  It&amp;#039;s wonderful and refreshing and ground-breaking and the bravest film in years.  It shows America in no uncertain terms that having to cut sex out of movies to make them &quot;safe&quot; also cuts out their . . . well, I&amp;#039;ll say &quot;guts.&quot;\n\nAnyway, run to see it -- in a theater, not on DVD.  It defines our time. I have no connection with the film, didn&amp;#039;t expect to like it, and didn&amp;#039;t like &quot;Hedwig,&quot; so I&amp;#039;m astonished that it&amp;#039;s the best film of the year. It&amp;#039;s funnier than Woody Allen and seriously hits masterpiece at points -- though it&amp;#039;s admittedly a little ragged, unwieldy and low-budget.  Lots of quotable lines, but I&amp;#039;ll give just one that beautifully defines our time:  This guy hosts a salon, and a new girl visits.  In one room there are like thirty people having sex.  &quot;It&amp;#039;s just like the seventies!&quot; the host says brightly.  &quot;Except, without the hope.&quot;\n\nAnd I better put in a warning, all the sex scenes are actually real. You will see gay sex, lesbian sex and straight sex. Ok?\n\nThere are no subtitles, but it is still easy to follow if you know a lil bit English. Sound is DD 2.0. Oh, and it is &quot;Never Twice Same Colour&quot;, also known as NTSC.\n\nOriginally downloaded from http://thepeerhub.com/\n\n/Kef\n\n","torrent":{"xt":"urn:btih:596fab0f9fa7cb8c9e1f1b470e75ea87fed6ebe5","amp;dn":"Shortbus+%28Screener%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596fab0f9fa7cb8c9e1f1b470e75ea87fed6ebe5","infoHashBuffer":{"type":"Buffer","data":[89,111,171,15,159,167,203,140,158,31,27,71,14,117,234,135,254,214,235,229]},"announce":[],"urlList":[]}}