{"title":"24c3-2329-en-change_me.mkv","uid":3953109,"size":105515428,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5afd95997500ecfc83b9f8b3713d74e10eebf9ce&amp;dn=24c3-2329-en-change_me.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"num42","files":1,"time":1198972756,"description":" &lt;a href=&quot; http://events.ccc.de/congress/2007/Fahrplan/events/2329.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://events.ccc.de/congress/2007/Fahrplan/events/2329.en.html&lt;/a&gt;\n\nSpeakers:    \t Drew Endy\n\nProgramming DNA\n\nA 2-bit language for engineering biology\n\nBiological engineering does not have to be confined to the laboratories of high-end industry laboratories. Rather, it is desirable to foster a more open culture of biological technology. This talk is an effort to do so; it aims to equip you with basic practical knowledge of biological engineering.\n\nGenetic engineering is now a thirty year old technology. For reference, over a similar period of time, modern computing machines went from exclusive objects used to design weapons of mass destruction, to the now ubiquitous panoply of personal computing devices that support mass communication and construction. Inspired by this and many other past examples of the overwhelmingly constructive uses of technology by individuals, we have been working over the past five years to develop new tools that will help to make biology easy to engineer. We have also been working to foster a constructive culture of future biological technologists, who can reliably and responsibly conceive, develop, and deliver biological technologies that solve local problems.\n\nThis talk will introduce current best practice in biological engineering, including an overview of how to order synthetic DNA and how to use and contribute standard biological parts to an open source collection of genetic functions. The talk will also discuss issues of human practice, including biological safety, biological security, ownership, sharing, and innovation in biotechnology, community organization, and perception across many different publics. My hope is that the conferees of 24C3 will help me to understand how to best enable an overwhelmingly constructive hacker culture for programming DNA.\n","torrent":{"xt":"urn:btih:5afd95997500ecfc83b9f8b3713d74e10eebf9ce","amp;dn":"24c3-2329-en-change_me.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5afd95997500ecfc83b9f8b3713d74e10eebf9ce","infoHashBuffer":{"type":"Buffer","data":[90,253,149,153,117,0,236,252,131,185,248,179,113,61,116,225,14,235,249,206]},"announce":[],"urlList":[]}}