{"title":"The Twilight Zone Episode 20- Elegy","uid":3844678,"size":242744791,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5bd0ce1d0122755e1fe2ed234848e94b49f2ff0a&amp;dn=The+Twilight+Zone+Episode+20-+Elegy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"antil0ck","files":1,"time":1192564980,"description":"Running out of fuel, astronauts Meyers, Webber, and Kirby land their spaceship on a remote asteroid. They find the place quite Earth-like with buildings and people. The first place they come to is a farm. The astronauts look around, and find no one. No one, that is, until they see the farmer, with his back to them, gazing off into the distance. They approach him, tap him on the shoulder, then they realize he is nothing more than a statue. The men later come across a mayor being elected, surrounded by people and a band playing. They can hear the music playing, but everyone is stock-still. A beauty pageant is where they find themselves next, where there are several beauty queens on the stage, and lots of people in the audience. As they exit that room, the camera stays on someone in the audience, who suddenly moves. They look for some time, and grow more and more disturbed by their surroundings. Finally, they are startled to find that someone who does move: Wickwire, the caretaker of the place. Wickwire explains to the astronauts that the asteroid is an exclusive cemetery founded in 1973 where rich people can realize their greatest wish in life after they die. He is told that an atomic war destroyed much of the earth, and that it has taken over 200 years to recover from it. Wickwire serves the three men wine and asks what their greatest wish is. All three reply that they wish they were on their ship heading for home. Suddenly, they realize that their drinks have been poisoned. As the men die, Wickwire (who is actually a robot that has been off for 200 years and only turns on when he&amp;#039;s needed, such as to dust) apologizes, saying that he needs to ensure the peaceful tranquility of the cemetery because men are incapable of peace. Later, Wickwire installs the embalmed bodies back in their ship, posing them as if they were in fact on their way home. Just as they wished.\n\nMP4 Format for your IPOD\n\nPLEASE SEED! \n\nEnjoy! \n\nAntil0ck\n\n_______       ______________________      ______  \n___    |________  /___(_)__  /_  __ ________  /__\n__  /| |_  __   __/_  /__  /_  / / /  ___/_  //_/\n_  ___ |  / / / /_ _  / _  / / /_/ // /__ _  ,&lt;   \n/_/  |_/_/ /_/__/ /_/  /_/  ____/ ___/ /_/|_| ","torrent":{"xt":"urn:btih:5bd0ce1d0122755e1fe2ed234848e94b49f2ff0a","amp;dn":"The+Twilight+Zone+Episode+20-+Elegy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bd0ce1d0122755e1fe2ed234848e94b49f2ff0a","infoHashBuffer":{"type":"Buffer","data":[91,208,206,29,1,34,117,94,31,226,237,35,72,72,233,75,73,242,255,10]},"announce":[],"urlList":[]}}