{"title":"DJ MENTZIK - MIXAMIX_20050120_FINAL","uid":3547800,"size":100823611,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c4317512c4c056c8811cd3f51251bcf70748c2e&amp;dn=DJ+MENTZIK+-+MIXAMIX_20050120_FINAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mentzik","files":29,"time":1162138474,"description":"DEAR MUSIC LOVERS,\n\nThis mixed music cd is one of my MIXAMIX series.\nThis cds are made mainly as road music but some of them can be easily used for parties.\nI make this cds to accompany me and my friends at car or excursions.\n\nThe motive for making these cds was the fact that I could not find a radio station \nplaying the music I like without interuptions. So I started making my 1hour and a half music experience.\nI like various kinds of music and like to hear them intermixed. That is a risk no radio station takes and also not \nmany djs in the world. Till now only Paul Oakenfold has managed to marry many kinds and ages of music together.\n\nAnyways, hope you enjoy this mixed disks as much as I do.\nRemember that I am not professional, I do this as a hobby.\nThe date after MIXAMIX is the date I have started creating each of this cds. \nThe creation may take from just one day to many months.\n\nA few words about this MIXAMIX_20050120:\nAnother Driving mix. Although it has started in January it is meanted for Hot nights.\nIt was created while having in my mind a special route by the sea with dith difficult turns.\nWith only just a softer stop at track14 all other tracks are there for power and  more power.\nAgain my favorite music style. Techno,Trance, House,Breaks, Rock and Ambient are all here at their best!\nWondering how is this possible just hear this, and then you will understand why some call me the crazy DJ.\nEye of the Tiger is enchanged in a more ambient version by me by adding more synths in back from\nAnne Clark&amp;#039;s Haunted Road which connects as to the next favourite from Depech Mode. Enjoy the Silence.\nAlso here New intro for Furius Angels!\nAnd finally watch what happens when you mix Cobalt with Duran Duran - Whitelines(remixed by Dj Mentzik)\nand how Enya can close such a cd and still dont break the spirit (in fact will leave u wanting more :))!\nThis cds really represents what music I would like to hear! \n\nDj Mentzik (http://www.musicalgalaxy.com)","torrent":{"xt":"urn:btih:5c4317512c4c056c8811cd3f51251bcf70748c2e","amp;dn":"DJ+MENTZIK+-+MIXAMIX_20050120_FINAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4317512c4c056c8811cd3f51251bcf70748c2e","infoHashBuffer":{"type":"Buffer","data":[92,67,23,81,44,76,5,108,136,17,205,63,81,37,27,207,112,116,140,46]},"announce":[],"urlList":[]}}