{"title":"StarTrek - THE MENAGERIE - the original series.Vol8,ep.16 (DVDRi","uid":3819252,"size":724136042,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c754cf3a730d72b617f7df24790616ed7252ede&amp;dn=StarTrek+-+THE+MENAGERIE+-+the+original+series.Vol8%2Cep.16+%28DVDRi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skippytroy","files":5,"time":1190762859,"description":"Volume 8 in the DVD series of original Star Trek episodes includes the fascinating two-part drama &quot;The Menagerie.&quot; As if guided by the frugal wisdom of schlockmeister producer-director Roger Corman, Trek creator Gene Roddenberry found a clever way of using, instead of losing, extensive and costly footage from the then-unseen, discarded Star Trek pilot, &quot;The Cage.&quot; Roddenberry&amp;#039;s solution was to integrate pieces of &quot;The Cage&quot; into a whole new story context, and the surprisingly moving result was &quot;The Menagerie.&quot; First, a bit of background: &quot;The Cage&quot; starred film actor Jeffrey Hunter (King of Kings, The Searchers) as Christopher Pike, the original captain of the Enterprise. Among Hunter&amp;#039;s costars was Leonard Nimoy as Science Officer Spock, who eventually carried over, of course, into the reconfigured series starring William Shatner. Rather than write off &quot;The Cage,&quot; Roddenberry conceived of a story line in which Captain Pike would re-appear on the show in a badly disfigured, paralyzed, and mute form--the result of a terrible accident in which the character saved a number of lives but took a pounding in the process. In &quot;The Menagerie,&quot; Spock hijacks the Enterprise to transport Pike to a secret destination. During court-martial proceedings for this crime, Spock&amp;#039;s defense is presented via archival footage of an old, pre-Kirk mission aboard the Enterprise. That footage, of course, is a re-edited &quot;The Cage.&quot; A must-see for Star Trek fans, &quot;The Menagerie&quot; is a stellar example of Roddenberry thinking on his feet. --Tom Keogh \n","torrent":{"xt":"urn:btih:5c754cf3a730d72b617f7df24790616ed7252ede","amp;dn":"StarTrek+-+THE+MENAGERIE+-+the+original+series.Vol8%2Cep.16+%28DVDRi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c754cf3a730d72b617f7df24790616ed7252ede","infoHashBuffer":{"type":"Buffer","data":[92,117,76,243,167,48,215,43,97,127,125,242,71,144,97,110,215,37,46,222]},"announce":[],"urlList":[]}}