{"title":"BitLord 1.01 News client","uid":3588465,"size":1362977,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5cb351203b7dc305b0b54b26b0f21ef1216e806b&amp;dn=BitLord+1.01+News+client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xmorgan","files":1,"time":1167777961,"description":"About BitLord\nA powerful C++ BitTorrent Client. BitLord is a p2p file-sharing freeware program fully compatible with Bittorrent, which is the most popular p2p protocol designed for high-speed distribution of 100MB or GB sized files. BitLord is a powerful, clean, fast, and easy-to-use bittorrent client. It supports simultaneous downloads, download queue, selected downloads in torrent package, fast-resume, chatting, disk cache, speed limits, port mapping, proxy, ip-filter, etc.\n\nWhy use BitLord\nNO SPYWARE in the program. Built in Torrent search, find anything without having to visit bad websites. Ability to chat with other downloaders (disabled by default). Multiple simultaneous downloads &amp; ability to add priority for a torrent. Ability to limit the upload speed as well as download speed.\nAdvanced advantages\n? Completely new core written in C++, stable and fast, very low CPU usage.\n? Intelligent Connection, Auto Optimization for different connections.\n? Smart Rate Control, optimize the upload distribution to get the max download rate.\n? Disk Allocating, no long-time disk allocation, decrease disk fragment to almost zero.\n? Intelligent Hash Scan, no time-consuming scanning when seeding / resume.\n? Firewall and NAT Traversal, users behind differect NAT can connect to each other.\n? Compatiable with Windows XP SP2 TCP/IP restriction (new in v1.0).\n? Ability to block IP temporarily or permanently, compatiable with eMule ipfilter.dat.\n? Using only one TCP listening port.\n? Auto config ICF and ICS in Windows XP.\n? Auto config port mapping in router (UPnP support is required, Windows XP is required).\n? Support Multi-tracker, and utf-8 extension, UDP tracker Protocol v2.\n? Auto Update Checker.\n? Muti-Language supported, support 20 language now.\n? No need to install, but install/uninstall packages are provided.\n? [Please Note]: Reports say Zone Alarm 5.0 conflict with BitLord (and other p2p maybe).\n? Intelligent Disk Cache, decrease the potential damage to the hard disk when high-speed downloading (&gt;500KB/s) by decrease the read / write frequency, extra memory usage is the cost.\n","torrent":{"xt":"urn:btih:5cb351203b7dc305b0b54b26b0f21ef1216e806b","amp;dn":"BitLord+1.01+News+client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cb351203b7dc305b0b54b26b0f21ef1216e806b","infoHashBuffer":{"type":"Buffer","data":[92,179,81,32,59,125,195,5,176,181,75,38,176,242,30,241,33,110,128,107]},"announce":[],"urlList":[]}}