{"title":"SimCity 4 Deluxe Editon + serial","uid":3952451,"size":1301207403,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5ef7780c925af9753413c4aa159ef1df5ae3b718&amp;dn=SimCity+4+Deluxe+Editon+%2B+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"good4abonk","files":3,"time":1198938395,"description":"These are true copies of a purchased PC game. \nSimCity 4 DE is an awesome game.\nAnyway...\n\n\nFor the TECHY: \nJust put the iso&amp;#039;s on cd, apply the serial and presto.\n\nFor the NOVICE:\nWhat you will need:\n\nPentium 4 or better\n1 GB RAM\nA smokin video card\nRewritable CD-ROM Drive\n2 cd-r/cd-rw CD&amp;#039;s\nNero 7 or later\n\n(these specs are maximum you could probably get away with less)\n\nFind the torrent file after downloading and use a torrent downloading \nprogram (I suggest utorrent) to download the contents to an easily found\ndirectory (folder) on your hard drive (My Downloads, My Documents, etc.). \nOnce the download is finished, go to that folder. You will find 2 ISO files\n(SC4_cd1 and SC4_cd2, the icons will have little discs on them). There will\nalso be a text file named &quot;serial&quot; which is this games serial number. If you \ndon&amp;#039;t have Nero 7 or later by now, get it. When you have Nero 7 installed all you have to do is place a cd-r or cd-rw disc in your cd-rom drive and double-click the ISO files (both separately on 2 discs each), Nero will ask you either to create an image or burn an image to the disc at the drop-down menu. Choose the option that shows your D: drive name. Don&amp;#039;t choose &quot;create image&quot;, the file you double clicked is an image and you don&amp;#039;t need another one. Then click burn and that will burn the files contained in the ISO onto the new cd-r/cd-rw. REMEMBER, don&amp;#039;t burn both ISO files on the same CD. Burn both files on separate discs. Once you have your 2 new SC4 cd&amp;#039;s, mark them and put the SC4_cd1 disc in your D: drive. It will ask you for a serial number. Go to the folder that has serial.txt in it and type in or paste and copy the serial into the fields. And there you have it. Just follow all the prompts and your good to go. Hope you enjoy it.\n\nThis is a genuine copy, no viruses. Don&amp;#039;t worry, it&amp;#039;s legit.  ","torrent":{"xt":"urn:btih:5ef7780c925af9753413c4aa159ef1df5ae3b718","amp;dn":"SimCity+4+Deluxe+Editon+%2B+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ef7780c925af9753413c4aa159ef1df5ae3b718","infoHashBuffer":{"type":"Buffer","data":[94,247,120,12,146,90,249,117,52,19,196,170,21,158,241,223,90,227,183,24]},"announce":[],"urlList":[]}}