{"title":"Microsoft Process Explorer 11.02 -LegalTorrents","uid":3813045,"size":1647760,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f524366988e5b299b04b384ee113dd7b8d60b56&amp;dn=Microsoft+Process+Explorer+11.02+-LegalTorrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LegalTorrents","files":4,"time":1190299282,"description":"Process Explorer shows you information about which handles and DLLs processes have opened or loaded.\nThe Process Explorer display consists of two sub-windows. The top window always shows a list of the currently active processes, including the names of their owning accounts, whereas the information displayed in the bottom window depends on the mode that Process Explorer is in: if it is in handle mode you&amp;#039;ll see the handles that the process selected in the top window has opened; if Process Explorer is in DLL mode you&amp;#039;ll see the DLLs and memory-mapped files that the process has loaded. Process Explorer also has a powerful search capability that will quickly show you which processes have particular handles opened or DLLs loaded.\n\nThe unique capabilities of Process Explorer make it useful for tracking down DLL-version problems or handle leaks, and provide insight into the way Windows and applications work.\n\nWhat&amp;#039;s new in Version 11.0:\n\n* New treelist control for better UI responsiveness\n* Asynchronous thread symbol resolution on threads tab of process properties\n* More flags on groups in security tab and SID display\n* Thread IDs on threads tab\n* On-line search uses default web browser and search engine\n* Vista ASLR column for processes and DLLs\n* Vista Process and thread I/O and memory priorities in process and thread properties\n* Vista Process and thread I/O and memory columns\n* PROCESS_QUERY_LIMITED_INFORMATION support on process permissions on Vista\n* Run as limited user runs with low IL on Vista\n* Reports information for all object types on Vista\n* Show details for all processes elevation menu item on Vista\n* Supports replacement of task manager on Vista\n* /e to launch elevated\n* /s switch to select a process at startup\n* Compiled w/ASLR, DEP\n* Faster startup\n* Miscellaneous bug fixes and minor improvements\n\n\n\n\n\n-LEGAL TORRENTS\n\nPurpose:\n\ncreate a balance, share the already free stuff,\npublic domain works, freeware, free music,\nfree ebooks, articles, manifestos, movie trailers, and more.\n\nshow the copyright owners that torrent\nwebsites shouldn&amp;#039;t bear the responsibility\nof what their users upload, torrent websites\nare very much similar to google..\n\nusers upload what they want to upload,\ndownload what they want to download,\nand search for what they want to search..\n\nby creating this balance and sharing the already free\nstuff, we hope to take the pressure of torrent websites..\n\n","torrent":{"xt":"urn:btih:5f524366988e5b299b04b384ee113dd7b8d60b56","amp;dn":"Microsoft+Process+Explorer+11.02+-LegalTorrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f524366988e5b299b04b384ee113dd7b8d60b56","infoHashBuffer":{"type":"Buffer","data":[95,82,67,102,152,142,91,41,155,4,179,132,238,17,61,215,184,214,11,86]},"announce":[],"urlList":[]}}