{"title":"FS2004 JCA MD82 Panel","uid":3597154,"size":37326058,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5fd6f3fe7550093536e2e51fbf6823e48829e411&amp;dn=FS2004+JCA+MD82+Panel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FSGolddigger","files":1,"time":1168968491,"description":"Eaglesoft Development Group, in cooperation with PAS software, is pleased to announce the release of Flight Deck MD-80 for Microsoft Flight Simulator 2004!\n\nThe MD-80 series has been one of the most popular aircraft since the early 80?s. During its service the cockpit has evolved from a completely analog panel to a majority glass panel. This panel package includes all 3 versions of the MD-80 including a totally Analog panel, a combination glass Primary Flight and Nav displays with Analog engine instruments, and Majority Glass panel.\n\nTwo other panel configurations include the Glass panel with a standard annunciator panel, and the Combination glass/analog panel without a GPS for a total of five panel configurations.\n\nEach panel is completely unique, with all its own instruments and annunciator panels. Fly one leg in the old school configuration and then jump in the glass panel. There is a configuration for every simmer.\n\nAnother very exciting feature of this add-on is the cooperation of JCA and their superb MD-80 model. This panel has been specifically designed for use with the JCA MD-80. Also included are the files necessary to incorporate the excellent TCAS gauge by Lee Hetherington. These partnerships will allow us to provide a realistic panel package with five totally separate configurations and tons of features at a great price. FREE\n\nFlight Deck MD80 Features:\n\nÂ·         Programmed by a real MD80 pilot.\n\nÂ·         Five different panel configurations with different systems for different aircraft.\n\nÂ·         Overhead: All major systems simulated. Have the ability to open the entire overhead or just the system you want.\n\nÂ·         GPWS: with multiple callouts.\n\nÂ·         TCAS: Panel.cfg to incorporate Lee Hetherington TCAS.\n\nÂ·         Full autoland system.\n\nÂ·         Both annunciator panels and CAWS messaging systems.\n\nÂ·         APU: Fully simulated with air and electrical systems and shutdown protections.\n\nÂ·         Working Thrust Management System.\n\nÂ·         Partially functional FMC with working VNAV\n\nÂ·         Systems: Electrical, Fuel, Anti-Ice, Pressurization, IRS, Air Conditioning, Hydraulics, Autopilot etc.\n\nÂ·         Performance paperwork including Takeoff Performance, Load Closeout and Speed Cards.\n\nÂ·         Authentic Female warning sounds.\n\nÂ·         Takeoff Condition Computer.\n\nÂ·         GPU power available on the ground.\n\nÂ·         Simulation panel that allows you to practice Engine failures (V1 cuts and in the air) Engine fires, CSD failures, Generator failures, Hydraulic failures and Decompression.\n\nÂ·         Extensive manual that includes System descriptions including schematics, Normal Procedures, Emergency Procedures, and Limitations etc.\n\nÂ·         Flight Profiles that illustrate the correct flight procedures.\n\nÂ·         Pushback\n\nÂ·         Virtual First Officer with multiple callouts.\n\n","torrent":{"xt":"urn:btih:5fd6f3fe7550093536e2e51fbf6823e48829e411","amp;dn":"FS2004+JCA+MD82+Panel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fd6f3fe7550093536e2e51fbf6823e48829e411","infoHashBuffer":{"type":"Buffer","data":[95,214,243,254,117,80,9,53,54,226,229,31,191,104,35,228,136,41,228,17]},"announce":[],"urlList":[]}}