{"title":"MySecretFolder XP Edition v4.21","uid":3561301,"size":966094,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64fd8a02b351bd15e4876280d8899c0fb56541ed&amp;dn=MySecretFolder+XP+Edition+v4.21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SweX^","files":3,"time":1164052641,"description":"Hide your secret folder from other users\n\nDo you share your computer with others? Do you want to stop them from peeking into your personal files? Now you can, quickly and easily!\nMySecretFolder? is a software utility that you can use to hide your private folder from other users, hide it so that no one will even suspect that your secret folder exists! Yet the folder would be easily accessible to you, when you need it: just press the &quot;hot key&quot;, enter your password, and it will open in a window, just like a regular Windows folder. While the folder is unprotected, you can work with the files and documents it contains, just like with any other folder you have. When you are done, enter your password, and the folder will disappear again, until you need it next time.\n\nProtect your secret folder with a password\n\nInstead of hiding your private folder, you can use MySecretFolder to lock the folder with a password. Other users of your computer would not be able to open the folder or the files it contains unless they know the password you have set up.\nMySecretFolder offers many ways of customizing its operation to suit your preferences:\n? You can enable the stealth mode of operation to prevent other users from detecting the presence of MySecretFolder on your computer;\n? You can set up a hot key to run the commands of MySecretFolder and quickly protect or unprotect your secret folder.\n? You can configure MySecretFolder to display a taskbar for quick access to your secret folder, as well as as to serve as an indicator of the status of its protection.\n? You can make MySecretFolder to display a custom password prompt, with the text of your choice.\n? In addition to protecting your secret folder, MySecretFolder can also prevent access to the Registry Editor and System Configuration Utility, to stop other users from disabling MySecretFolder.\n? You can set up MySecretFolder to clean up the system list of the most recently used programs and documents from the traces of the files located in your secret folder, so that other users would not be able to detect the presence of your secret folder. \n\nPiratpalatset.se","torrent":{"xt":"urn:btih:64fd8a02b351bd15e4876280d8899c0fb56541ed","amp;dn":"MySecretFolder+XP+Edition+v4.21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64fd8a02b351bd15e4876280d8899c0fb56541ed","infoHashBuffer":{"type":"Buffer","data":[100,253,138,2,179,81,189,21,228,135,98,128,216,137,156,15,181,101,65,237]},"announce":[],"urlList":[]}}