{"title":"Hoaglands Mars (1990 - 1994; all three volumes)","uid":3560029,"size":1284612240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:65c43af1bd51a47430a12650f58a849303114494&amp;dn=Hoaglands+Mars+%281990+-+1994%3B+all+three+volumes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":44,"uploader":"grinreaper_CCE","files":5,"time":1163872071,"description":"Hoagland\\&amp;#039;s Mars, Vol. 1\n\nThe NASA-Cydonia Briefings (83 m)\n\nThis video is the first official record of Richard C. Hoagland\\&amp;#039;s historic presentation \n-- on the critical issue of potential \\&quot;ET artifacts\\&quot; discovered on the planet Mars -- \nmade to thousands of government engineers and scientists on March 20, 1990, at the \nNASA-Lewis Research Center, in Cleveland, Ohio. At the invitation of the center \nDirector himself, Dr. John Klineberg, Hoagland outlines in detail the early findings of \nthe Independent Mars Investigation Team, and their complex, multi-disciplinary analyses of a series of extraordinary, enigmatic photos sent back by NASA\\&amp;#039;s first official \\&quot;search for life on Mars\\&quot; -- the 1976 Project Viking Mission. You\\&amp;#039;ll see the intensely controversial, official NASA photos themselves as NASA\\&amp;#039;s own engineers first saw them -- images and measurements which demonstrate the extraordinarily redundant, \\&quot;impossible\\&quot; mathematical design discovered by Hoagland and his colleagues connecting the enigmatic Martian \\&quot;Sphinx,\\&quot; and the nearby \\&quot;pyramid complex\\&quot; lying in a northern desert region called \\&quot;Cydonia\\&quot; -- left by \\&quot;someone\\&quot; very long ago . . . on the planet Mars. One day (and perhaps, given recent headlines, very soon . . .) this first official record of a NASA briefing on the \\&quot;Monuments of Mars\\&quot; will be confirmed as valid scientific confirmation of a \\&quot;high-tech civilization\\&quot; visiting our solar system . . . untold millennia ago.\n\nStream: RealVideo VBR Stream - Single Rate\nFile Name: Hoaglands Mars - Vol 1 - The NASA-Cydonia Briefings.rmvb\nLast Modified: Sun, 23 Jan 2005 19:04:24 GMT\nFile Size: 284,907,664 Bytes\nTitle: \nAuthor: \nCopyright: \nDuration: 82:28.662 \nBuffer Time: 24.0 seconds\nMax Bit Rate: 900.0 Kbps\nAvg Bit Rate: 449.5 Kbps\n----------------------------------------\nHoagland\\&amp;#039;s Mars, Vol. 2\n\nThe U.N. Briefing: The Terrestrial Connection (Ex. Ver.) (115m)\n\nOn February 28, 1992, at the invitation of a United Nations staff special interest \ngroup (SIG), Richard C. Hoagland took his case to the U.N. Speaking before hundreds of U.N. staff, delegates and invited press and guests, Hoagland extends his intelligence hypothesis concerning the mystery of Cydonia, to planet Earth: demonstrating that the same mathematical message encoded in the layout of the ruins on Mars is also found at many of the mysterious ruins on this planet. With many stunning slides and film clips, Hoagland shares his insights into a new science of \\&quot;fourth dimensional physics\\&quot; gleaned from the Cydonia research, a physics that opens the door to unlimited energy sources that could revolutionize our technologies, if not change the way we think about the universe itself. The last 24 minutes of Vol. 2 contain an analysis of the extraordinary footage, captured by NASA on September 15, 1991, when the U.S. space shuttle Discovery recorded what appears to be UFO-like spacecraft cruising over the Indian Ocean at enormous speeds, turning at right angles and accelerating to several hundred thousand miles per hour after being \\&quot;shot at\\&quot; by two missile-like flashes, violating all current laws of physics. The fact that this video was broadcast live over NASA\\&amp;#039;s own satellite channel (NASA Select), leads us to believe that this was a \\&quot;U.S. black budget\\&quot; project, test leaked from the highest offices at NASA -- despite NASA\\&amp;#039;s current claim that the film shows only \\&quot;ice crystals from a waste water dump\\&quot;. Shortly after this video was aired, the head of NASA, former astronaut and commander of the first U.S. S. Enterprise space shuttle, Admiral Richard Truly, was abruptly fired. Hoagland believes that he and his associates have an important inside track on what this striking video really represents, given the \\&quot;hyperdimensional\\&quot; physics found encoded in the ruins of Cydonia. \n\nOnce you see this video, you will be convinced that this is the \\&quot;smoking gun\\&quot; that \nproves that something extraordinary has been happening in the solar system, if not on planet Earth, for a long, long time . . . something that up until now, we have not been \\&quot;permitted\\&quot; to know. Question: now that we do know -- what do we plan to do about it?\n\nStream: RealVideo VBR Stream - Single Rate\nFile Name: Hoaglands Mars - Vol 2 - The UN Briefing - The Terrestrial Connection.rmvb\nLast Modified: Mon, 24 Jan 2005 04:52:58 GMT\nFile Size: 385,913,436 Bytes\nTitle: \nAuthor: \nCopyright: \nDuration: 111:57.80 \nBuffer Time: 23.3 seconds\nMax Bit Rate: 900.0 Kbps\nAvg Bit Rate: 450.7 Kbps\n-------------------------------------------\nHoagland\\&amp;#039;s Mars, Vol. 3\n\nThe Moon-Mars Connection (3hrs. 20 m) - 2 tapes\n\nOn June 2, 1994 at Ohio State University, Richard C. Hoagland presented publicly for \nthe first time the results of his (then) 2-year \\&quot;lunar extension of the independent \nMars Investigation\\&quot; -- using NASA\\&amp;#039;s own images from the Lunar Orbiter, Surveyor and Apollo missions to the Moon. Armed with dramatic new advances in current computerized technology brought about by the Space Program itself, Hoagland reveals in this video the official images that, over thirty years ago, captured the stunning, light reflecting remnants of an apparent, ancient lunar dome -- stretching over \\&quot;Sinus Medii,\\&quot; the dark \\&quot;sea\\&quot; located in the center of the full Moon. This computerized analysis has also revealed scores of additional features now only explainable by some kind of \\&quot;intelligent design,\\&quot; including: a \\&quot;tetrahedral\\&quot; light pattern attributable to structural remains still present in the floor of the crater Ukert; a complex of identically sized, precisely aligned, impossible \\&quot;double craters\\&quot; caught on the highly eroded floor of the crater Murchison (now strongly suspected to be the actual footings of the north-western edge of this \\&quot;Sinus Medii dome\\&quot;); to say nothing of a one and a half mile tall, glass-like, \\&quot;geometric shard\\&quot; -- photographed by an unmanned Lunar Orbiter in 1967, casting an imposing shadow out across the horizon of Moon. This, and a host of other, equally inexplicable \\&quot;artifacts\\&quot; discovered on these official lunar photographs -- unexplainable by any known geology or photographic process -- increasingly demonstrate to one and all the reality of artificial constructs on the Moon . . . which NASA apparently, inexplicably, \\&quot;forgot\\&quot; to tell the world. Destined inevitably to become a true collectors\\&amp;#039; item -- the first serious scientific presentation of NASA\\&amp;#039;s own archived evidence of artificial structures on Earth\\&amp;#039;s only natural satellite . . . this video was made years before NASA\\&amp;#039;s recent, stunning admission of the \\&quot;scientific possibility\\&quot; of life beyond the Earth . . . What\\&amp;#039;s next . . . in this exploding subject? Order a copy of this \\&quot;beginning of NASA\\&amp;#039;s coming \nrevelations\\&quot; -- and stay tuned.\n\nStream: RealVideo VBR Stream - Single Rate\nFile Name: Hoaglands Mars - Vol 3 - The Moon and Mars Connection (Part 1).rmvb\nLast Modified: Mon, 24 Jan 2005 12:04:40 GMT\nFile Size: 318,188,224 Bytes\nTitle: \nAuthor: \nCopyright: \nDuration: 92:13.805 \nBuffer Time: 24.0 seconds\nMax Bit Rate: 900.0 Kbps\nAvg Bit Rate: 450.5 Kbps\n\nStream: RealVideo VBR Stream - Single Rate\nFile Name: Hoaglands Mars - Vol 3 - The Moon and Mars Connection (Part 2).rmvb\nLast Modified: Mon, 24 Jan 2005 20:19:04 GMT\nFile Size: 295,595,030 Bytes\nTitle: \nAuthor: \nCopyright: \nDuration: 85:17.704 \nBuffer Time: 19.4 seconds\nMax Bit Rate: 900.0 Kbps\nAvg Bit Rate: 453.1 Kbps\n------------------------------------------\n\nInspite of all videos being recoded, all the videos display good quality and have \n\nintelligible audio.\n\n================================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n======================================================","torrent":{"xt":"urn:btih:65c43af1bd51a47430a12650f58a849303114494","amp;dn":"Hoaglands+Mars+%281990+-+1994%3B+all+three+volumes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65c43af1bd51a47430a12650f58a849303114494","infoHashBuffer":{"type":"Buffer","data":[101,196,58,241,189,81,164,116,48,161,38,80,245,138,132,147,3,17,68,148]},"announce":[],"urlList":[]}}