{"title":"Anonymity Gateway v2.7 WinAll Incl Keymaker-CRD","uid":3807697,"size":3652004,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:65c8c6c56ca5cf317490c3a43d4935ac1e544fd1&amp;dn=Anonymity+Gateway+v2.7+WinAll+Incl+Keymaker-CRD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1189870746,"description":"When I saw this, I thought off all you people out there that are paranoid about your internet activities, and being traced by the MPAA, RIAA, etc. etc. etc. So I thought I would post this here, and here it is. Anonymity Gateway masks your IP from websites and other services by using proxies (just sounds like an easy proxy changer). At least it comes with a keygen, so no cracking needed! :) Oh well, enjoy it?\n\nAnonymity Gateway masks the real IP of a user, allowing him to browse all kind of pages without ever worrying that the ISPs or any other marketing tool is monitoring your surfing habits or spammers are attacking your computer. The simplest way to do this is to have traffic redirected through anonymous proxies. A proxy server is a kind of buffer between your computer and the Internet resources you are accessing. The data you request come to the proxy first, and only then it transmits the data to you. As a result, the websites see the IP address of the proxy server instead of your own IP address. This tool has a comprehensive proxy list, containing proxies from various countries so that you can choose one from a specific one.\n\nRelease Name:\n\n    * Browse anonymously, check mails, participate in newsgroups using proxies form different countries at your choice, having the identity well hidden\n    * Interact with websites anonymously: using proxies that allow you to post messages, game, cast votes, post on forum, use IP ? based trials\n    * Blocks ActiveX - ActiveX controls add interest to sites through multimedia but the controls can also harbor malicious code such as viruses. Most sites will function properly with ActiveX controls disabled.\n    * Blocks JavaScript - This code may be used in harmful way such as to information on your computer.\n","torrent":{"xt":"urn:btih:65c8c6c56ca5cf317490c3a43d4935ac1e544fd1","amp;dn":"Anonymity+Gateway+v2.7+WinAll+Incl+Keymaker-CRD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65c8c6c56ca5cf317490c3a43d4935ac1e544fd1","infoHashBuffer":{"type":"Buffer","data":[101,200,198,197,108,165,207,49,116,144,195,164,61,73,53,172,30,84,79,209]},"announce":[],"urlList":[]}}