{"title":"Planet Earth Disc 2-OnlyMe1","uid":3957583,"size":4698909502,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66f286da090401e10c462e993892587dc91f2956&amp;dn=Planet+Earth+Disc+2-OnlyMe1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"abqwerty","files":18,"time":1199251463,"description":"Planet Earth BBC Series With David Attenborough\n\nReady to Burn to DVD\n\n3 Episodes\n\nEpisode 4: Caves\n\nThe Cave of Swallows in Mexico is a 400m vertical shaft, deep enough to engulf the Empire State Building. The Lechuguilla cave system in the USA is 193km long with astonishing crystal formations.\n\nCaves are remarkable habitats with equally bizarre wildlife. Cave angel fish cling to the walls behind waterfalls with microscopic hooks on their fins. Cave swiftlets navigate by echo-location and build nests out of saliva. The Texas cave salamander has neither eyes nor pigment. Planet Earth gets unique access to a hidden world of stalactites, stalagmites, snotites and troglodytes.\n\nEpisode 5: Deserts\n\nAround 30% of the land&amp;#039;s surface is desert, the most varied of our ecosystems despite the lack of rain. Saharan sandstorms reach nearly a mile high and desert rivers run for a single day.\n\nIn the Gobi Desert, rare Bactrian camels get moisture from the snow. In the Atacama, guanacos survive by licking dew off cactus spines. The brief blooming of Death Valley triggers a plague of locusts 65km wide and 160km long. A unique aerial voyage over the Namibian desert reveals elephants on a long trek for food and desert lions searching for wandering oryx. \n\nEpisode 6: Ice Worlds\n\nThe Arctic and Antarctic experience the most extreme seasons on Earth. Time-lapse cameras watch a colony of emperor penguins, transforming them into a single organism. The film reveals new science about the dynamics of emperor penguin behaviour.\n\nIn the north, unique aerial images show a polar bear swimming more than 100km. Diving for up to two minutes at a time. The exhausted polar bear later attacks a herd of walrus in a true clash of the Titans.","torrent":{"xt":"urn:btih:66f286da090401e10c462e993892587dc91f2956","amp;dn":"Planet+Earth+Disc+2-OnlyMe1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66f286da090401e10c462e993892587dc91f2956","infoHashBuffer":{"type":"Buffer","data":[102,242,134,218,9,4,1,225,12,70,46,153,56,146,88,125,201,31,41,86]},"announce":[],"urlList":[]}}