{"title":"Tranquility Bay - WWASP Behaviour Modification Camps","uid":3953622,"size":366782707,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:67238d0cc489f9d0f0eb6e116e176f1fdadce3fd&amp;dn=Tranquility+Bay+-+WWASP+Behaviour+Modification+Camps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dr0ne","files":2,"time":1199013950,"description":"Tranquility Bay - WWASP Behaviour Modification Camps\n(2005-TVRip-d0x).avi\n\n_____________________________________________________________Program__\n\nRuntime......: 00:53:07 (79,685 fr)\nGenre........: Current Affairs / Documentary\nLanguages....: English, French\nTranslations.: English subtitles\nInfo URL.....:\n\n____________________________________________________________Encoding__\n\nFile Size....: 349 MB (or 358,182 KB or 366,778,368 bytes)\nFrames.......: 544x320 (1.70:1) [=17:10] @ 25.000 FPS\nVideo Codec..: XviD @ 788 kb/s - 0.181 bits/pixel\nAudio Codec..: MP3 @ 128 kb/s (64/ch, stereo) CBR  48000 Hz\n\n_____________________________________________________________Summary__\n\n  TRANQUILITY BAY\n\n  Exotic school names like Tranquility Bay and Paradise Cove and \nbeachside locations in countries like Jamaica, Fiji and Western Samoa\nsuggest that troubled-teen students will find an idyllic and \nunderstanding academic paradise where they can reform. Instead the \npupils behind the schools&amp;#039; barbed wire fences have been subjected to \nabuse and half of the schools have been forced to close.\n\nTranquility Bay looks at the private reform-school industry for \nwayward American teens and the unhappy parents who are increasingly \nspeaking ut about the practices in these institutions. It is a \ngrowing industry and affluent parents pay up to $25, 000 a year in \nschool fees.\n\nThe World Wide Association of Specialty Programs (WWASP) is the \nleading provider of behaviour modification programs for American \nteens. At the helm of a company which earns $95 million per year is \nRobert Browning Lichfield, a Utah resident and Mormon, who has built\nhis fortune through the numerous WWASP programs that are located \nthroughout the world. He is in charge of a virtual empire of schools\nwhere complaints of physical and sexual abuse are allegedly ignored\nby American authorities.\n\nThe school&amp;#039;s popularity feeds on the strong level of concern that\nparents have for their delinquent children. Parents attend seminars\nwhere they are led to believe that their children can be changed for\nthe better and then sign contracts with WWASP which specify it is\nallowed to use pepper spray, electronic disablers, mace, mechanical\nrestraints and handcuffs to enforce good behaviour. The contract also\nstates that the organisation is not liable for any harm the child\nshould suffer while in its care. There are also allegations that the\nschools lack a comprehensive academic curriculum, operate without a\nlicense from the education ministry and offer student qualifications\nthat aren&amp;#039;t officially recognised in America.\n\nAt WWASP, punishments are of a physical nature and designed to inflict\nextreme pain on the receiver. Misbehaviour such as talking at\ninappropriate moments is punished by relegation to the &quot;dog cage&quot; - a\nsmall boxed area where a student is forced to lie face-down for hours,\ndays or months, in extreme heat conditions. One female student was\nsubjected to this punishment for 18 months.\n\nForeign authorities have been sufficiently concerned with the\nactivities of the schools to shut down establishments in Western\nSamoa, Costa Rica, Mexico and the Czech Republic. In total, six out\nof twelve WWASP schools have closed amidst allegations of child abuse.\nAn increasing number of parents who are shocked at the physical and\nemotional scars borne by their returning children have started to\nspeak out against WWASP, under the threat of lawsuits. The film\nfollows the progress of a defamation suit that WWASP brought against\nsingle mother, Sue Scheff, who set up a website detailing her\nobjections to the way her son was treated in Tranquility Bay, Jamaica.\n\nThe program claims that the profitability of WWASP goes a long way to\nexplaining why American authorities have not mounted investigations\ninto its activities. An examination of personal finances of school\nexecutives, such as Robert Browning Lichfield, indicates that they are\namongst the biggest donors to the Republican Party and gave over\n$1 million in political donations in 2002-2004 and also fund the\nmissionary work of the Mormon movement  \n\n(From France, in English and French, with English subtitles)\n\n_________________________________________________________________d0x__","torrent":{"xt":"urn:btih:67238d0cc489f9d0f0eb6e116e176f1fdadce3fd","amp;dn":"Tranquility+Bay+-+WWASP+Behaviour+Modification+Camps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67238d0cc489f9d0f0eb6e116e176f1fdadce3fd","infoHashBuffer":{"type":"Buffer","data":[103,35,141,12,196,137,249,208,240,235,110,17,110,23,111,31,218,220,227,253]},"announce":[],"urlList":[]}}