{"title":"Coast to Coast Radio Program! Commercial Free! Dec 15th thru Dec","uid":3948845,"size":604206365,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:687c604080f8f98fc336197c0851507deea4810d&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Dec+15th+thru+Dec&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":55,"time":1198705557,"description":"Hello All! I\\&amp;#039;m sorry I am so late. I went out of town to visit some relatives and I did not have access to the internet while I was gone. I uploaded this torrent as soon as I got the free time after getting back. I hope you C2C freaks out there aren\\&amp;#039;t too mad at me. Here are 11 broadcasts for you all to Download, SEED, and Enjoy! Merry Christmas and Happy New Year to all! Stokeman Out! Until next time.....\n\nSaturday December 15th, 2007\nSecret Societies Through The Ages\nLive from England, Lynn Picknett and Clive Prince, authors of The Sion Revelation discussed their research into Secret Societies. The duo talked about their investigation into the Priory of Sion, saying the popular notion of the organization is... \nHost: Ian Punnett\nGuest(s): Clive Prince, Lynn Picknett, A.J. Jacobs\n\nSunday December 16th, 2007\nSecrecy, UFOs &amp; Disclosure\nAttorney and activist Daniel Sheehan joined host George Knapp (email) for a discussion on secrecy and disclosure, with a particular emphasis on UFOs. Sheehan said he is involved with John Edwards\\&amp;#039; presidential campaign, and as part of that, he is working... \nHost: George Knapp\nGuest(s): Daniel Sheehan, Christopher O\\&amp;#039;Brien\n\nMonday December 17th, 2007\nNear Death Experiencers\nNear-Death Experience researcher for over 30 years, P.M.H. Atwater shared her explanation for NDEs, and discussed case studies and personal experiences. She reported that as many as 4 to 5% of the population may undergo an NDE-- a consciousness apart... \nHost: George Noory\nGuest(s): P. M. H. Atwater, Jim Berkland\n\nTuesday December 18th, 2007\nExpanding Consciousness\nDavid Sereda discussed his pathway to expanded consciousness, as well as his new film The Voice, which explores how spirituality, religion and science are merging together into a single place. In the film, Dr. Roger Nelson, of the Princeton Global Consciousness... \nHost: George Noory\nGuest(s): David B. Sereda\n\nWednesday December 19th, 2007\nEvolution &amp; The Mayan Calendar\nInternational teacher Barbara Hand Clow discussed her new book on the Mayan Calendar which incorporates scientist Carl Johan Calleman\\&amp;#039;s concepts on time acceleration. According to Calleman, the calendar tracks 16.4 billion years of evolution via \\&quot;nine...\nHost: George Noory\nGuest(s): Barbara Hand Clow, Jerome Corsi, Nick Redfern\n\nThursday December 20th, 2007\nGenerational Cycles\nGuest host John B. Wells (email) welcomed historian and speaker Neil Howe, who discussed his work on generations, as well as the twenty year cycle of crisis now facing the U.S. He identified different types of generations that tend to repeat in the... \nHost: John B. Wells\nGuest(s): Neil Howe, Roy Varghese\n\nFriday December 21st, 2007\nOpen Lines &amp; A World With No Humans\nFilling in for George, Ian Punnett hosted an evening of Open Lines. Sarah in New York played a reverse speech audio clip from Ian\\&amp;#039;s 10/6/07 chat with Jon Jefferson, author of Beyond the Body Farm. According to Sarah, when part of Jefferson\\&amp;#039;s interview... \nHost: Ian Punnett\nGuest(s): Open Lines, Alan Weisman\n\nSaturday December 22nd, 2007\nJohn Lennon &amp; Rock and Roll Stories\nBill Harry, the founder of Mersey Beat magazine and one of John Lennon\\&amp;#039;s best friends, joined author R. Gary Patterson to discuss Lennon, reports that he is composing songs in the afterlife and channeling them through psychics, as well as mystical occurrences...\nHost: Ian Punnett\nGuest(s): Bill Harry, R. Gary Patterson, Lauren Weinstein\n\nSunday December 23rd, 2007\nThe Impact of NDEs\nPresident of the International Association for Near-Death Studies (iands.org), Yolaine Stout joined Rollye James for a discussion on Near-Death Experiences (NDEs). Stout described her own NDE, which occurred to her in 1982 when she was an atheist. The... \nHost: Rollye James\nGuest(s): Yolaine Stout, Vicki Noratuk\n\nMonday December 24th, 2007\nChristmas Eve Special\nGeorge Noory\\&amp;#039;s Christmas Eve Special featured several guests, plus a couple of surprise visits. In the first hour, researcher Stanton Friedman commented on the UK Ministry of Defence\\&amp;#039;s plan to release secret UFO files. He was wary of expecting too... \nHost: George Noory\nGuest(s): Stanton Friedman, Joseph Jacobs, Michael Gear, Kathleen Gear, Billy Gibbons, Lionel Fanthorpe, Richard C. Hoagland\n\nTuesday December 25th, 2007\nThe Christmas \\&amp;#039;Miracle\\&amp;#039; Show\nThis special Christmas Night Open Lines program featured callers sharing their miracle stories, along with some surprise greetings. A woman told a tale of an angelic encounter, in which control of her steering wheel was taken over, helping her avert... \nHost: George Noory\nGuest(s): Open Lines, Dannion Brinkley","torrent":{"xt":"urn:btih:687c604080f8f98fc336197c0851507deea4810d","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Dec+15th+thru+Dec","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"687c604080f8f98fc336197c0851507deea4810d","infoHashBuffer":{"type":"Buffer","data":[104,124,96,64,128,248,249,143,195,54,25,124,8,81,80,125,238,164,129,13]},"announce":[],"urlList":[]}}