{"title":"Puente a terabithia(2007)","uid":3841141,"size":3585720969,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:69abb90445fde1b709374a2233562c3543727161&amp;dn=Puente+a+terabithia%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bambam1242002","files":6,"time":1192317417,"description":"De los productores de Las CrÃƒÂ³nicas de Narnia: El LeÃƒÂ³n, La Bruja y el Armario y basada en la popular novela ganadora del premio Newbery, Puente hasta Terabithia es una historia de fantasÃƒÂ­a/aventura, sobre la amistad, la familia y el poder de la imaginaciÃƒÂ³n. Jess Aarons se siente un extraÃƒÂ±o en el colegio, e incluso en su propia familia. Jess ha entrenado todo el verano para convertirse en el chico mÃƒÂ¡s rÃƒÂ¡pido de su clase, pero su objetivo se ve frustrado de manera inesperada por la nueva chica en el colegio, Leslie Burke que compite en la carrera &quot;sÃƒÂ³lo para chicos&quot; y gana. A pesar de conocerse de esta manera un tanto peculiar, pronto se convierten en mejores amigos. A Leslie le encanta contar historias de fantasÃƒÂ­a y magia. A Jess le encanta dibujar pero lo guardaba para sÃƒÂ­ mismo hasta conocer a Leslie. Leslie abre un nuevo mundo de imaginaciÃƒÂ³n para Jess. Juntos crean el reino secreto de Terabithia, un lugar mÃƒÂ¡gico al que sÃƒÂ³lo puede accederse columpiÃƒÂ¡ndose en una vieja cuerda que cuelga sobre el arroyo situado en un bosque cercano a sus casas. AllÃƒÂ­, los amigos gobiernan el reino, luchan contra el Maestro Oscuro y sus criaturas y trazan planes para vengarse de los abusones del colegio. Gracias a su amistad con Leslie, Jess cambia para siempre. Rebosante de criaturas fantÃƒÂ¡sticas, palacios y hermosos bosques, el mundo de Terabithia cobra vida de la mano de los impresionantes genios de efectos visuales de la oscarizada Weta Digital (El SeÃƒÂ±or de los Anillos, King Kong).\n \n","torrent":{"xt":"urn:btih:69abb90445fde1b709374a2233562c3543727161","amp;dn":"Puente+a+terabithia%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69abb90445fde1b709374a2233562c3543727161","infoHashBuffer":{"type":"Buffer","data":[105,171,185,4,69,253,225,183,9,55,74,34,51,86,44,53,67,114,113,97]},"announce":[],"urlList":[]}}