{"title":"Spying on the Home Front (Frontline PBS Documentary)","uid":3695854,"size":174288068,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6ba5130105960a02261b4a95a9fd2c602b225f5a&amp;dn=Spying+on+the+Home+Front+%28Frontline+PBS+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"spum_man","files":9,"time":1179989590,"description":"The National Security Agency of the United States of America has been conducting surveillance on ALL Internet traffic in the USA since February 2003. This program discusses the evidence for and thinking behind this illegal program.\n\n\\\\\\&quot;...what they\\\\\\&amp;#039;ve done is to trample over the Fourth Amendment by basically instituting a general warrant on the Internet.\\\\\\&quot;\n\n\nFrom the Introduction\n\n9/11 has indelibly altered America in ways that people are now starting to earnestly question: not only perpetual orange alerts, barricades and body frisks at the airport, but greater government scrutiny of people\\\\\\&amp;#039;s records and electronic surveillance of their communications. The watershed, officials tell FRONTLINE, was the government\\\\\\&amp;#039;s shift after 9/11 to a strategy of pre-emption at home -- not just prosecuting terrorists for breaking the law, but trying to find and stop them before they strike.\n\nPresident Bush described his anti-terrorist measures as narrow and targeted, but a FRONTLINE investigation has found that the National Security Agency (NSA) has engaged in wiretapping and sifting Internet communications of millions of Americans; the FBI conducted a data sweep on 250,000 Las Vegas vacationers, and along with more than 50 other agencies, they are mining commercial-sector data banks to an unprecedented degree.\n\nEven government officials with experience since 9/11 are nagged by anxiety about the jeopardy that a war without end against unseen terrorists poses to our way of life, our personal freedoms. \\\\\\&quot;I always said, when I was in my position running counterterrorism operations for the FBI, \\\\\\&amp;#039;How much security do you want, and how many rights do you want to give up?\\\\\\&amp;#039;\\\\\\&quot; Larry Mefford, former assistant FBI director, tells Smith. \\\\\\&quot;I can give you more security, but I\\\\\\&amp;#039;ve got to take away some rights. ? Personally, I want to live in a country where you have a common-sense, fair balance, because I\\\\\\&amp;#039;m worried about people that are untrained, unsupervised, doing things with good intentions but, at the end of the day, harm our liberties.\\\\\\&quot;\n\nPeter Swire, a law professor and former White House privacy adviser to President Clinton, tells FRONTLINE that since 9/11 the government has been moving away from the traditional legal standard of investigations based on individual suspicion to generalized suspicion. The new standard, Swire says, is: \\\\\\&quot;Check everybody. Everybody is a suspect.\\\\\\&quot;\n\nWindows Media format 512x288 pixels, 22Khz stereo audio\n\nChapters 1-5\n\n\nplus: Total Information Awareness\n\nIn this Web-exclusive video, Robert Popp, TIA\\\\\\&amp;#039;s deputy director; Steve Lukasik, a former head of DARPA and a terrorist-tracking team leader on TIA; and David Holtzman, a former NSA data miner and current privacy advocate, explain the concepts behind the program -- including the development of privacy protections, debate whether it could work, and lament the lack of public discussion now that elements of the program are being pursued outside of the public eye. \n\n\nFrom Interview with Mark Klein, former AT&amp;T Technician\n\n\\\\\\&quot;...finally it dawned on me sort of all at once, and I almost fell out of my chair, because this showed, first of all, what they had done, that they had taken working circuits, which had nothing to do with a splitter cabinet, and they had taken in particular what are called peering links which connect AT&amp;T\\\\\\&amp;#039;s network with the other networks. It\\\\\\&amp;#039;s how you get the Internet, right? One network connects with another. So they took 16 high-speed peering links which go to places like Qwest [Communications] and Palo Alto Internet Exchange [PAIX] and places like that. ? These circuits were working at one point, and the documents indicated in February 2003 they had cut into these circuits so that they could insert the splitter so that they can get the data flow from these circuits to go to the secret room.\\\\\\&quot;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/pages/frontline/homefront/interviews/klein.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/pages/frontline/homefront/interviews/klein.html&lt;/a&gt;\n\n\nplus: att_klein_wired.pdf\n\nMark Klein\\\\\\&amp;#039;s original document on NSA Internet spying, including AT&amp;T diagrams.\n\n","torrent":{"xt":"urn:btih:6ba5130105960a02261b4a95a9fd2c602b225f5a","amp;dn":"Spying+on+the+Home+Front+%28Frontline+PBS+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba5130105960a02261b4a95a9fd2c602b225f5a","infoHashBuffer":{"type":"Buffer","data":[107,165,19,1,5,150,10,2,38,27,74,149,169,253,44,96,43,34,95,90]},"announce":[],"urlList":[]}}