{"title":"It's My_Country_Too_-_Muslims_in_America.avi","uid":3565020,"size":373684572,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:6cbad6af929a8a3b398ca6579b160412e9f77e37&amp;dn=It%5C%27s+My_Country_Too_-_Muslims_in_America.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hasnain","files":1,"time":1164511098,"description":" &lt;a href=&quot;http://news.bbc.co.uk/1/hi/programmes/this_world/4340611.stm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://news.bbc.co.uk/1/hi/programmes/this_world/4340611.stm&lt;/a&gt;\n\n\n&quot;It&amp;#039;s My Country Too  \n \nSalman Ahmed wants to reach out to young American Muslims \nSince 9/11 the US is a changed country... especially for Muslims. \n\nIslam is one of the fastest-growing religions in the US. Yet one in four Americans regard Muslims living among them with suspicion. \n\nAnd what if you are an American and a Muslim? \n\nThis World follows Salman Ahmed, founding member of successful rock band Junoon, as he explores what it means to be an American Muslim these days. \n\nSalman says: &quot;I never thought about my religion in a sense that I have to explain it to the rest of the world.&quot; \n\nBut as non-Muslims search for answers, this is exactly what they seem to be asking of their fellow citizens. \n\nSalman talks to taxi drivers, students and law reform campaigners, including a mother whose desperate search for her Muslim son after 9/11 turned her into a political activist. \n\nHe also speaks to a group of Muslim comics, a new force in the fight to combat mutual fear and suspicion. \n\nBut, is there such a difference between American and Islamic values? \n\nMany would argue not. In fact, traditionally, the Muslim community have felt comfortable living in a country that puts so much emphasis on religion as an intrinsic part of politics. \n\nSalman&amp;#039;s cousin Ali is a founding member of the website Muslims for Bush and admires the president&amp;#039;s frequent references to God. &quot;I want him to talk about God more often, I want him to bring in his Christian values, because those are values that most Muslims share.&quot; \n\nHowever, Ali now seems to be in the minority. In contrast to voting patterns in 2000, many American Muslims voted against a Republican administration in 2004. \n\n&quot;Unlike some other parts of the world, where Muslims seem to see themselves just as victims,&quot; Salman says, &quot;American Muslims are fighting for their rights, and blending Islam with the modern American identity.&quot;\n\n \n&quot;","torrent":{"xt":"urn:btih:6cbad6af929a8a3b398ca6579b160412e9f77e37","amp;dn":"It%5C%27s+My_Country_Too_-_Muslims_in_America.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cbad6af929a8a3b398ca6579b160412e9f77e37","infoHashBuffer":{"type":"Buffer","data":[108,186,214,175,146,154,138,59,57,140,166,87,155,22,4,18,233,247,126,55]},"announce":[],"urlList":[]}}