{"title":"RARE, censored image of Gunnleiv Gundersen!","uid":3571381,"size":22004,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:6d66b03ec6435a820e3ddb2979de17c2c373cc13&amp;dn=RARE%2C+censored+image+of+Gunnleiv+Gundersen%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ea001","files":1,"time":1165357397,"description":"This is an extremely rare and censored photography of Gunnleiv Gundersen. There is no other, uncensored, digital copy of this photography, and the original, uncensored paper edition is located in a secret bunker in the Soviet Union (God bless the Motherland of us all, and may it forever last and free the World from the capitalism), which is guarded by the Soviet (God bless the Motherland of us all, and may it forever last and free the World from the capitalism) military defence, Soviet (God bless the Motherland of us all, and may it forever last and free the World from the capitalism) secret agents and other Soviet (God bless the Motherland of us all, and may it forever last and free the World from the capitalism) security forces from the Soviet Union (God bless the Motherland of us all, and may it forever last and free the World from the capitalism) and the Soviet (God bless the Motherland of us all, and may it forever last and free the World from the capitalism) KGB (God bless the Sword and the Shield, and may they forever fight against and protect us from the capitalism).","torrent":{"xt":"urn:btih:6d66b03ec6435a820e3ddb2979de17c2c373cc13","amp;dn":"RARE%2C+censored+image+of+Gunnleiv+Gundersen%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d66b03ec6435a820e3ddb2979de17c2c373cc13","infoHashBuffer":{"type":"Buffer","data":[109,102,176,62,198,67,90,130,14,61,219,41,121,222,23,194,195,115,204,19]},"announce":[],"urlList":[]}}