{"title":"NCH_IVM_Answering Machine&amp;Virtual PBX  4.01 and Keygen","uid":3707272,"size":698586,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e13671db8a1e9d33127c465c75fd35a2ce5b48d&amp;dn=NCH_IVM_Answering+Machine%26Virtual+PBX++4.01+and+Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zcxadmin","files":1,"time":1181184540,"description":"IVM Voicemail Software\nComplete voice mail solution for Windows\nIVM is voicemail software for Windows PCs. This program can be used to create an effective voice mail solution from a single line after hours answering machine to a 64 line corporate system with thousands of voicemail boxes whether you have standard telephone lines or VoIP services.\n\nSetting up a PC Voice mail system is easy. Download the software and install it on any Windows PC. For professional or multiline installations we recommend a telephony board to connect to the phone line(s). For home single line use a voice modem in the PC may be sufficient. VoIP services can be used to receive calls directly via the Internet or from a VoIP PBX without any special hardware.\n\nThe list of features follows but a quick way to see how IVM PC Voicemail system works is to download and install now. You don&amp;#039;t need to purchase to download and it only takes a couple of minutes to complete the process (click here to install). After you have tested IVM and found it to be suitable, you can purchase a location license (click here to purchase).\n\nClick here to see more IVM Voicemail Software screenshots\n\nMore Screenshots &gt;&gt;\n\t\tFeatures\n\n    * Multiple telephone line support (1 - 64 lines simultaneously).\n    * Supports concurrent PSTN and VoIP lines.\n    * Unlimited voice mail boxes (each with own email forward, internet access page or remote access).\n    * Free professionally voiced greetings included.\n    * Text-to-speech voice synthesis as an alternative to recording or importing wav or mp3 files.\n    * Ability to forward messages by email or upload to Internet.\n    * Remote access messages over the network or Internet using your web browser.\n    * Listen to messages by dialing in.\n    * Save messages as wav of mp3 files.\n    * Unlimited (selectable) out-going messages and menus.\n    * Fully programmable setup with examples and free plugins available for typical applications.\n    * Call transfer (subject to your phone company or PBX features).\n    * Call simulator is included so you can test your systems off-line.\n    * Call key select menus and ability for caller to enter numbers (data entry).\n    * Auto-hours feature will turn voicemail on or off automatically at different times of day.\n    * Highly configurable and flexible PC based voice mail system. \n\nSystem Requirements\n\n    * Windows 95/NT4/98/2000/Me/XP/2003/Vista.\n    * To link to phone lines one of the following:\n          o Professional TAPI telephony card (eg. CallURL, CAHTA, Synway etc.) more info...\n          o VoIP (SIP) service for voice over IP lines more info...\n          o Voice Modem (TAPI compliant) more info... \n    * To link through a PBX or telephone system the PBX must either be:\n          o Able to link to external analog port / socket; or,\n          o A SIP compliant VoIP PBX (try Axon Virtual PBX if you don&amp;#039;t have one). \n\nIf you intend to use the IVM with a voice modem, please note that there are many voice modems on the market with defective TAPI wave / voice drivers. If you have difficulties with your modem, please see the Trouble-Shooting page of the IVM Help Pages for some solutions to modem driver problems.","torrent":{"xt":"urn:btih:6e13671db8a1e9d33127c465c75fd35a2ce5b48d","amp;dn":"NCH_IVM_Answering+Machine%26Virtual+PBX++4.01+and+Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e13671db8a1e9d33127c465c75fd35a2ce5b48d","infoHashBuffer":{"type":"Buffer","data":[110,19,103,29,184,161,233,211,49,39,196,101,199,95,211,90,44,229,180,141]},"announce":[],"urlList":[]}}