{"title":"NOD32 2.70.25 Antivirus for Windows 32-bit/64-bit","uid":3593082,"size":12298974,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:702b39d39c25a7f630ef844be208f9a910346029&amp;dn=NOD32+2.70.25+Antivirus+for+Windows+32-bit%2F64-bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Brain_Stew","files":1,"time":1168373348,"description":"Keep your important information safe &amp; stay productive with peace of mind. NOD32 offers fast, comprehensive protection against a wide range of malware threats ? without the burden of a bloated internet security suite. So easy to use: just set it and forget it.\n\n   * Comprehensive Protection. Running separate applications for viruses, hackers, adware, and spyware can slow your PC, be difficult to manage, and provide questionable protection. Beware of large, bloated internet security suites that consume hundreds of megabytes on your PC. These typically exist because vendors have acquired products and &amp;#039;bundled&amp;#039; them together. In contrast, ESET NOD32 was designed from the core as a single, highly-optimized engine that works as a unified Anti-Threat system to protect against a broad spectrum of malware. Viruses, worms, spyware, and other malicious attacks, which are constantly evolving. ESET NOD32 utilizes patent-pending ThreatSenseÂ® Technology to detect tomorrow&amp;#039;s threats in real-time, by analyzing code execution for malicious intent - keeping you ahead of the malware-writers.\n\n   * Minimal Performance Impact. NOD32 conserves resources in memory and on disk, leaving more for your critical applications. The installer is just 11 MB and the application consumes an average 23 MB in memory (this fluctuates with changes to the detection technology). ThreatSense updates, which includes heuristics logic and signatures, are usually between 20 kB and 50 kB. Switch to NOD32 and be more productive.\n\n   * Fastest Scanning. Great protection doesn&amp;#039;t have to slow down your computer. Written largely in assembly language, NOD32 continually wins awards for the fastest performance of any antivirus application, on average 3 to 34 times faster than the competition (source: Virus Bulletin). Switch to NOD32 and upgrade your computer&amp;#039;s performance.\n\n   * Easy to Manage. Program and database updates are automatically performed behind the scenes. If you&amp;#039;re an individual or home office user you can just &amp;#039;set it and forget it.&amp;#039; Businesses and organizations with large distributed networks can use the powerful Remote Administrator to centrally deploy, install, monitor and manage thousands of NOD32 workstations and servers. Get the best protection with the smallest footprint and fastest performance. NOD32 offers multiple layers of protection for your organization, at the desktop, file server and mail gateway. Find out which solution is best for you.\n\n   * Proactive Real-Time Detection. The best security is proactive. Malware protection must be real-time at the point of impact. Every minute one waits for a virus signature update creates a window of vulnerability that could have devastating consequences. ESET NOD32&amp;#039;s ThreatSenseÂ® Technology closes the window of vulnerability left open by other reactive , signature-based responses.\n\n\nOperating System:\n\n   * Microsoft Windows NT 4.0, 2000 and 2003 Server\n   * Microsoft Windows XP Home and Professional, including Windows XP Professional x64 Edition, Windows Vista 32-bit and 64-bit","torrent":{"xt":"urn:btih:702b39d39c25a7f630ef844be208f9a910346029","amp;dn":"NOD32+2.70.25+Antivirus+for+Windows+32-bit%2F64-bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"702b39d39c25a7f630ef844be208f9a910346029","infoHashBuffer":{"type":"Buffer","data":[112,43,57,211,156,37,167,246,48,239,132,75,226,8,249,169,16,52,96,41]},"announce":[],"urlList":[]}}