{"title":"Anti-Creationist Videos","uid":3833460,"size":741416888,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:709ef65f89c98307e12cd0ce99cb239d66593e59&amp;dn=Anti-Creationist+Videos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"riversonthemoon","files":29,"time":1191784685,"description":"Credit for these fantastic videos goes to cdk007. In his own words :\n\\\\\\&quot;My goal on YouTube is not to change anyone\\\\\\&amp;#039;s mind but rather to give those who are seeking information the truth in the form of hard scientific facts and in the process expose many who claim to offer the truth as liars.\\\\\\&quot;\nI\\\\\\&amp;#039;ve found his videos an invaluable resource. He recently released all these videos for public use. \n\\\\\\&quot;I\\\\\\&amp;#039;m releasing all of my videos concerning the theory of evolution and their accompanying programs for public consumption. Feel free to download them and use them however you like. If anyone is willing to host them on a website feel free (I thinkwill delete them after 1 month of no downloads). These files will remain on YouTube so anyone thinking of quote mining or taking my videos out of context will easily be spotted.\\\\\\&quot;\n\n\n\n\n\nBanned YouTube Atheist Condemns Religion With New Book\n\nDerby, UK, 27 March 2007 - While books from Richard Dawkins and Sam Harris, openly promoting atheism, continue to ride high on the best-seller list, author and popular video blogger Nick Gisburne has written a new book for atheists, provocatively titled The Atheists Are Revolting! Its central theme: give no respect to a belief system based on an ancient, out-dated book of folklore, for which there is no proof.\n\nPart of the rising phenomenon known as the YouTube Atheists, Nick Gisburne was controversially banned from the YouTube site in 2007, but has returned with a feast of short, sharp arguments to rattle the foundations of Christianity. This book is a literary middle finger for atheists to raise up high during heated debates with the faithful.\n\nAn outspoken atheist, Gisburne at times openly parodies religion and its followers, but is always doggedly persistent as he hacks at the shiny veneer of the Christian doctrine \\\\\\&amp;#039;God is love\\\\\\&amp;#039;. Not far beneath is revealed a mythical being with Mafia-like qualities, and the true message of the Christian religion: \\\\\\&amp;#039;serve God or burn\\\\\\&amp;#039;.\n\nFrom The God Delusion (Richard Dawkins) to The End of Faith (Sam Harris), from The Blasphemy Challenge (The Rational Response Squad), to the documentary The God Who Wasn\\\\\\&amp;#039;t There (Brian Flemming), atheists continue to make news. Modern atheists now dare to openly challenge religion in society, demanding equal air time against the background of an increasingly intolerant and divisive religious/political environment.\n\n\\\\\\&quot;Christian Evangelists want to tell you that the Earth is 6,000 years old and that dinosaurs and humans once lived together,\\\\\\&quot; says Gisburne. \\\\\\&quot;They want to convince us that Intelligent Design (in layman\\\\\\&amp;#039;s terms \\\\\\&amp;#039;God did it\\\\\\&amp;#039;) is a serious scientific alternative to Evolution. But to atheists God is no more real than Santa... and at least Santa doesn\\\\\\&amp;#039;t threaten to take away your toys and burn you in Hell if you stop believing in him.\\\\\\&quot;\n\nNick Gisburne was born (as we all are) an atheist. He lives in the UK, a country where religion is seen as little more than Sunday service and tea with the vicar. However the rise of fundamentalist Christianity, and its ruthless condemnation of non-believers, means that Americans find it increasingly difficult to \\\\\\&amp;#039;come out\\\\\\&amp;#039; as atheists to their friends, families and co-workers. The Atheists Are Revolting! gives those who do not believe in God the tools to speak up and defend their views in the face of strong opposition from those who do.\n\n\\\\\\&quot;There is no God. Moreover there is no need for God, any god.\\\\\\&quot; These are ideas put forward by Nick Gisburne in varied and colourful terms. The Atheists Are Revolting! is Nick Gisburne\\\\\\&amp;#039;s first book, and his second is already under way. An audio version of the book will be available April 2007. \n\n\n\n\n\n\nWhat\\\\\\&amp;#039;s funny about war, poverty, ignorance, bigotry, neo-conservatism, homophobia, greed, lust and fear? Ask Roy Zimmerman. He\\\\\\&amp;#039;s been writing satirical songs for twenty years.\n\nThe Los Angeles Times says, \\\\\\&quot;Zimmerman displays a lacerating wit and keen awareness of society\\\\\\&amp;#039;s foibles that bring to mind a latter-day Tom Lehrer.\\\\\\&quot;\n\nTom Lehrer himself says, \\\\\\&quot;I congratulate Roy Zimmerman on reintroducing literacy to comedy songs. And the rhymes actually rhyme, they don\\\\\\&amp;#039;t just \\\\\\&amp;#039;rhyne.\\\\\\&amp;#039;\\\\\\&quot;\n\nJoni Mitchell says, \\\\\\&quot;Roy\\\\\\&amp;#039;s lyrics move beyond poetry and achieve perfection.\\\\\\&quot;\n\nThere\\\\\\&amp;#039;s a decidedly Lefty slant to his lyrics. \\\\\\&quot;We used to have a name for Right Wing satire,\\\\\\&quot; he says. \\\\\\&quot;We called it \\\\\\&amp;#039;cruelty.\\\\\\&amp;#039;\\\\\\&quot;\n\nZimmerman has played clubs across the country, and shared the stage with George Carlin, Bill Maher, Kate Clinton, Dennis Miller, Sandra Tsing Loh, kd lang, Andy Borowitz and Paul Krassner. He\\\\\\&amp;#039;s done several shows with The Pixies\\\\\\&amp;#039; Frank Black, swapping songs in a solo acoustic setting. His up-to-the-moment topical songs are featured on American Public Media\\\\\\&amp;#039;s syndicated broadcast \\\\\\&quot;Weekend America\\\\\\&quot; and Sirius Radio\\\\\\&amp;#039;s \\\\\\&quot;West Coast Live.\\\\\\&quot;\n\nHe\\\\\\&amp;#039;s currently touring a one-man show called \\\\\\&quot;Faulty Intelligence.\\\\\\&quot; It\\\\\\&amp;#039;s a ninety minute theatrical presentation of Zimmerman\\\\\\&amp;#039;s original songs and comic commentary - an inidictment of the Bush administration to accompany Patrick Fitzgerald\\\\\\&amp;#039;s.\n\nAnd there\\\\\\&amp;#039;s a new album to go with it. \\\\\\&quot;Faulty Intelligence\\\\\\&quot; the CD contains a lesson in Intelligent Design, \\\\\\&quot;Creation Science 101;\\\\\\&quot; an Elvis sounding love song to the government phone tappers called \\\\\\&quot;Hello, NSA\\\\\\&quot; that\\\\\\&amp;#039;s featured on the ACLU web site; and the bawk-along \\\\\\&quot;Chickenhawk,\\\\\\&quot; already a Zimmerman classic. He says, \\\\\\&quot;I hope this record gets good reviews, but mostly I hope it gets denied under oath by Karl Rove.\\\\\\&quot;\n\nZimmerman\\\\\\&amp;#039;s fourth CD is a Holiday offering called PeaceNick. It\\\\\\&amp;#039;s Lefty, Pacifist, Humanist satire celebrating the birth of the Prince of Peace in a time of pre-emptive war. The disc takes a snipe at militaristic merchandising with \\\\\\&quot;Buy War Toys for Christmas,\\\\\\&quot; and thumbs its nose at the War on Christmas - an absurd notion promoted by Bill O\\\\\\&amp;#039;Reilly and his ilk - with the Happy Holidays song \\\\\\&quot;Christma-Hanu-Rama-Ka-Dona-Kwanzaa.\\\\\\&quot; The Dylan-esque \\\\\\&quot;Christmas is Pain,\\\\\\&quot; another Zimmerman classic in the mold of another Zimmerman, receives wide airplay every Holiday Season.\n\nHomeland and Security are a twin pair of CD releases arising in the aftermath of the 9-11 disaster. In 23 scathing originals, Roy dissects the jingoism, belligerence and plain addle-headedness of Bush and Company\\\\\\&amp;#039;s response. Homeland takes on domestic threats, among them the \\\\\\&quot;Patriot Act\\\\\\&quot; and \\\\\\&quot;Jerry Falwell\\\\\\&amp;#039;s God.\\\\\\&quot; This disc also contains Roy\\\\\\&amp;#039;s heartfelt love song to his wife, \\\\\\&quot;You.\\\\\\&quot; Security widens the satirical bite to include a \\\\\\&quot;Multinational Anthem\\\\\\&quot; and the mock-inspirational \\\\\\&quot;One World, One Bank.\\\\\\&quot;\n\nRoy\\\\\\&amp;#039;s first solo release was Comic Sutra, a mixture of the personal and the political and the personal that is political including the same-sex marriage anthem, \\\\\\&quot;Defenders of Marriage,\\\\\\&quot; and \\\\\\&quot;Punish the People,\\\\\\&quot; a happy-go-lucky paean to class warfare.\n\n\\\\\\&quot;Punish the People\\\\\\&quot; is also featured on the compilation CD Laughter is a Powerful Weapon, released to raise money for the Red Cross in the wake of Hurricane Katrina.\n\nRoy wrote the song \\\\\\&quot;I\\\\\\&amp;#039;m Fired\\\\\\&quot; for the Los Angeles Theatre Works production of \\\\\\&quot;Fired!\\\\\\&quot; and performed in the show at the Skirball Center for the Performing Arts in Los Angeles and Off-Broadway at New York\\\\\\&amp;#039;s Second Stage Theatre.\n\nPerforming at New York City\\\\\\&amp;#039;s Symphony Space during the 2004 Republican Convention, he drew this review from the New York Times: \\\\\\&quot;Roy Zimmerman lifted the evening with his song \\\\\\&amp;#039;Chickenhawk,\\\\\\&amp;#039; ridiculing the military policies of Bush administration officials who didn\\\\\\&amp;#039;t serve in the armed forces. Zimmerman\\\\\\&amp;#039;s squawking and clucking conveyed his scorn with contagious irreverence.\\\\\\&quot;\n\nZimmerman founded and wrote all the material for the comedy folk quartet The Foremen, who recorded four albums, two of them for Warner/Reprise Records. The Foremen toured extensively, playing the nation\\\\\\&amp;#039;s major folk venues, a lot of fancy Progressive benefits, Pete Seeger\\\\\\&amp;#039;s Clearwater Festival (under an overpass in the rain) and CBGB\\\\\\&amp;#039;s. They even warmed up the crowd for President Bill Clinton.\n\nZimmerman wrote over five hours of satire for the group. \\\\\\&quot;We never did it all at once,\\\\\\&quot; he reports, \\\\\\&quot;but we kept it ready in case we had to filibuster.\\\\\\&quot; Metaphor Records has just released The Best of The Foremen with 16 tracks culled from the band\\\\\\&amp;#039;s first two CDs plus a substantial bonus section of long-lost gems from the archives.\n\nThe group was featured on NPR\\\\\\&amp;#039;s \\\\\\&quot;All Things Considered,\\\\\\&quot; and many other syndicated talk radio shows. They shared the air with Al Franken on NPR\\\\\\&amp;#039;s \\\\\\&quot;Talk of the Nation.\\\\\\&quot; They got to sing Zimmerman\\\\\\&amp;#039;s lampoon of Oliver North, \\\\\\&quot;Ollie Ollie Off Scot Free\\\\\\&quot; directly to the colonel himself on North\\\\\\&amp;#039;s own syndicated show. \\\\\\&quot;Friends,\\\\\\&quot; said North, \\\\\\&quot;this is a very weird group.\\\\\\&quot;\n\n\\\\\\&quot;Firing the Surgeon General,\\\\\\&quot; Zimmerman\\\\\\&amp;#039;s song full of euphemisms for masturbation, was used in MTV\\\\\\&amp;#039;s \\\\\\&quot;Sex in the Nineties\\\\\\&quot; documentary.\n\nThe LA Weekly reports, \\\\\\&quot;Removed from The Foremen, Zimmerman writes considerably more caustic stuff, attacking personal politics as well as international.\\\\\\&quot;\n\nJeff Penalty, lead singer for The Dead Kennedys, reviewed Roy\\\\\\&amp;#039;s show for the Punk music magazine Scratch, calling Roy, \\\\\\&quot;a unique type of superhero who possesses the power to nearly coax urine from the unwilling bladders of his audience members (via laughter). He delivered some of the smartest satirical songs that I\\\\\\&amp;#039;d ever heard.\\\\\\&quot;\n\nRoy\\\\\\&amp;#039;s satirical revues \\\\\\&quot;Yup!\\\\\\&quot; and \\\\\\&quot;Up the Yup!\\\\\\&quot; written and performed for The San Jose Repertory Company in the 1980s, became the longest-running shows in San Jose history. In 2005, Roy wrote the opening number for the 37th Annual Writers Guild Awards show in Hollywood, a song appropriately titled, \\\\\\&quot;I Wrote That.\\\\\\&quot;\n\nAsk Zimmerman about his influences, and have a pencil ready. Steeped in musical theatre, he was fascinated at an early age with the ingenious economy of Irving Berlin, the witty innuendo of Cole Porter and the high-wire rhyme and reason of Stephen Sondheim.\n\nYou can hear The Beatles and The Beach Boys in there, but folk influences loom large as well -- Phil Ochs\\\\\\&amp;#039; unapologetic blend of humor and politics, Pete Seeger\\\\\\&amp;#039;s unflagging commitment to social justice, The Roches\\\\\\&amp;#039; eccentric soulfulness.\n\nWoody Guthrie, The Weavers and Dylan are obvious lights in Roy\\\\\\&amp;#039;s pantheon. Other favorite writers are Tom Lehrer for his hilarious and impeccably crafted topicality, Ani DiFranco for her marriage of brilliance and bravery and Joni Mitchell for her seamless union of sound and sense.\n\n\\\\\\&quot;There\\\\\\&amp;#039;s nothing funny about World Peace,\\\\\\&quot; Roy observes. \\\\\\&quot;Social Justice never killed at The Comedy Store. If we ever attain a worldwide consciousness of peace and justice, I\\\\\\&amp;#039;ll be happily out of a job. But as long as power corrupts, I\\\\\\&amp;#039;ll absolutely have a career.\\\\\\&quot;\n\nZimmerman lives in Marin County with his wife and frequent co-writer Melanie Harby and their two boys. \n &lt;a href=&quot;\nhttp://www.royzimmerman.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.royzimmerman.com/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:709ef65f89c98307e12cd0ce99cb239d66593e59","amp;dn":"Anti-Creationist+Videos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"709ef65f89c98307e12cd0ce99cb239d66593e59","infoHashBuffer":{"type":"Buffer","data":[112,158,246,95,137,201,131,7,225,44,208,206,153,203,35,157,102,89,62,89]},"announce":[],"urlList":[]}}