{"title":"Firestarter 2_Rekindled FullDVD","uid":3697992,"size":7946510383,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:70d4cd84a55707819d3c58c6fe71e10d09343ad9&amp;dn=Firestarter+2_Rekindled+FullDVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"silvia-","files":22,"time":1180221084,"description":"FIRESTARTER 2: Rekindled\n\n[img]http://www.dvdoo.dk/dvdoo/images/movies/350pix/fronts/firestarter22dk_f.jpg[/img]\n\nStars: Malcolm McDowell, Marguerite Moreau, Danny Nucci\nOther Stars: Dennis Hopper, Skye McCole Bartusiak, John Dennis Johnston, Darnell Williams, Deborah Van Valkenburgh\nDirector: Robert Iscove\nDVD Release Date: 05/28/2002\nRun Time: 168 min.\nGenre: Science Fiction\nAudio: Dolby Digital 5.1: English, Spanish and Italian.\nSubtitles: English, Spanish, Portuguese, Italian, Polish, Slovakian, Serbio, Croatian.\nInteractive Features: Scene Access, Interactive Menus, Text/Photo Galleries, Filmographies\nSystem: PAL, Widescreen.\nFull DVD9\n\nThe child who could start fires with her mind is all grown up and still trying to find out the truth about what happened to her in this made-for-TV sequel to the sci-fi fantasy Firestarter. Nearly 20 years ago, Charlene &quot;Charlie&quot; McGee (Marguerite Moreau) was trained by a mysterious government organization who wanted to exploit her special and very dangerous gift, though Charlie learned the government operatives were not to be trusted when they murdered her parents. Charlie ran away from them as a child, but now in her mid-twenties, she&amp;#039;s decided she wants to know more about the people who shaped her strange destiny -- just as Rainbird (Malcolm McDowell), the man who shaped Charlie&amp;#039;s pyrotechnic gift years before, finally finds her after years of search. To Charlie&amp;#039;s horror, she discovers a number of other children with bizarre talents. Charlie is soon on the run from Rainbird again, and her only allies in flight are a former associate of Rainbird turned enemy of the state (Danny Nucci) and fellow test subject (Dennis Hopper). Firestarter: Rekindled originally aired as a two-part miniseries on the Sci-Fi network on March 10 and 11, 2002. \n\nMore info: \nwww.mundovob.eu/foro\n","torrent":{"xt":"urn:btih:70d4cd84a55707819d3c58c6fe71e10d09343ad9","amp;dn":"Firestarter+2_Rekindled+FullDVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70d4cd84a55707819d3c58c6fe71e10d09343ad9","infoHashBuffer":{"type":"Buffer","data":[112,212,205,132,165,87,7,129,157,60,88,198,254,113,225,13,9,52,58,217]},"announce":[],"urlList":[]}}