{"title":"Iris - Awakening[APE - LOSSLESS]","uid":3831838,"size":384425350,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70d66da8544da9b61115a965ddca162a4e983a0b&amp;dn=Iris+-+Awakening%5BAPE+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"99AM","files":12,"time":1191679734,"description":"APE Image + CUE Sheet + Covers\nRelease Date: May 1, 2003\n\n\nTrack Listing:\n1. Whatever\n2. When I Am Not Around\n3. Sentimental Scar\n4. Unknown\n5. Sorrow Expert\n6. You&amp;#039;re the Answer\n7. In Spite\n8. Vacant\n9. Wait Move On\n10. Island\n\nReview from Electrogarden Network:\nWhen the word &quot;hype&quot; gets kicked around, Iris immediately come to mind. Rarely is an independent synthpop act so built up by its fans. Even rarer does such a band deliver. So you can imagine my surprise when I finally got some time alone with Iris&amp;#039; latest offering, Awakening, and discovered just how much it does live up to the hype.\n\nIt&amp;#039;s hard to know what to listen for on a record like this. It&amp;#039;s easy to get lost in the sounds that Andrew Sega has created. The synths that wash over you, the ones that make your feet move, the ones that inspire. But just when you&amp;#039;re about to drift into space, the vocals bring you back. Reagan Jones delivers each song with staggering intensity. Not only does he have a unique voice, he proves that he is quite versatile as well.\n\nThis album is solid, and by solid, I mean it&amp;#039;s the first really strong album I&amp;#039;ve heard since 7red7&amp;#039;s Shelter. There isn&amp;#039;t a song on here that couldn&amp;#039;t stand on its own as a single. To a listener who&amp;#039;s grown tired of buying a crap album for two good songs, this is very refreshing. Ten good songs, all with excellent production and performance, what more could one\nask for?\n\nPerhaps a little less bass. It is a little bassy. But this is like pointing out a speck of dust on a Van Gogh. Just turn down the bass and all is well.\n\nAwakening is what the genre has been missing for so many years. This is how it&amp;#039;s done. So rare is it to find an album full of solid, listenable songs. I pray that other synth bands will take a lesson from this. I know I will.\n\nAbsolutely outstanding work. If we are lucky, the Iris boys will get another album together sometime before 2007.\n\nReview from Gothronic:\nIris proved with their earlier released single &amp;#039;Unknown&amp;#039; to be capable to write the perfect (synth)pop song. With the release of &amp;#039;Awakening&amp;#039; the band shows that this is not a lucky hit, because this CD is filled from &amp;#039;&amp;#039;Whatever&amp;#039; to &amp;#039;Island&amp;#039; with class and artful songs. There are enough highlights, but most striking is the perfect, emotional voice of Reagan Jones (listen for instance to the ballad &amp;#039;When I&amp;#039;m Not Around&amp;#039;). Every song contains the right emotion and the band has succeeded in writing some beautiful songs with a real beginning and an end. From songs to dance on, like &amp;#039;You&amp;#039;re The Answer&amp;#039; (originally from Seven Red Seven) until deep emotion filled ballads like &amp;#039;In Spite&amp;#039; Iris proves to be the master of the class. People who are into acts like Depeche Mode, Wolfsheim, etc should have this one. ","torrent":{"xt":"urn:btih:70d66da8544da9b61115a965ddca162a4e983a0b","amp;dn":"Iris+-+Awakening%5BAPE+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70d66da8544da9b61115a965ddca162a4e983a0b","infoHashBuffer":{"type":"Buffer","data":[112,214,109,168,84,77,169,182,17,21,169,101,221,202,22,42,78,152,58,11]},"announce":[],"urlList":[]}}