{"title":"Destroy_All_Humans_2_XBOX-ProjectX","uid":3544046,"size":2320470405,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:719830f2d995162f6fb7b05ba1cc6e6ebfe1d720&amp;dn=Destroy_All_Humans_2_XBOX-ProjectX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Eugordon","files":49,"time":1161551306,"description":"THE WITCH PRESENTS\n\nMake War Not Love. Sequel to the widely acclaimed hit  Destroy All Humans!\n2 takes the brands irreverent Sci-Fi action gaming experience into the\nswinging sixties with new and improved game features, open-world gameplay\nand co-op multiplayer. Set against a backdrop of free love, the Cold War and\nother 60s era icons, DAH 2 takes players around the world with an upgraded\narsenal of weapons and enhanced mental abilities to battle a variety of enemies\nfrom secret agents and giant creatures, to Soviet Forces and alien warriors.\n\nPlay As The Alien  DAH turns the tables on traditional sci-fi action games\nallowing gamers to play as the Alien and take on the most feared enemy in the\ngalaxy  mankind\n\nUnleash Massive Destruction - Players have total freedom to destroy anything\nand manipulate everything in the world\n\nProbe the World  Never leave the game world as you explore open-world game\nenvironments  from Bay City (San Francisco), Albion (London), Takoshima Island\n(Tokyo) and Tunguska (Russia)\n\nCo-Op Multiplayer  Team up with another player and Destroy All Humans together\nvia split-screen Co-Op Game mode. Play through the entire single player game\ntogether or replay missions already completed in single player mode.\n\nNew and Enhanced Weapons  Old weapons like the Zap-o-nithium receive a destructive makeover while new weapons  The Meteor Strike, nithiator and Gastro Gun are\nadded to the alien arsenal, along with new hidden weapons to discover\n\nNew and Enhanced Mental Abilities  All abilities are upgradeable and include old\nfavorites like PK, Cortex Scan and Hypno Blast. New alien abilities include the\nTransmogrify, Mind Flash and Body Snatching abilities\n\nDeveloped by Pandemic Studios creators of critically acclaimed games Full Spectrum\nWarrior, Mercenaries and Star Wars Battlefront.\n","torrent":{"xt":"urn:btih:719830f2d995162f6fb7b05ba1cc6e6ebfe1d720","amp;dn":"Destroy_All_Humans_2_XBOX-ProjectX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"719830f2d995162f6fb7b05ba1cc6e6ebfe1d720","infoHashBuffer":{"type":"Buffer","data":[113,152,48,242,217,149,22,47,111,183,176,91,161,204,110,110,191,225,215,32]},"announce":[],"urlList":[]}}