{"title":"Belltech Greeting Card Designer v4.7","uid":3852931,"size":48702397,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71d803637d5c4da86eb6015473e6d80cdede7418&amp;dn=Belltech+Greeting+Card+Designer+v4.7+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nxter12","files":6,"time":1193024221,"description":"Design personalized cards for Birthdays, Wedding, New Year, anniversaries, Valentine&amp;#039;s Day or any special occasion. The program comes with tons of card templates, clip art, background pictures to get you started. For fast output, you just choose a template, personalize the messages and print, that&amp;#039;s all; Also, use shapes like heart, call-out, moon, sun etc. to make your card even more interesting.\nDownload this Greeting Card creator and try it now!!\n\n\n\n\nProduct Highlights:\n\n* Quick and Easy Design: Why bother going to store spending hours looking for a perfect greeting card and then buying something that you don&amp;#039;t like? Use our easy-to-use software to create your perfect greeting card. Choose from readymade greeting, verse and then modify the way you like, select and draw shapes and text; resize, tilt, change color, fill with gradient color or do anything with your design elements to make the right card. And all that in a few minutes.\n\n* Use your own clip-arts, logo and photos: We supply you with many graphics that you can use, but don&amp;#039;t think that it is all you can use. Get your own picture, family photo, clip-art and design the perfect card you want.\n\n* Choose any layout: With is application you can create quarter-fold or half-fold cards. In quarter-fold you also choose create quarter-side-fold or quarter-top-fold cards.\n\n* Use templates and graphics: Don&amp;#039;t know how to start the layout of your card? Use our card templates, background and clip-arts to start with easily. Simple to use yet so powerful!\n\n* Convenient Design tools: Draw rectangle/triangle/circle or use freehand lines and shapes to create callout and lovely designs.\n\n* Stunning Background: Use the supplied backgrounds or use your own. Anything is possible and is easy.\n\n* Use Color blends: This is a unique feature of this greeting card software. You can now have a color blend the way you want, the control is in your hand. Remember, this is not a static background image, but a filled shape whose color-blend and texture you control completely.&quot; Possibilities are endless!\n\n* Supports any printing papers: Supports all standard greeting card papers(Half-fold and quarter-fold) from Avery and other suppliers.\n\n","torrent":{"xt":"urn:btih:71d803637d5c4da86eb6015473e6d80cdede7418","amp;dn":"Belltech+Greeting+Card+Designer+v4.7+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71d803637d5c4da86eb6015473e6d80cdede7418","infoHashBuffer":{"type":"Buffer","data":[113,216,3,99,125,92,77,168,110,182,1,84,115,230,216,12,222,222,116,24]},"announce":[],"urlList":[]}}