{"title":"Convert english xp to multi lang - mu57i11","uid":3814780,"size":103859723,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:722ca8adab984c8f85223e23431c2e5bfc5a5042&amp;dn=Convert+english+xp+to+multi+lang+-+mu57i11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mu57i11","files":219,"time":1190423340,"description":"Hi.\n\nConvert any English only xp into multi language xp - mu57i11\n\nThere are many torrents on tpb (Mine included) that offer &quot;pymped xp&amp;#039;s&quot; that have been &quot;tweaked&quot;. However what many people do (I&amp;#039;m also guilty of this) is remove all the other languages than English, which for most of you is ok, but for some of you this might not be the best &quot;tweak&quot; if you want your xp in another language other than English.\n\nThis release will add support for the following languages, regardless of what edition of xp you have and regardless of whats been done to it:\nAlgeria, Azeri, Azeri, Bahrain, Belarusian, Egypt, Estonian, Farsi,\nFYRO Macedonian, Georgian, Greek, Gujarati, Hebrew, Hindi, Hong Kong\nSAR, Iraq, Japanese, Jordan, Kannada, Kazakh, Konkani, Korean, Kuwait,\nKyrgyzstan, Latvian, Lebanon, Libya, Lithuanian, Macau SAR, Maldives,\nMarathi, Mongolia, Morocco, Nepali, Oman, Pashto, PRC, Punjabi, Qatar,\nSanskrit, Saudi Arabia, Simplified Chinese, Singapore, Syria, Taiwan,\nTamil, Tatar, Telugu, Thai, Traditional Chinese, Tunisia, Turkish,\nUAE, Ukrainian, Urdu, Uzbek, Vietnamese, Yemen, all other languages are still included with xp regardless of weather or not the languages folder has been deleeted.\n\nPlease note:\n\nThis is not actually a copy of xp (If you want one then please feel free to download http://thepiratebay.se/tor/3697076/Windows_xp_pro_sp2_incl_drivers__software_and_updates_ (may2007). - s/l ratio is a bit crap atm but 5 seeds should be enough to start off with until more of you seed once dl&amp;#039;d), this is a collection of files that will convert a normal xp release into a multi language one.\n\nIMPORTANT NOTES - READ THIS!!!!\n\n1: Please read the readme contained with in this download to find out how to integrate the languages into an xp image.\n2: I only speak English, which means that I can&amp;#039;t help you with this torrent if you can&amp;#039;t speak English.\n\nEnjoy.\n\n\n","torrent":{"xt":"urn:btih:722ca8adab984c8f85223e23431c2e5bfc5a5042","amp;dn":"Convert+english+xp+to+multi+lang+-+mu57i11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722ca8adab984c8f85223e23431c2e5bfc5a5042","infoHashBuffer":{"type":"Buffer","data":[114,44,168,173,171,152,76,143,133,34,62,35,67,28,46,91,252,90,80,66]},"announce":[],"urlList":[]}}