{"title":"CMU University Lecture Series - 2007-09-19 - Randy Pausch","uid":3811582,"size":364005376,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7240977c06278b367b20ab620aaaa5f4a8219ad6&amp;dn=CMU+University+Lecture+Series+-+2007-09-19+-+Randy+Pausch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheFooSOS","files":1,"time":1190183484,"description":"Randy Pausch\nRandy Pausch is a Professor of Computer Science, Human-Computer Interaction, and Design at Carnegie Mellon, where he was the co-founder of Carnegie Mellon&amp;#039;s Entertainment Technology Center (ETC). He was a National Science Foundation Presidential Young Investigator and a Lilly Foundation Teaching Fellow. He has consulted with Walt Disney Imagineering on the user interface design and testing of interactive theme park attractions, and with Google on user interface design, and has done Sabbaticals at Imagineering and Electronic Arts (EA). Dr. Pausch received his bachelors in Computer Science from Brown University and his Ph.D. in Computer Science from Carnegie Mellon University. He is the author or co-author of five books and over 70 articles, is the director of the Alice (www.alice.org) software project, and has been in zero-gravity.\n\n&quot;REALLY ACHIEVING YOUR CHILDHOOD DREAMS &quot;\n\nAbstract\n\nAlmost all of us have childhood dreams: for example, being an astronaut, or making movies or video games for a living. Sadly, most people don&amp;#039;t achieve theirs, and I think that&amp;#039;s a shame. I had several specific childhood dreams, and I&amp;#039;ve actually achieved most of them. More importantly, I have found ways, in particular the creation (with Don Marinelli), of CMU&amp;#039;s Entertainment Technology Center (http://www.etc.cmu.edu), of helping many young people actually *achieve* their childhood dreams. This talk will discuss how I achieved my childhood dreams (being in zero gravity, designing theme park rides for Disney, and a few others), and will contain realistic advice on how *you* can live your life so that you can make your childhood dreams come true, too. ","torrent":{"xt":"urn:btih:7240977c06278b367b20ab620aaaa5f4a8219ad6","amp;dn":"CMU+University+Lecture+Series+-+2007-09-19+-+Randy+Pausch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7240977c06278b367b20ab620aaaa5f4a8219ad6","infoHashBuffer":{"type":"Buffer","data":[114,64,151,124,6,39,139,54,123,32,171,98,10,170,165,244,168,33,154,214]},"announce":[],"urlList":[]}}