{"title":"Space 3: the end of the galaxy [BBC][Spa-Eng]","uid":3800970,"size":1740775320,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:729831b42e07777216324f6362f65a6bd91494df&amp;dn=Space+3%3A+the+end+of+the+galaxy+%5BBBC%5D%5BSpa-Eng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"*kurtz*","files":11,"time":1189296522,"description":"FORMAT: DVD5 Full DVD\nSYSTEM: PAL\nLANGUAGES: 2.0: Spanish, English\nSUBS: Spanish, English\nASPECT RATIO: 4:3\n\nGenre: Documentary\nProduction Year: 2001 BBC\nCountry: United Kingdom.\nLength: 50 min.\nDirector: Luke Campbell, Jeremy Turner\n\nThe Sun that gives us the life will die sooner or later. And with it all the Solar System, including the Earth.\n\nIn a distant future the life in the Earth will be impossible, and we cannot do anything to avoid it. The Sun is turning into an irresistible monster for our planet. According to the scientists, the only unique solution is to go to other places of the space to avoid the extinction of our species. But where?\n\nThe idea is to create a new home for human in Mars, which is the only planet that assembles conditions for life. There would be necessary to transform this hostile planet into an inhabitable world.\n\nAn amazing plan that, nevertheless, does not remove us from the danger. The increase of the Sol and its warming will do life in Mars be impossible. And we will continue escaping of the Sun in search of new worlds to which we will have to adapt.\n\n\nEl Sol que nos da la vida morirÃƒÂ¡ tarde o temprano. Y con ÃƒÂ©l desaparecerÃƒÂ¡ todo lo que existe en el Sistema Solar, incluyendo la Tierra.\n\nEn un futuro lejano la vida en la Tierra serÃƒÂ¡ imposible, y no podemos hacer nada para evitarlo. El Sol se estÃƒÂ¡ convirtiendo en un monstruo irresistible para nuestro planeta. SegÃƒÂºn los cientÃƒÂ­ficos, la ÃƒÂºnica soluciÃƒÂ³n es marchar a otros lugares del espacio para evitar la extinciÃƒÂ³n de nuestra especie. Pero Ã‚Â¿a dÃƒÂ³nde?\n\nLa idea es crear un nuevo hogar para los seres humanos en Marte, porque es el ÃƒÂºnico planeta que reÃƒÂºne condiciones para la vida. HabrÃƒÂ­a que transformar este planeta hostil en un mundo habitable.\n\nUn plan asombroso que, sin embargo, no nos aleja del peligro. El aumento del Sol y su calentamiento harÃƒÂ¡ que incluso la vida en Marte sea imposible. Y seguiremos escapando del sol en busca de nuevos mundos a los que tendremos que adaptarnos.\n\n","torrent":{"xt":"urn:btih:729831b42e07777216324f6362f65a6bd91494df","amp;dn":"Space+3%3A+the+end+of+the+galaxy+%5BBBC%5D%5BSpa-Eng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729831b42e07777216324f6362f65a6bd91494df","infoHashBuffer":{"type":"Buffer","data":[114,152,49,180,46,7,119,114,22,50,79,99,98,246,90,107,217,20,148,223]},"announce":[],"urlList":[]}}