{"title":"World's Most Dangerous Gang - MS 13.avi","uid":3559511,"size":387239424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:744354a9e17a69be8c0001021488d8c920fdaf86&amp;dn=World%5C%27s+Most+Dangerous+Gang+-+MS+13.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grinreaper_CCE","files":1,"time":1163796591,"description":"The MS-13 gang, aka Mara Salvatrucha 13, is one of the most violently dangerous gangs in the United States - and one of the most organized. The MS-13 gang has cliques, or factions, located throughout the United States and is unique in that it retains is ties to its El Salvador counterparts. With cliques in Washington DC, Oregon, Alaska, Arkansas, Texas, Nevada, Utah, Oklahoma, Illinois, Michigan, New York, Maryland, Virginia, Georgia, Florida, Canada, El Salvador, Guatemala, Mexico, and several other South American countries, the MS-13 gang is truly &quot;international&quot; and on the verge of becoming the first gang to be categorized as an &quot;organized crime&quot; entity.\n\nMS-13 Gang member shows his tattoos.Gang members, who sport numerous tattoos on their bodies and faces, wear blue and white colors taken from the El Salvadoran flag. Their membership is estimated to total over 36,000 in the Honduras alone. Members typically range in age from 11 to 40 years old. Their progressive increase in violent activities and careless disregard for the law (threats and attacks against law enforcement officials is common), has made them the most feared gang in the United States. MS-13 criminal activities include drug smuggling, gun running, people smuggling, hits for hire, theft, drug sales, arson, and of course, strong arming the locals. Their wide-ranging activities and elevated status has even caught the eye of the FBI who recently initiated wide-scale raids against known and suspected gang members netting hundreds of arrests across the country.\n\nTheir penchant for violence is renowned. Members often arrive in the United States with fighting skills gained in military training and are particularly adept with machetes. In March 2004, the Maldon Institute, a Washington DC based think tank, released a report detailing the violent methods MS-13 used, including their increasingly typical (and disturbing) calling card. MS-13 often leaves behind dismembered corpses, complete with the decapitated head, at the scene of their murders. Often a grim note is attached to the body.\n\nIn a recent Texas incident, a MS-13 gang member admitted that he had led the gang rape of a 24 year-old woman and then kicked her in the neck with such force that it killed her. During questioning, the MS-13 member further acknowledged robbing and beating a small child in Houston and to stabbing an Alexander, Texas man three times in an attempt to kill him. When asked if he though murdering someone elevated his status within the gang he replied:\n\nHell Yeah. The crazier you are known to be, the more respect the gang gives you. In my gang, my street name is &quot;psycho&quot;.\n\nMore info on the site: &lt;a href=&quot;\nhttp://www.altereddimensions.net/crime/MS13Gang.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.altereddimensions.net/crime/MS13Gang.htm&lt;/a&gt;\n\nRuntime: 45 minutes\nA &amp; V Quality: good\n\n================================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n================================================================================","torrent":{"xt":"urn:btih:744354a9e17a69be8c0001021488d8c920fdaf86","amp;dn":"World%5C%27s+Most+Dangerous+Gang+-+MS+13.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744354a9e17a69be8c0001021488d8c920fdaf86","infoHashBuffer":{"type":"Buffer","data":[116,67,84,169,225,122,105,190,140,0,1,2,20,136,216,201,32,253,175,134]},"announce":[],"urlList":[]}}