{"title":"Enter the matrix","uid":3825202,"size":2548726505,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:749ec67a581e96b57e5f26e88d44ef9660c0dcdb&amp;dn=Enter+the+matrix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bercik82","files":4,"time":1191184160,"description":"Enter The Matrix is the story-within-the-story. It features awesome gunplay and spectacular martial arts that bend the rules of the Matrix, as well as insane driving and stunts, and the chance to pilot the fastest hovercraft in the fleet. This game isn?t just set in the Matrix universe ? it?s an integral part of the entire Matrix experience, weaving in and out of the highly anticipated 2nd installment in the film trilogy, The Matrix Reloaded?.\n\nEnter The Matrix was developed under the creative direction of the Matrix filmmakers Larry and Andy Wachowski. The unprecedented level of collaboration between Hollywood?s hottest filmmakers and the award-winning Shiny Entertainment team makes Enter The Matrix a truly unique gaming experience.\n\nFEATURES\nThe story-within-the-story -- without the game, you won?t see the entire Matrix Reloaded story.\nIncredible Kung Fu, directed by the Matrix fight scene choreographer Yuen Wo Ping.\nCar chases and stunts that take you right to the hard line, Hollywood style.\nHack into your gaming console.\nDefy gravity and bend the rules in ?Bullet Time?\nTake on Agents in intense action sequences\nPilot the Logos, the fastest hovercraft in the Zion fleet\nLearn from the Oracle how you can help save mankind\n\n&quot;It&amp;#039;s not a game about a movie --\n           it&amp;#039;s a game about a world.?\n\n","torrent":{"xt":"urn:btih:749ec67a581e96b57e5f26e88d44ef9660c0dcdb","amp;dn":"Enter+the+matrix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"749ec67a581e96b57e5f26e88d44ef9660c0dcdb","infoHashBuffer":{"type":"Buffer","data":[116,158,198,122,88,30,150,181,126,95,38,232,141,68,239,150,96,192,220,219]},"announce":[],"urlList":[]}}