{"title":"Sansui Rocknroll - 2007 - Grand Prize For Special People Like Yo","uid":3855402,"size":83997147,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:75a3a5de11597bb31f8fd8dddc1be3b256a5d70e&amp;dn=Sansui+Rocknroll+-+2007+-+Grand+Prize+For+Special+People+Like+Yo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"__deadfish66","files":13,"time":1193165020,"description":"If you like rock, pop and surf music you should be a big fan of Sansui Rocknroll.\n\nCheck out their website:\n\nwww.sansuirocknroll.com\n\n\n\n\nSupport thoose guys, they are really good and cool!\n\n......................................\n\nAn interview with the band (Taken from cdbaby.com):\n\n\n\n\nWhy the name Sansui Rocknroll?\n\n\n\nItÃƒ?Ã‚Â´s so easy to remember and Toto was already taken. We wanted something that worked for the japanese market. We wanna go there and play.\n\n\n\n\n\nWhat kind of music do you play?\n\n\n\nWeÃƒ?Ã‚Â´re like the caffeine for the caffeineaddicted. Something you need to feel satisfied. We use ordinary rockinstruments. And a saxophone. People tend to like that. We believe itÃƒ?Ã‚Â´s because it shines so bright. When we use our instruments itÃƒ?Ã‚Â´s usually alot of energy and all kinds of people seem to enjoy what weÃƒ?Ã‚Â´re doing. Everything from oldies to tha kidz. \n\n\n\n\n\nFor how long have you played together?\n\n\n\nSome of us have played together since Kindergarten but the band as it is today started one raw and chilly night in march 2006. That was our first gig and the soundengineer was one of strangest persons weÃƒ?Ã‚Â´ve ever met.\n\n\n\n\n\nIs it important for you to play live?\n\n\n\nYeah. ItÃƒ?Ã‚Â´s what we enjoy the most and we want people to see that and have as much fun as we have. \n\n\n\n\n\nMention some music you like!\n\n\n\nWe like when music is uncompromised and unique. It doesnÃƒ?Ã‚Â´t really matter if itÃƒ?Ã‚Â´s deathmetal or country.\n\n\n\n\n\nName some bands you like!\n\n\n\nBob hund, Modest Mouse, Beck, Radiohead, Frank Zappa, The Animal Five, The Flaming Lips, Sonic Youth, The Beatles, Vomitory, The Chemical Brothers, Daniel Johnston, Johnny Cash, Kelly Clarkson, Peter Bjorn and John, Pearl Jam, Queens of the Stone Age, Meshuggah etc.\n\n\n\n\n\nDoes any of the bandmembers possess any super powers?\n\n\n\nMaybe itÃƒ?Ã‚Â´s not a super power but Gustav (drums) eat almost as slow as The Hulk is strong when heÃƒ?Ã‚Â´s angry and all green. Gustav also has the most beautiful eyes. He once got that as a compliment from and old man. According to witnessess that was one scary situation. How sane is it for a complete stranger to tell a boy that he has beautiful eyes?\n\n\n\n\n\nIf you werenÃƒ?Ã‚Â´t playing music, what would you do?\n\n\n\nHenric would work as a postman. ItÃƒ?Ã‚Â´s paid exercise goddamnit!\n\nGustav would work at a local mall in his hometown.\n\nRikard would work at a gas station. Probably Shell. He would handle the sausages. \n\nNiels would be an electrician. Probably he wouldnÃƒ?Ã‚Â´t do that much at all. \n\nAnders would inherit the familyfarm and work as a farmer. Mainly milkproduction.\n\nJoakim would work as a janitor. Probably at Saab. Or elsewhere. \n\n\n\n\n\nWhat do you think about your latest record?\n\n\n\nWe think itÃƒ?Ã‚Â´s really good and all the songs are radio-smash-hit-singles and everybody should buy it. We think itÃƒ?Ã‚Â´s our best record so far and we are very proud of it.\n\n\n\n\n\nHow many records have you done?\n\n\n\nOne. This included.\n\n\n\n\n\nTell us how you recorded the album?\n\n\n\nPeople showed up with the instruments and played. We decided that if we played wrong we should do retakes until we got it right. And it should sound good aswell. Half of the songs were written before we started to record and the rest were done all along the recording process. We wanted to get a live sound with alot of energy and feeling. ThatÃƒ?Ã‚Â´s what we like. ItÃƒ?Ã‚Â´s alot going on on the album but thatÃƒ?Ã‚Â´s the way we want it. ItÃƒ?Ã‚Â´s supposed to be fun to listen to our/any album. The songs differ alot but weÃƒ?Ã‚Â´ve always worked towards a sound and an overall picture. We think weÃƒ?Ã‚Â´ve captured the sound of a band playing itÃƒ?Ã‚Â´s repertoire live at a random dance palace. If you wanna know anything about the technical stuff we can reveal as much as we only used very expensive microphones and old analog gear with tubes and blinking buttons. It took us almost four months to record the album. No time to rest, work work work, but nooo stress. \n\n\n\n\n\nOne final question; Can you tell us something fun youÃƒ?Ã‚Â´ve experienced?\n\n\n\nNo.\n\n\n\n\n","torrent":{"xt":"urn:btih:75a3a5de11597bb31f8fd8dddc1be3b256a5d70e","amp;dn":"Sansui+Rocknroll+-+2007+-+Grand+Prize+For+Special+People+Like+Yo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75a3a5de11597bb31f8fd8dddc1be3b256a5d70e","infoHashBuffer":{"type":"Buffer","data":[117,163,165,222,17,89,123,179,31,143,216,221,220,27,227,178,86,165,215,14]},"announce":[],"urlList":[]}}