{"title":"15 DVD","uid":3792248,"size":4680845312,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:78412e7fabc577a0405114125f6d2b6417ce99f4&amp;dn=15+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webdaemon","files":58,"time":1188699445,"description":"Um .... a serious film about troubled teens in Singapore, a country I have not much knowledge on but have the previous wrong impression that all the kids there are highly disciplined and controlled by their family and government. Well, I guess I am wrong, just like other cities/ countries, they also have their troubled teens who also lead the not so surprising rebellious way of life of drugs, fights, bad language, and .... many other obvious signs of being a bad boy. The surprising part of this film isn&amp;#039;t really about how these kids running around causing themselves and others trouble, but rather the subtle gayness hidden behind their so call loyalty between them. The bond between these &quot;brothers&quot; may very well originated from an unconscious gay tendency inside these boys. Though it isn&amp;#039;t uncommon for str8 guys to have very close friendship with each other, but watch this film closely, it should be entering all sorts of gay film festivals and I would not be surprised that it may win itself a lot more awards toward this direction!\n\nFrench subtitles removed","torrent":{"xt":"urn:btih:78412e7fabc577a0405114125f6d2b6417ce99f4","amp;dn":"15+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78412e7fabc577a0405114125f6d2b6417ce99f4","infoHashBuffer":{"type":"Buffer","data":[120,65,46,127,171,197,119,160,64,81,20,18,95,109,43,100,23,206,153,244]},"announce":[],"urlList":[]}}