{"title":"CombatMissionsS1E1-S1E5.rar","uid":3570465,"size":1132656119,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7996172f3618527120a26c35648ff4b183a458ee&amp;dn=CombatMissionsS1E1-S1E5.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shockin","files":1,"time":1165248533,"description":"From the producer of Eco-challenge and Survivor comes a reality competition program designed exclusively for America&amp;#039;s elite warriors. Delta Force, Green Beret, Marine Recon, Navy SEALs, Police SWAT, and CIA Special Operations are brought together to compete in a contest of combat readiness. These military and law enforcement officers are known to be America&amp;#039;s heroes and peace-keepers. Twenty-four men have been assembled at Camp Windstorm, a simulated working military base commanded by decorated ex-Navy Seal, Rudy Boesch. Commander Boesch assigned the men randomly to four six-man squads namely: Alpha, Bravo, Charlie, and Delta. These four teams will compete at a 15-week evolution to see who is the best of the best. Each week, two of the four teams will go head-to-head in the realistic SWAT and combat missions like going behind enemy lines to rescue a down pilot, destroying an enemy tank, rescuing a hostage from gang members in an urban police shoot-out, and more realistic missions like taking out an enemy fuel gun, rescuing a POW, and assaulting a terrorist-controlled illegal arms operation. Each team will compete separately against the Shadow Squad, an overwhelming enemy force made up of specially trained soldiers. With no live ammunition involved in the mission, all squad members will be using the Miles Laser System. They will be wearing laser-activated sensors and carry rifle reproductions that act and sound like real guns but actually emit laser pulses. When a squad member is shot, a buzzer will go off, and the squad member must fall down to the ground and remain inactive for the rest of the mission. The team who wins the mission moves on, while the loosing team will make a tough choice. The rule is: loose a mission, loose a man. The high stakes lead to explosive personal and human dramas, gut-wrenching decisions and moral dillemas. All taking place in a tournament which in the end will crown one of the four teams as a team champion, and ultimately one man the best of the best - the Combat Missions champion and the winner of $250,000 grand prize. Combat Missions -- 24 special forces and SWAT operators battle until one man stands alone. Who will win and who will go? \n","torrent":{"xt":"urn:btih:7996172f3618527120a26c35648ff4b183a458ee","amp;dn":"CombatMissionsS1E1-S1E5.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7996172f3618527120a26c35648ff4b183a458ee","infoHashBuffer":{"type":"Buffer","data":[121,150,23,47,54,24,82,113,32,162,108,53,100,143,244,177,131,164,88,238]},"announce":[],"urlList":[]}}