{"title":"MOD Hitman Blood Money - The Agency","uid":3801730,"size":341651034,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:799a2bd4e4da42314d396aac4ef5dd35604fa9e0&amp;dn=MOD+Hitman+Blood+Money+-+The+Agency&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Wolftank","files":5,"time":1189393670,"description":"This is a FULL CONVERSION MOD for Hitman Blood Money\n\n\n\nHITMAN BLOOD MONEY MOD: THE AGENCY\n\nAgent 47 is the greatest assassin to have ever lived; his ability to move silently, act swiftly and kill without hesitation is renowned throughout the criminal underworld across the entire globe.\n\n\nHowever, Mr. 47 isn&amp;#039;t the only assassin available for hire. He may be The Agency&amp;#039;s best asset, but that&amp;#039;s not to say that he&amp;#039;s up against some elite competition. These men have never met, but are united by their ability to think logically, infiltrate efficiently and dispatch their targets with ease, under the banner of their organisation.\n\n\n\n\n\nNEW FEATURES\n\n- Agent 47&amp;#039;s colleuges in The Agency are revealed, with 13 new playable characters, from familiar Hitman characters to classic icons of culture.\n\n- The reality of contract-killing; enjoy Blood Money with a heightened sense of realism, with far more finely-tuned gameplay aspects, payments and notoriety.\n\n- 47 isn&amp;#039;t the only one with Custom weaponry; enjoy your old favourites with customised designs.\n\n- Everyone has their own contracts; eliminate an entire cast of new targets and other supporting characters.\n\n- The true enemy is finally revealed; uncover the mystery concieved by the first ever Ort-Meyer clone, and face a final showdown to remember.\n\n\n\n\nLIST OF PLAYABLE CHARACTERS\n\n\nDeath of a Showman: Scar (Requiem Mystery Assassin)\n\nA Vintage Year: Kaufman (of Xolair&amp;#039;s Max Payne 2 Hitman mod)\n\nCurtains Down: Maynard John (of A Dance with the Devil)\n\nFlatline: Frank Martin (Jason Statham of The Transporter)\n\nA New Life: Agent 17 (of Hitman 2: Silent Assassin)\n\nThe Murder of Crows: Leon (Jean Reno of Leon The Professional)\n\nYou Better Watch Out...: Mark Parchezzi III (of Amendment XXV)\n\nDeath on the Mississippi: Mr.GoodKat (Bruce Willis of Lucky Number Slevin)\n\n...Till Death do us Part: Joseph Clarence (Mr. Swing King of Death of a Showman)\n\nA House of Cards: Mr. Cropes (original character)\n\nA Dance with the Devil: Chow Yun Fat (of The Bulletproof Monk)\n\nAmendment XXV: Alexander Leland Cayne (of Requiem)\n\nRequiem: Agent 47 (of the Hitman series)\n\nHideout: Zombie (Inspiration largely from the Resident Evil series)","torrent":{"xt":"urn:btih:799a2bd4e4da42314d396aac4ef5dd35604fa9e0","amp;dn":"MOD+Hitman+Blood+Money+-+The+Agency","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"799a2bd4e4da42314d396aac4ef5dd35604fa9e0","infoHashBuffer":{"type":"Buffer","data":[121,154,43,212,228,218,66,49,77,57,106,172,78,245,221,53,96,79,169,224]},"announce":[],"urlList":[]}}