{"title":"Titan.Poker.Full.Game.2007.Live.Poker.Multi.rar","uid":3580196,"size":77609756,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a08c492e9b9f08b09b5a55a3065bf77ac728ab0&amp;dn=Titan.Poker.Full.Game.2007.Live.Poker.Multi.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jenny0","files":1,"time":1166587340,"description":"Titan Poker\nTitan Poker is an exciting online poker room that is quickly becoming the favorite for many players. Titan Poker&amp;#039;s realistic and player-friendly software offers a wide range of tournament and ring game play, including progressive jackpot sit &amp;#039;n&amp;#039; go tournaments. The jackpots grow larger each week, enabling players to win as much as $100,000, in addition to their normal tournament winnings.\n\nTitan Poker has awarded many of its qualified players with entries to the Main Event of the 2006 World Series of Poker, and holds regularly scheduled tournaments with incredibly high prize pools. Titan Poker recently staged a $100 Million Freeroll Tournament, sending players to a mainland Final Table and a real chance at a $100 Million Jackpot Prize.\n\nJoanna Krupa, the World&amp;#039;s Hottest Swimsuit Model, has joined Titan Poker as its official Spokesmodel. Joanna, who has graced the magazine covers of Playboy and Maxim, and who has appeared in a number of film and television projects, regularly plays at the online poker tables at Titan Poker. In addition, she will represent Titan Poker at leading poker competitions and tournaments around the world, including the World Series of Poker.\n\nTitan Poker offers its new depositors incredible Signup and Reload Bonuses, awarded to players as they earn Titan Poker Points at ring games and tournaments. All depositors are entitled to enter a weekly Depositors Freeroll.\n\nTitan Poker recently launched its exclusive VIP Club, rewarding its loyal players with weekly and monthly freeroll tournaments, faster bonus redemption, and exclusive chances to win free seats to the World Series of Poker.\n\n\nEXCLUSIVE REAL PLAYER BONUS WITH THIS EDITION!","torrent":{"xt":"urn:btih:7a08c492e9b9f08b09b5a55a3065bf77ac728ab0","amp;dn":"Titan.Poker.Full.Game.2007.Live.Poker.Multi.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a08c492e9b9f08b09b5a55a3065bf77ac728ab0","infoHashBuffer":{"type":"Buffer","data":[122,8,196,146,233,185,240,139,9,181,165,90,48,101,191,119,172,114,138,176]},"announce":[],"urlList":[]}}