{"title":"Flight Simulator Deluxe X [RE]","uid":3553439,"size":8769205980,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a911295fa602242cb1c3498aa947c8c80aebc78&amp;dn=Flight+Simulator+Deluxe+X+%5BRE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"relentlesstech","files":3,"time":1162955713,"description":"I apologize to all the people that tried to download stuff from me before - Right after I created and posted my files, my computer died on me, and I just finished rebuilding it - From now on my torrent client will be running 24/7, so I will always be seeding - Again, I&amp;#039;m sorry for any inconvenience that may have caused!\n\n======================================\nFlight Simulator Deluxe X [RE]\n======================================\n\nThe presently known new features in Flight Simulator X include:\n\nImproved graphics including enhanced texture resolution, new Earth model facilitating polar flights, true road data, region-specific textures, 3D animals, star constellations, etc. Also, the scenery textures now line up with the automatically generated (Autogen) buildings. Maximum rendering-engine-supported scenery resolution of 7cm/pixel (not available with default scenery). \n\nImproved default airport functionality ? appropriate dynamic vehicles, jetways etc. now featured by default where they exist in reality. \n\nThe built-in GPS support has been upgraded to include Garmin G1000 integrated glass cockpit, (select aircraft in the Deluxe version only). \n\nImproved ATC featuring certain non-FAA procedures where appropriate (for example, altimeter/QNH scale in European units) and numerous minor updates such as an improved progressive-taxi feature. \n\nImproved and new default aircraft including, for example, an Airbus A321. Default aircraft systems modeling is rather extensively improved, featuring, for example, APU, fire protection, passenger advisory sign switches etc. \n\nImproved weather system, including better visibility modeling. \n\nRevamped multiplayer functionality featuring Shared Skies, a feature allowing multiple users to share the same cockpit. \n\nTower Controller, a feature in the Deluxe version allowing users to simulate local control at many airports worldwide (multiplayer only). \n\nRevamped sound system with support for 5.1 surround sound. \n\nProprietary SimConnectAPI to allow FSUIPC-like access to Flight Simulator functions and variables.\n\nNotice the new water effect during sunriseMission engine allowing creation of dynamic missions with developer control of many simulation variables, sound file playback, AI aircraft traffic etc. in relation to what the user is doing -- essentially an evolution over the APL and ABL adventure programming languages featured in previous versions of the software. Dozens of missions ship with the product, and a mission level editor is expected to be released on-line shortly after release of the main product. \n\nMost of the vintage aircraft that were a key theme in the previous version have been dropped, with the exception of the DC-3 and Piper J-3. The DC-3 is featured in one of the default missions that ship with the product. \n\nMouse-as-yoke, a feature that allows the mouse to be used in steering the aircraft, is re-introduced, after having been absent for two versions. This will make FSX more accessible, for instance, to many users with motor disabilities. \n\nThe maximum altitude in the game has been increased to 100,000,000 feet, as opposed to FS2004&amp;#039;s 99,999 feet. \n\nRealistic flexible wings in some commercial airplanes, the wings flexes when the aircraft is going through turbulence, increase rate of ascend or descend, major plane movements, flaps getting fully armed, general vibrations to the plane, etc. An example of an aircraft with this wing movement is the Boeing 747-400. \n\nNew water effect which has 3D waves with curled up object reflection according to the wave movements and with sunshine reflection. \n\nAircraft can cast shadows on themselves. \n\n\n======================================\nRelentless Edition FAQ\n======================================\n\n*What is a &amp;#039;RE&amp;#039; release?\n\n A &amp;#039;Relentless Edition&amp;#039; game has been pre-cracked and rebuilt by \n relentless_tech (http://www.noitats.com)\n\n\n*What&amp;#039;s so good about an &amp;#039;RE&amp;#039;?\n\n All Relentless Edition releases are rebuilt to be &amp;#039;install &amp; play&amp;#039;\n This means no cracking, no CD-Keys needed, and most come with bonuses\n (trainers, cheats, update patches, bonus DVD&amp;#039;s, and other extras), all \n integrated into an easy-to-mount/install/play game!\n\n\n======================================\nInstallation Information\n======================================\n\nMount ISO image to Nero ImageDrive, Daemon Tools, or other virtual drive\ndevice\n\nInstall the game, following the InstallShield prompts\n\nUnmount image, put it away somewhere, and play the game ;-)\n\n\n======================================\nIncluded Extras\n======================================\n:-(       None - Sorry!\n\n======================================\nEnjoy ;-)        .: relentless_tech :.\n======================================\n","torrent":{"xt":"urn:btih:7a911295fa602242cb1c3498aa947c8c80aebc78","amp;dn":"Flight+Simulator+Deluxe+X+%5BRE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a911295fa602242cb1c3498aa947c8c80aebc78","infoHashBuffer":{"type":"Buffer","data":[122,145,18,149,250,96,34,66,203,28,52,152,170,148,124,140,128,174,188,120]},"announce":[],"urlList":[]}}