{"title":"NuSphere phpED 5.2","uid":3954517,"size":103237610,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7b2a353e7dd8d13f281362f158df389d7d1bb6e5&amp;dn=NuSphere+phpED+5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"okcomputr","files":1,"time":1199061934,"description":"PhpED is the Integrated Development Environment for PHP (PHP IDE), HTML, CSS, XML, SMARTY, XHTML and other.\nBalanced combination of advanced code editor, reliable dbg debugger, productive database connectivity client and fast and secure deployment abilities make PhpED a complete solution for most sophisticated developer needs.\n\nAs in any complicated process, in php development a great deal of effectiveness depends on your choice of production tools. According to our customers, PhpED 5.2 can save up to 75% of their development time.\n\n*********************Archive Password: www.2baksa.net *************************\n\nWith PhpED you can:\n\n\nCreate\nCode creation with our PHP IDE got a lot easier with the new PhpED 5.2 editing features. With PhpED&amp;#039;s new highlighting abilities you can now navigate through your code easily and save the precious developing time.\nPHP Code Folding sets NuSphere PHP IDE apart from all others.\n\nDebug \nPowerful PHP Debugger is one of the strongest PhpED features. Debug your code locally or remotely with dbg - the best debugger on the market integrated in the fastest PHP IDE.\nSee the flash demo of remote debugging with NuSphere Internet ExplorerÃ‚Â® Toolbar. \nSetup remote debugging in PhpED with the help of DBG Wizard \nProfile\nIntroduced by NuSphere, PHP Profiler helps you find and eliminate all the bottlenecks in the code. \nDeploy\nSecure, fast and flexible publishing of your PHP scripts to a remote server right from PHP IDE. FTP, SFTP and WebDAV are supported. \nIntegrate\nNew extensibility scope allows to integrate PhpED with 3rd party tools like php encoders, formatters or html validators. Pre-configured tools already include php documentor, html tidy, cvs client and html validator. \nStriving to meet the growing customer needs, NuSphere enhanced PhpED with features customers ACTUALLY ASKED FOR. \n","torrent":{"xt":"urn:btih:7b2a353e7dd8d13f281362f158df389d7d1bb6e5","amp;dn":"NuSphere+phpED+5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b2a353e7dd8d13f281362f158df389d7d1bb6e5","infoHashBuffer":{"type":"Buffer","data":[123,42,53,62,125,216,209,63,40,19,98,241,88,223,56,157,125,27,182,229]},"announce":[],"urlList":[]}}