{"title":"Acoo Browser 1.71.656 -LegalTorrents","uid":3816752,"size":1667923,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c9fc910713c2cd10096c91b743e429c423e96de&amp;dn=Acoo+Browser+1.71.656+-LegalTorrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LegalTorrents","files":4,"time":1190576991,"description":"Acoo Browser is a powerful multi-tabbed web browser based on the Internet Explorer engine (IE 5 or greater required).\n\nAcoo Browser provides a user-friendly GUI interface, including tabbed document windows, dockable panel groups and customizable toolbars.\n\nAcoo Browser allows user to surf multiple Web sites within one browser window. It also includes many advanced features such as Mouse Gestures, built-in syntax highlighted HTML source viewer, powerful built-in Web page analyzer, recoverable Popup Blocker, Ads Filter, ActiveX Filter, script error suppression, Cleaner, external tools, web page zooming, URL Hotkey, URL Alias, Integrated search engine support, and much more...\n\nAcoo Browser can block annoying pop-ups, banner Ads, flash Ads and other Internet Ad annoyances automatically without interfering your surfing. There is also detailed logging record in Acoo Browser, and you may know the Ads sites killed by Acoo Browser so as to improve your setting.\nAcoo Browser makes your surfing experience easier, quicker and more comfortable!\n\n\n\n-LEGAL TORRENTS\n\nPurpose:\n\ncreate a balance, share the already free stuff,\npublic domain works, freeware, free music,\nfree ebooks, articles, manifestos, movie trailers, and more.\n\nshow the copyright owners that torrent\nwebsites shouldn&amp;#039;t bear the responsibility\nof what their users upload, torrent websites\nare very much similar to google..\n\nusers upload what they want to upload,\ndownload what they want to download,\nand search for what they want to search..\n\nby creating this balance and sharing the already free\nstuff, we hope to take the pressure of torrent websites..\n\n","torrent":{"xt":"urn:btih:7c9fc910713c2cd10096c91b743e429c423e96de","amp;dn":"Acoo+Browser+1.71.656+-LegalTorrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c9fc910713c2cd10096c91b743e429c423e96de","infoHashBuffer":{"type":"Buffer","data":[124,159,201,16,113,60,44,209,0,150,201,27,116,62,66,156,66,62,150,222]},"announce":[],"urlList":[]}}