{"title":"[Kung Fu] Game Of Death II aka Tower Of Death (Bruce Lee, 1981)","uid":3790937,"size":388904809,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ea1d44619c108bb7e9af5d4c3f23b752b7d6d3b&amp;dn=%5BKung+Fu%5D+Game+Of+Death+II+aka+Tower+Of+Death+%28Bruce+Lee%2C+1981%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1188601629,"description":"Game Of Death II aka Tower Of Death (Bruce Lee, 1981) - REMASTERED\n\nHKFlix Says:  \t3.5 Stars\n\nOne that&amp;#039;s &quot;so bad it&amp;#039;s good&quot;, this is a Bruce Lee flick with hardly any Bruce Lee in it. And the great Yuen Wo Ping action choreography is all but lost on these performers. Nonetheless, this films a lot of fun, and is highly recommended for cheese-lovers!\n\nAvg. Rating: \t\n  3.1 / 5 (based on 12 ratings).\n\nPlot:\tAn action-packed tale with a few tricks up its sleeve. When a man&amp;#039;s coffin is stolen during his funeral, his brother sets out to investigate... He follows the trail to an underground drug processing center where he finds what he was looking for, and more!\n\nOverview:\tThe ultimate fighting tribute to martial arts legend Bruce Lee. From Ng See Yuen, the legendary producer of &quot;Snake In The Eagle&amp;#039;s Shadow&quot; and &quot;Drunken Master&quot;, this non-stop martial arts showcase is a dynamic tribute to Bruce Lee and the &quot;Game Of Death&quot; phenomenon.\n\nTraveling to Japan to investigate the mysterious murder of his brother, Bobby Lo (Tong Lung) discovers a secret trail, which leads to the mysterious Tower Of Death. A forbidden fortress, buried hundreds of feet under the Earth, its deadly secret is guarded by elite warriors, each championing a different style of combat. To bring his brother&amp;#039;s killer to justice, and discover the Tower&amp;#039;s secret, Lo must first run the gauntlet of death, from which no one has ever returned alive!\n\nTaking over three years to complete, &quot;Tower Of Death&quot; is choreographed by Yuen Wo Ping, action director of &quot;The Matrix&quot; and &quot;Crouching Tiger, Hidden Dragon&quot;, and features the formidable kicking skills of legendary Korean tae kwon do master Hwang Jang Lee (&quot;Drunken Master&quot;).\n\nCast: \tBruce Lee (Siu Lung)  ||  Lee Hoi Sang  ||  Yuen Biao  ||  Hwang Jang Lee  ||  Yuen Shun-Yi  ||  Roy Chiao  ||  Tung Lung \n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:7ea1d44619c108bb7e9af5d4c3f23b752b7d6d3b","amp;dn":"%5BKung+Fu%5D+Game+Of+Death+II+aka+Tower+Of+Death+%28Bruce+Lee%2C+1981%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ea1d44619c108bb7e9af5d4c3f23b752b7d6d3b","infoHashBuffer":{"type":"Buffer","data":[126,161,212,70,25,193,8,187,126,154,245,212,195,242,59,117,43,125,109,59]},"announce":[],"urlList":[]}}