{"title":"Classic Railroad Songs","uid":3586218,"size":106089062,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fa9cc9df17efde6de773925abb6edfbf6a7ab58&amp;dn=Classic+Railroad+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lemino","files":29,"time":1167469928,"description":"Smithsonian Folkways ninth installment of its popular Classic Series chronicles the golden age of the American railroad. Classic Railroad Songs from Smithsonian Folkways picks up where 2004&amp;#039;s Classic Maritime Music collection left off, unearthing previously unheard of gems from their archives along with classics from some of the genre&amp;#039;s finest practitioners. Twenty-one of these remarkable folk songs, field recordings, tall tales, and work songs appear on CD for the first time, from the crisp a cappella &quot;F.F.V.,&quot; performed by Annie Watson (mother of Doc Watson), to Cisco Houston&amp;#039;s rousing &quot;Drill, Ye Tarriers, Drill&quot; from his 1968 Sings American Folk Songs anthology. Compiled by Grammy Winner Jeff Place, Classic Railroad Songs is enriched by rare photos from the Library of Congress and there are detailed liner notes for each and every one of the 29 cuts which provide a glimpse into the hobo lifestyle of legendary characters like Harry McClintock, Leadbelly, and Furry Lewis -- the latter lost a leg in 1917 in a railway accident.","torrent":{"xt":"urn:btih:7fa9cc9df17efde6de773925abb6edfbf6a7ab58","amp;dn":"Classic+Railroad+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa9cc9df17efde6de773925abb6edfbf6a7ab58","infoHashBuffer":{"type":"Buffer","data":[127,169,204,157,241,126,253,230,222,119,57,37,171,182,237,251,246,167,171,88]},"announce":[],"urlList":[]}}