{"title":"VMware Player + Ubuntu Ultimate 1.4 appliance + Linux Docs","uid":3804875,"size":1048245046,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:80f3d7518d0cafc039b01f79bcace5fbea68ba7f&amp;dn=VMware+Player+%2B+Ubuntu+Ultimate+1.4+appliance+%2B+Linux+Docs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Valloric","files":7,"time":1189651010,"description":"IT IS PERFECTLY LEGAL TO DOWNLOAD ALL FILES IN THIS TORRENT!\n\nThis torrent has everything you need to test and, more importantly, start USING Ubuntu. Live CD versions of Linux distros can&amp;#039;t save or modify files, so they are only good for very brief and superficial evaluations. \n\nWith VMware and a Ubuntu appliance mounted, you can start using Linux with absolutely no hassles.  No more repartitioning the hard drive to make room for the new OS; no more installing, finding all the required drivers, configuring everything to boot properly and so on, and so on...  No need to set up multiboot, just run everything from Windows. And you can even install software in the virtual OS and perform any task you would normally be able to do if you installed it to the hard drive. From the perspective of Ubuntu, it is running on hardware. \n\nA *very* detailed, step-by-step guide is included so you can configure the connection between the two operating systems. Also, pdfs on Ubuntu and Linux in general are included in the release for beginners.\n\n\nThis release is built entirely of freely available software:\n\nVMware Player v2.0.0 - The player version is completely free, and can run any appliance created with VMware Workstation, Server or other versions.\n\nUbuntu Ultimate 1.4 - Ubuntu 7.04 &quot;Feisty Fawn&quot; tweaked and easily upgradeable to the (also completely free) DVD version of Ultimate with all the bells and whistles. This is the CD version to keep the download small. A link for an automatic upgrade to the DVD version is on the desktop. More information can be found here: &lt;a href=&quot; http://ubuntusoftware.info/Ubuntu_Ultimate_CD/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ubuntusoftware.info/Ubuntu_Ultimate_CD/&lt;/a&gt;\nAnd here: &lt;a href=&quot; http://ubuntusoftware.info/Ubuntu_Ultimate_1.4/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ubuntusoftware.info/Ubuntu_Ultimate_1.4/&lt;/a&gt;\n\nCredit goes to TheeMahn\n\nFolder &quot;Linux docs&quot; contains the pdfs &quot;Introduction to Linux&quot; by Machtelt Garrels,  &quot;Ubuntu Desktop Guide&quot; by the Ubuntu Documentation Project and the &quot;Linux Command Line Reference&quot;  from\n\nThe install guide was written by me.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:80f3d7518d0cafc039b01f79bcace5fbea68ba7f","amp;dn":"VMware+Player+%2B+Ubuntu+Ultimate+1.4+appliance+%2B+Linux+Docs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80f3d7518d0cafc039b01f79bcace5fbea68ba7f","infoHashBuffer":{"type":"Buffer","data":[128,243,215,81,141,12,175,192,57,176,31,121,188,172,229,251,234,104,186,127]},"announce":[],"urlList":[]}}