{"title":"Massacre in Europe - Srebrenica 1995 - Part 1","uid":3558822,"size":43359093,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:822401da6f4f553037cecb78e6e6d37626a33935&amp;dn=Massacre+in+Europe+-+Srebrenica+1995+-+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mstrike","files":1,"time":1163709300,"description":"The Srebrenica Massacre was the July 1995 killing of at least 8,000 [1] Bosniak males, ranging in age from teenagers to the elderly, in the region of Srebrenica in Bosnia and Herzegovina by the Army of Republika Srpska under the command of general Ratko Mladi?. In addition to the Army of Republika Srpska, special state security forces of Serbia known as the \\&quot;Scorpions\\&quot; participated in the massacre. [2] The United Nations had previously declared Srebrenica a UN protected \\&quot;safe area\\&quot; and 400 armed Dutch peacekeepers were present at the time, but they did not prevent the massacre. [3] The massacre included several instances where preteen children and women were also killed.[4] While the exact number killed will never be known, the list of people missing or killed in Srebrenica compiled by the Federal Commission of Missing Persons so far includes 8,373 names.[5]\n\nThe Srebrenica massacre is the largest mass murder in Europe since World War II and it is the first legally established case of genocide in Europe. [6] In the unanimous landmark ruling \\&quot;Prosecutor v. Krstic\\&quot;, the Appeals Chamber of the International Criminal Tribunal for the former Yugoslavia (ICTY) ruled that the Srebrenica massacre was an act of genocide stating in its judgement:\n\n\\&quot;By seeking to eliminate a part of the Bosnian Muslims [Bosniaks], the Bosnian Serb forces committed genocide. They targeted for extinction the forty thousand Bosnian Muslims living in Srebrenica, a group which was emblematic of the Bosnian Muslims in general. They stripped all the male Muslim prisoners, military and civilian, elderly and young, of their personal belongings and identification, and deliberately and methodically killed them solely on the basis of their identity.\\&quot; \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Srebrenica_massacre&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Srebrenica_massacre&lt;/a&gt;","torrent":{"xt":"urn:btih:822401da6f4f553037cecb78e6e6d37626a33935","amp;dn":"Massacre+in+Europe+-+Srebrenica+1995+-+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"822401da6f4f553037cecb78e6e6d37626a33935","infoHashBuffer":{"type":"Buffer","data":[130,36,1,218,111,79,85,48,55,206,203,120,230,230,211,118,38,163,57,53]},"announce":[],"urlList":[]}}