{"title":"NBA 08 [English][PSP]","uid":3826881,"size":540761613,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:8239c3f73e893977a2b0ed221ca462200bcee134&amp;dn=NBA+08+%5BEnglish%5D%5BPSP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"changoboy","files":38,"time":1191310149,"description":"NBA action on the go is back once again with NBA 08 for the PSP. With quick action and fluid gameplay, NBA 08 continues to expand on the franchise by offering the most diverse and feature-rich handheld NBA action available. Additionally, NBA 08 introduces a number of brand new quick action mini-games that players can enjoy anytime, anywhere. All-new carnival-style games, as well as contests such as Fast Break, Block-a-Shot, and Alley-Oop, are all available to provide fast and engaging action that further adds to the stable of traditional and non-traditional basketball gameplay. Additionally, players will experience a more challenging Season Mode, where player management and balancing team chemistry come into play. Refined gameplay mechanics and Artificial Intelligence (A.I.) also help to create a more realistic and action-oriented gameplay experience. With an enhanced Conquest Mode and host of new mini-games, as well as downloadable content and expanded audio commentary, NBA 08 looks to take the portable NBA hoops crown once again. Get play-by-play from Ian Eagle and all-new color commentary from Mark Jackson. Realistic animation Wireless multiplayer gameplay - connect 4 different DS players with Ad Hoc mode ESRB Rated E for Everyone. ","torrent":{"xt":"urn:btih:8239c3f73e893977a2b0ed221ca462200bcee134","amp;dn":"NBA+08+%5BEnglish%5D%5BPSP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8239c3f73e893977a2b0ed221ca462200bcee134","infoHashBuffer":{"type":"Buffer","data":[130,57,195,247,62,137,57,119,162,176,237,34,28,164,98,32,11,206,225,52]},"announce":[],"urlList":[]}}