{"title":"WaterWorld  {h33t.com} {gkline}.avi","uid":3824841,"size":1047156736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82d074600abad22df6bc1d386a64fe8fe3ccda46&amp;dn=WaterWorld++%7Bh33t.com%7D+%7Bgkline%7D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gkline","files":1,"time":1191162669,"description":" &lt;a href=&quot; http://www.imdb.com/title/tt0114898/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0114898/&lt;/a&gt;\n\nWaterworld (1995)\n\nRated PG-13 Contains sexual situations, partial nudity, violence and profanity. \n\n\n2 hrs 16 mins \n\nSci-Fi  \n\nCast: Kevin Costner, Dennis Hopper, Jeanne Tripplehorn, Tina Majorino, Michael Jeter\nDirector: Kevin Reynolds\n\n \n \nSYNOPSIS\n   \nThe future has arrived, and it brings a world composed entirely of water, due to the melting of the polar ice caps. In this desperate society one must distill one&amp;#039;s own urine for drinking water, and land is only a myth people dream of. Roaming the high seas is the Mariner, a surly, selfish man/fish mutant with no name. But his loner existence changes when a woman named Helen and an orphaned girl named Enola save his life, and the Mariner reluctantly agrees to take them along with him. At first the Mariner has a rocky relationship with his two passengers; then he realizes that the tattoo on Enola&amp;#039;s back is a map leading to the never-seen &quot;Dryland&quot;. But as the trio struggles to decipher the map, they must also try to escape a band of filthy, reckless thugs known as &quot;Smokers&quot;, led by the maniacal, one-eyed Deacon. Then the Smokers kidnap Enola, turning the Mariner into a one-man killing machine desperate to rescue his human map.\nAnd only if he succeeds will they ever know the feel of solid ground beneath their feet.\n\nREVIEW\n\nThe polar ice caps have melted, and dirt is a prized commodity, like petrol in the Mad Max trilogy. In fact, almost everything in Waterworld is like the Mad Max trilogy (the movie could be called Wet Max), except for its pace. The director, Kevin Reynolds, doesn&amp;#039;t give us the cartoon-kinetic jolts of George Miller; he gives us exhausting physical realism. The relentless forward journey, over water instead of scorching desert, progresses against harsh and unforgiving backdrops, like the cattle drives in Anthony Mann&amp;#039;s westerns. Yet, for all the motion, we get no real sense of progression: The damned vast expanse of ocean always looks the same as it did two scenes ago. Reynolds wants us to experience the endless sea as the characters do: both wide open and smothering -- the way you felt as a kid, looking up at the stars in the night sky and feeling infinity come over you in a frightening rush. Some of the images have a suffocating grandeur. Water, water everywhere. \nImperfect, but underappreciated. Waterworld is a near-model fantasy: two hours and 15 minutes of loud, expansive fun. \n\n\n\n\nCodec: Xvid\nSize: 998MB\nRuntime: 02:15:08 \nResolution: 576x320 (1.80:1) \nBitrate: 931 kb/s\nFPS: 23.97\nQf: 0.211 bits/pixel\nAudio: English. No sub.\n96 kb/s (48/ch, stereo) CBR \n\n\nMy torrents:\n &lt;a href=&quot;\nhttp://www.h33t.com/userdetails.php?id=26111&amp;returnto=%2F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.h33t.com/userdetails.php?id=26111&amp;returnto=%2F&lt;/a&gt;","torrent":{"xt":"urn:btih:82d074600abad22df6bc1d386a64fe8fe3ccda46","amp;dn":"WaterWorld++%7Bh33t.com%7D+%7Bgkline%7D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d074600abad22df6bc1d386a64fe8fe3ccda46","infoHashBuffer":{"type":"Buffer","data":[130,208,116,96,10,186,210,45,246,188,29,56,106,100,254,143,227,204,218,70]},"announce":[],"urlList":[]}}