{"title":"Am Rande des Rollfeldes (12 Monkeys - french original 1962)","uid":3961897,"size":313338814,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83393d06803eba511bc1142a4655b272a073fea4&amp;dn=Am+Rande+des+Rollfeldes+%2812+Monkeys+-+french+original+1962%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Snorty5","files":1,"time":1199497332,"description":"La JetÃƒÂ©e - Am Rande des Rollfeldes\n\nFrankreich, 1962 (1. ÃƒÂ¶ffentliche AuffÃƒÂ¼hrung: 1964); Regie/Buch/Kamera: Chris Marker; Musik: Trevor Howard (und russische Ostersonnabend-Liturgie); Sprecher: Jean Negroni; Darsteller: HÃƒÂ©lÃƒÂ¨ne Chatelain - Davos Hanich - Jaques Ledoux - AndrÃƒÂ© Heinrich - Jacques Branchu - Pierre Joffroy - Etienne Becker -Philbert von Lifchitz - Ligia Borowczyk - Janine Klein - Bill Klein - Germano Facetti; Produktion: Argos Films\n\nOff-Kommentar\n\nDies ist die Geschichte eines Menschen, der von einem Bild aus seiner Kindheit gezeichnet wurde.\n\nDie Szene, die ihn durch ihre Gewaltsamkeit bestÃƒÂ¼rzte und deren Bedeutung er erst sehr viel spÃƒÂ¤ter begreifen sollte, trug sich auf der groÃƒ?en Aussichtsplattform des Flughafens Orly einige Jahre vor dem Beginn des III. Weltkrieges zu.\n\nAm Sonntag fahren die Eltern mit ihren Kindern nach Orly, um ihnen die startenden Flugzeuge zu zeigen. Das Kind, dessen Geschichte wir erzÃƒÂ¤hlen, sollte lange Zeit an die unbewegliche Sonne dieses Sonntags, an das am Rand der Plattform aufgepflanzte Dekor und an das Gesicht einer Frau zurÃƒÂ¼ckdenken.\n\nNichts unterscheidet Augenblicke, die in der Erinnerung haften bleiben, von den anderen: erst spÃƒÂ¤ter erkennt man sie daran, daÃƒ? sie eine Narbe hinterlassen haben.\n\nOft, fragte er sich, ob er dieses Gesicht, daÃƒ? das einzige Bild bleiben sollte, das sich aus der Friedenszeit ÃƒÂ¼ber die Zeit des Krieges hinweg erhielt, wirklich gesehen, oder ob er diesen Augenblick der ZÃƒÂ¤rtlichkeit selbst geschaffen hatte, um den Augenblick des Wahnsinns auszugleichen, der gleich darauf eintrat: dieser plÃƒÂ¶tzliche LÃƒÂ¤rm, die Geste der Frau, der stÃƒÂ¼rzende KÃƒÂ¶rper, das Geschrei der Leute auf der Aussichtsplattform und die Furcht. SpÃƒÂ¤ter begriff er, daÃƒ? er den Tod eines Menschen gesehen hatte.\n\nEinige Zeit danach kam die ZerstÃƒÂ¶rung von Paris.\n\nViele starben. Einige hielten sich fÃƒÂ¼r Sieger. Andere wurden gefangengenommen. Die Ãƒ?berlebenden richteten sich in den unterirdischen GÃƒÂ¤ngen von Chaillot ein.\n\nDie OberflÃƒÂ¤che von Paris und zweifellos des grÃƒÂ¶Ãƒ?ten Teils der Welt war unbewohnbar, durch die RadioaktivitÃƒÂ¤t verseucht. Die Sieger wachten ÃƒÂ¼ber ein Reich von Ratten. Die Gefangenen wurden Experimenten unterworfen, die jene Person stark zu fesseln schienen, die sich mit ihnen abgaben. Am Ende des Versuchs waren die einen enttÃƒÂ¤uscht, die anderen waren tot oder wahnsinnig.\n\nEines Tages trennt man den Mann, dessen Geschichte wir erzÃƒÂ¤hlen von den ÃƒÂ¼brigen Gefangenen und fÃƒÂ¼hrte ihn in den Versuchsraum.\n\nEr hatte Angst. Er hatte von dem Chef des Unternehmens gehÃƒÂ¶rt. Er glaubte einen wahnsinnigen Gelehrten gegenÃƒÂ¼berzutreten, einem Doktor Frankenstein. Er erblickte einen leidenschaftslosen Menschen, der ihm in aller Ruhe erklÃƒÂ¤rte, daÃƒ? die Mannschaft nun verdammt sei, daÃƒ? ihr der Raum verschlossen sei und daÃƒ? die einzige MÃƒÂ¶glichkeit, einen Weg zum Ãƒ?berleben zu finden, in der Dimension der Zeit liege. Durch ein Loch in der Zeit kÃƒÂ¶nnte man vielleicht Lebensmittel, Medikamente und Energiequellen befÃƒÂ¶rdern.\n\nDas also war der Zweck der Experimente ! Boten in die Zeit auszusenden, die die Vergangenheit und die Zukunft der Gegenwart zu Hilfe rufen sollten.\n\nAber der menschliche Geist erlitt eine Niederlage. In einer anderen Zeit aufzuwachsen bedeutete, ein zweites Mal, als Erwachsener, geboren zu werden. Dieser Schock war zu stark. Nachdem man auf diese Weise KÃƒÂ¶rper ohne Leben oder ohne BewuÃƒ?tsein in verschiedene Bereiche der Zeit geschickt hatte, konzentrierten sich die Erfinder auf Versuchspersonen, die mit einer starken Einbildungskraft begabt waren. Imstande, sich eine andere Zeit vorzustellen oder zu ertrÃƒÂ¤umen, wÃƒÂ¤ren sie vielleicht auch imstande, in dieser Zeit hinÃƒÂ¼berzuwechseln.\n\nDie Lagerpolizei spionierte sogar die TrÃƒÂ¤ume aus. Dieser Mann wurde unter Tausenden ausgewÃƒÂ¤hlt, weil er sich an ein Bild aus der Vergangenheit gebunden fÃƒÂ¼hlte.\n\nZunÃƒÂ¤chst geschieht weiter nichts als das HerausreiÃƒ?en aus der Gegenwart und ihren StÃƒÂ¼tzpfeilern. Man beginnt von neuem. Die Versuchsperson stirbt nicht, deliriert nicht. Sie leidet. Der Versuch geht weiter. Am zehnten Tage beginnen Bilder hervorzubrechen wie GestÃƒÂ¤ndnisse. Ein Morgen aus der Zeit des Friedens, ein wirkliches Zimmer. Wirkliche Kinder, wirkliche VÃƒÂ¶gel, wirkliche Katzen, wirkliche GrÃƒÂ¤ber. Am sechzehnten Tage steht er auf der Aussichtsplattform. Sie ist leer. Manchmal findet er einen Tag des GlÃƒÂ¼cks, aber anders, ein glÃƒÂ¼ckliches Gesicht, aber anders. Ruinen. Ein MÃƒÂ¤dchen, vielleicht das, welches er sucht. Er kreuzt ihren Weg auf der Plattform. Er sieht sie aus einem Auto lÃƒÂ¤cheln. Andere Bilder erscheinen, vermischen sich in einem Museum, das vielleicht sein GedÃƒÂ¤chtnis ist.\n\nAm dreiÃƒ?igsten Tag kommt es zu der Begegnung.\n\nDiesmal ist er sicher, sie wiederzuerkennen. Das ist ÃƒÂ¼brigens das einzige, dessen er sicher ist, in dieser Welt ohne Datum, die ihn zuerst durch ihre Reichtum ÃƒÂ¼berwÃƒÂ¤ltigt. Um ihn herum liegen mÃƒÂ¤rchenhafte Stoffe: Glas, Plastik, Schaumgummi. Als er aus seiner BetÃƒÂ¤ubung erwacht, ist die Frau verschwunden.\n\nDie Leiter des Experiments verschÃƒÂ¤rfen ihre Kontrolle und schicken ihn wieder auf den Weg. Die Zeit rollt erneut ab, wieder kommt der Augenblick vorbei. Diesmal ist er bei ihr und spricht mit ihr. Sie empfÃƒÂ¤ngt ihn ohne Erstaunen. Sie sind ohne Erinnerungen, ohne WÃƒÂ¼nsche. Die Zeit baut sich einfach um sie herum auf. Als einige Anhaltspunkte bleiben ihnen der Geschmack des Augenblicks, den sie erleben, und die Zeichen auf den Mauern.\n\nSpÃƒÂ¤ter halten sie sich in einem Garten auf. Er erinnert sich, daÃƒ? es GÃƒÂ¤rten gab. Sie fragte ihn nach seiner Halskette, einer Soldatenkette, die er am Anfang dieses Krieges trug, der eines Tages ausbrechen wird. Er erfindet eine ErklÃƒÂ¤rung.\n\nSie gehen. Sie bleiben vor der Scheibe eines Mammutbaumes stehen, die mit historischen Daten bedeckt ist. Sie spricht einen englischen Namen (Hitchcock ???) aus, den er nicht versteht. Wie im Traum zeigt er ihr einen Punkt auÃƒ?erhalb des Baums. Er hÃƒÂ¶rt sich sagen: ,,Ich komme von dort...``\n\n...und fÃƒÂ¤llt dorthin zurÃƒÂ¼ck, am Ende seiner KrÃƒÂ¤fte. Dann trÃƒÂ¤gt ihn eine neue Welle der Zeit hinweg. Vermutlich gibt man ihm eine neue Spritze.\n\nJetzt schlÃƒÂ¤ft sie in der Sonne. Er denkt, daÃƒ? in der Welt, in der er gerade wieder FuÃƒ? gefaÃƒ?t hat, ihre Lebenszeit schon weiter vorgerÃƒÂ¼ckt ist, daÃƒ? sie tot ist.\n\nSie wacht auf, und er spricht mit ihr. Von einer Wahrheit, die zu phantastisch ist, um ganz faÃƒ?bar zu sein, bewahrt er das Wesentliche: Ein fernes Land, eine weite zu durchmessende Entfernung. Sie hÃƒÂ¶rt ihm zu, ohne zu spotten.\n\nIst es noch derselbe Tag? Er weiÃƒ? es nicht mehr. Sie werden noch eine unendliche Zahl ÃƒÂ¤hnlicher SpaziergÃƒÂ¤nge machen, auf denen sich zwischen ihnen ein stummes Vertrauen einstellt, ein Vertrauen im Reinzustand. Ohne Erinnerungen, ohne PlÃƒÂ¤ne. Bis zu dem Augenblick, da er eine Barriere vor ihnen fÃƒÂ¼llt.\n\nSo ging die erste Serie von Experimenten zuende. Es folgt eine Reihe von Versuchen, bei denen er die Frau in verschiedenen Zeiten wiederfinden sollte. Sie empfÃƒÂ¤ngt ihn wie selbstverstÃƒÂ¤ndlich. Sie nennt ihn ihr Gespenst. Eines Tages scheint sie Angst zu haben. Eines Tages neigt sie sich ÃƒÂ¼ber ihn. Er weiÃƒ? nie, ob er sich selbst zu ihr begibt, ob er zu ihr dirigiert wird, ob er alles erfindet oder ob ertrÃƒÂ¤umt.\n\nUngefÃƒÂ¤hr am fÃƒÂ¼nfzigsten Tage begegnen sie sich in einem Museum voller uralter Tiere.\n\nNun haben sich die Bewegungen genau eingespielt. An den gewÃƒÂ¼nschten Zeitpunkt geschickt, vermag er sich dort ohne MÃƒÂ¼he aufzuhalten und zu bewegen. Auch sie scheint an alles gewÃƒÂ¶hnt. Wie eine natÃƒÂ¼rliche Erscheinung akzeptiert sie die Anwesenheit dieses Besuchers, der erscheint und verschwindet, der existiert, spricht, mit ihr lacht, schweigt, ihr zuhÃƒÂ¶rt und davongeht.\n\nAls er sich im Versuchsraum wiederfand, fÃƒÂ¼hlt er, daÃƒ? etwas anders geworden war. Der Lagerchef war da. Aus Bemerkungen, die in seiner NÃƒÂ¤he geÃƒÂ¤uÃƒ?ert wurden, entnahm er, daÃƒ? nach dem Erfolg der AusflÃƒÂ¼ge in die Vergangenheit nun beabsichtigt sei, ihn in die Zukunft zu schicken. Die Erregung ÃƒÂ¼ber ein solches Abenteuer lenkte ihn fÃƒÂ¼r einige Zeit von dem Gedanken ab, daÃƒ? die Begegnung im Museum die letzte gewesen war.\n\nDie Zukunft war besser verteidigt als die Vergangenheit.\n\nNach weiteren, noch anstrengenderen Versuchen gelang es ihm, mit der kommenden Welt in Verbindung zu treten. Er durcheilte einen umgewandelten Planeten, ein neuaufgebautes Paris mit zehntausend unbegreiflichen Avenuen. Andere Menschen erwarteten ihn. Die Begegnung war kurz. Offensichtlich wiesen sie die Schlacken einer vergangenen Epoche zurÃƒÂ¼ck. Er trug seine Lektion vor. Da die Menschheit ÃƒÂ¼berlebt hatte, konnte sie ihrer eigenen Vergangenheit nicht die Mittel zum Ãƒ?berleben verweigern. Dieser Sophismus wurde wie eine Maskierung des Schicksals angenommen. Man ÃƒÂ¼berreichte ihm eine Energiezentrale, die ausreichte, um die ganze menschliche Industrie wieder in Bewegung zu versetzen, und die Pforten der Zukunft wurden wieder geschlossen.\n\nKurze Zeit nach seiner RÃƒÂ¼ckkehr wurde er in einen anderen Teil des Lagers gebracht.\n\nEr wuÃƒ?te, daÃƒ? seine WÃƒÂ¤chter ihn nicht schonen wÃƒÂ¼rden. Er war in ihren HÃƒÂ¤nden ein Instrument; sein Bild aus der Kindheit hatte als KÃƒÂ¶der gedient, um ihn in einen geeigneten Zustand zu versetzen; er hatte ihren Erwartungen entsprochen und seine Aufgabe erfÃƒÂ¼llt. Er wartete nur noch darauf, liquidiert zu werden, aber irgendwo in ihm war die Erinnerung an eine Zeit, die er zweimal durchlebt hatte. Am Grunde dieses Limbus empfing er die Botschaft der Menschen der Zukunft. Auch sie reisten in der Zeit, und noch mÃƒÂ¼heloser. Nun waren sie da und boten an, ihn unter sich aufzunehmen. Sein Begehren war jedoch anderer Natur: mehr noch als nach dieser befriedeten Zukunft verlangte es ihm nach der Welt seiner Kindheit und nach dieser Frau, die ihn vielleicht erwartete.\n\nAls er sich nun auf der groÃƒ?en Aussichtsplattform von Orly befand, an diesem warmen Sonntag der Vorkriegszeit, an dem zu verweilen ihm erlaubt war, dachte er mit einer Spur von SchwindelgefÃƒÂ¼hl, daÃƒ? das Kind, das er einmal gewesen war, sich auch hier befinden mÃƒÂ¼sse, um die Flugzeuge zu betrachten. Aber zuerst suchte er das Gesicht einer Frau am Rande der Plattform. Er lief auf sie zu. Und als er den Mann erkannte, der ihm aus dem unterirdischen Lager gefolgt war, verstand er, daÃƒ? man der Zeit nicht entkommt, und daÃƒ? jener Augenblick, den er als Kind schon gesehen und der ihn seither nicht losgelassen hatte, der Augenblick seines eigenen Todes war.\n\nAus: ,,Kinemathek``, Nr. 18/Juni 1965, S. 9-14. ","torrent":{"xt":"urn:btih:83393d06803eba511bc1142a4655b272a073fea4","amp;dn":"Am+Rande+des+Rollfeldes+%2812+Monkeys+-+french+original+1962%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83393d06803eba511bc1142a4655b272a073fea4","infoHashBuffer":{"type":"Buffer","data":[131,57,61,6,128,62,186,81,27,193,20,42,70,85,178,114,160,115,254,164]},"announce":[],"urlList":[]}}