{"title":"American Ghost Hunts 101","uid":3795066,"size":366739171,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:835557b933bae26a6fc53ee158009f1b8f2131f1&amp;dn=American+Ghost+Hunts+101&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"krackaboi","files":2,"time":1188903215,"description":"*******************************************************************************\n                   American Ghost Hunts 101\n\n*******************************************************************************\n &lt;a href=&quot;\nhttp://www.amazon.com/American-Ghost-Hunts-101/dp/B000TRMJ4E&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/American-Ghost-Hunts-101/dp/B000TRMJ4E&lt;/a&gt; &lt;a href=&quot;\nhttp://www.americanghosthunts101.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.americanghosthunts101.com/&lt;/a&gt; (includes a trailer)\n\nAudio Format.........: MP3\nEncoder..............: Fraunhofer MP3Enc\nBitrate..............: 128 (CBR)\nHz...................: 48,000\nChannels.............: Stereo\nSource...............: DVD\n\nVideo Format.........: xvid\nVideo Bitrate........: 774\nResolution...........: 512 X 384\nFPS..................: 29.970\nSource...............: DVD\nOriginal Format......: NTSC\nGenre................: Paranormal\n\nPosted by............: nan\nPosted to............: alt.binaries.paranormal\nNews Server..........: Giganews\n\n-------------------------------------------------------------------------------\n\nFrom Texas to South Carolina, see exclusive videos and fascinating photos of\nthe paranormal taken by average folks.  We serve up our wonders and questions\nto the paranormal experts.\n\nEnjoy a night on the town as we go on a ghost tour in San Antonio, Texas, visiting\nAlamo Plaza and a few reknowned haunted hotels nearby.  Go on an evening\nexcursion with a team of ghost hunters roaming through a prison cemetery in\nHuntsville, Texas.\n\nWe&amp;#039;ll visit haunted restaurants, a dinner theatre and even a museum that has\nunexplained pipe smoke.\n\nHear what one parapsychologist has to say about paranormal activity as we visit\nthe Rhine Research Center in South Carolina.\n\nYou might be surprised to hear what one ghost researcher and well reknowned\nauthor learned about a famous haunted railroad crossing San Antonio, Texas.  Is\nit a timeless hoax?\n\nHear from a lady who claims she saw an apparition of a little girl strolling out of\nher bathroom out of nowhere.  See an actual still photo taken by the lady&amp;#039;s friend.\n\nAmerican Ghost Hunts 101 demonstrates good ghost hunting and shows how\nfacts and data can easily be gathered the wrong way.  This is what makes this\nshow unique from the others.  AGH 101 is not just about face value testimonials,\nbut supports the stories with other view points and scenarios.\n\n\n----------\n\n&quot;This program takes you into a world of wonder and then it makes you wonder about the world of ghosts.&quot; George Pennacchio KABC-TV, Los Angeles From Texas to North Carolina, see exclusive videos and fascinating photos of the paranormal taken by average folks. We serve up our wonders and questions to the paranormal experts. Enjoy a night on the town as we go on a ghost tour in San Antonio, TX, visiting Alamo Plaza and a few reknowned haunted hotels nearby. Go on an evening excursion with a team of ghost hunters roaming through a prison cemetary in Huntsville, TX. Good Stuff! We&amp;#039;ll visit haunted restaurants, a dinner theater and even a museum that has unexplained pipe smoke ! Hear what one parapsychologist has to say about paranormal activity as we visit the Rhine Research Center in South Carolina! We dont mean to burst anyone&amp;#039;s bubble, but, you might be surpirsed to hear what one ghost researcher and well reknowned author learned about a famous haunted railroad crossing in San Antonio, Texas. Is it a timeless hoax? Hear from a lady who claims she saw an apparition of a little girl strolling out of her bathroom out of nowhere. See an actual still photo taken by the lady&amp;#039;s friend. American Ghost Hunts 101 demonstrates ghost hunting and shows how facts and data can be gathered the wrong way.. This is what makes this show unique from the others. AGH 101 is not just about face value testimonials, but supports the stories with other view points and scenarios ! This is a must keep show for all Ghost Hunters!","torrent":{"xt":"urn:btih:835557b933bae26a6fc53ee158009f1b8f2131f1","amp;dn":"American+Ghost+Hunts+101","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"835557b933bae26a6fc53ee158009f1b8f2131f1","infoHashBuffer":{"type":"Buffer","data":[131,85,87,185,51,186,226,106,111,197,62,225,88,0,159,27,143,33,49,241]},"announce":[],"urlList":[]}}