{"title":"Hatsukoi - First Love (Japan movie, 2000)","uid":3549097,"size":611680256,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:837260d4a678f85e50f7d787a6122533c83b4faa&amp;dn=Hatsukoi+-+First+Love+%28Japan+movie%2C+2000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pemu","files":1,"time":1162331019,"description":"115 min.\nDirector : Tetsuo Shinohara\nCast : Rena Tanaka, Mieko Harada, Hiroyuki Sanada\n\nA teenage girl finds a love letter written by her mother to her first love. With her mother in the hospital, Satoka sets out on a quest to locate her mother\\&amp;#039;s first love and arrange a romantic reconciliation. But reality isn\\&amp;#039;t as simple as plan: the guy turns out to be a hopeless gambler and a deadbeat with marriage problems of his own. Satoka\\&amp;#039;s naive dream runs into some painful adult realities before resolving itself in an unexpected, moving way. Â©Hatsukoi Production Committee\n\nEng hardsubs\n\nMy thoughts: A teenage girl whose relationship with her father is deterioratad one day after another\nas her mother is hospitalised for cancer. One day while cleaning her mother\\&amp;#039;s room, she finds an unsent letter designated to a man.\nIs this her mother\\&amp;#039;s first love? The girl is off to look for the man. \n\nThis movie is absolutely beautiful, the flow of the story is very pleasant.\nHiroyuki Sanada is featured in the film, he plays a good-for-nothing convincingly.\nActing from Rena Tanaka is top notch who happens to be one of my very favourites japanese actress who can actually act. She is prolly the best actress in her generation!\nThis is one of the best coming of age films, I just love this film! Joe Hisaishi\\&amp;#039;s music is perfect for the film! I just don\\&amp;#039;t find any flaws in this film as more japanese dramas are headin \ntoward art house films which is beyond my comprehension. Nevertheless, the film is a must-see for drama fans! I remember after seeing this film I craved for more japanese dramas!","torrent":{"xt":"urn:btih:837260d4a678f85e50f7d787a6122533c83b4faa","amp;dn":"Hatsukoi+-+First+Love+%28Japan+movie%2C+2000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837260d4a678f85e50f7d787a6122533c83b4faa","infoHashBuffer":{"type":"Buffer","data":[131,114,96,212,166,120,248,94,80,247,215,135,166,18,37,51,200,59,79,170]},"announce":[],"urlList":[]}}