{"title":"Pooh's Heffalump Movie","uid":3586248,"size":4648745007,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:84226be11ecf3d7fe875a6cfbcfca390aacdf4a9&amp;dn=Pooh%5C%27s+Heffalump+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"silvia-","files":42,"time":1167474803,"description":"Pooh&amp;#039;s Heffalump Movie\n\n[img]http://www.dailyinfo.co.uk/images/cinema/poohs-heffalump-movie.jpg[/img]\n\nDirector: Frank Nissen\nYear: 2005\nLenght: 65 mins.\nAudio: Dolby Digital. English and Spanish\nSubtitles: English and Spanish\nDVD Features: Game Time: Hide &amp;#039;N Seek With Roo And Lumpy. Play hide &amp;#039;n seek in the Hundred Acre Wood with Roo and Lumpy, Backstage Disney: Welcome To The Family, Lumpy\nSystem: PAL\n\nDVD9 a DVD5 \n\nA welcome dose of old-fashioned animation for parents and a delightful, easy-to-follow experience for kids, this is a nostalgic cartoon feature for fans of the Pooh series. Rabbit, Piglet, Tigger, Eyore, Winnie the Pooh, Kanga, and Roo, are all on hand for a lesson in how to fearlessly face new and possibly strange experiences. The plot concerns the hysterical panic that arises when the gang learns of a nearby family of dreaded heffalumps. Their subsequent excursion into Heffalump Hollow to capture the beasts is not a great success, but the littlest member of each side--Lumpy (Kyle Stanger) and Roo (Nikita Hopkins)--end up meeting and becoming friends. Mutual distrust lingers amongst the other animals however, and when Pooh and company try to capture Lumpy, his well-meaning but overprotective mom (Brenda Blethyn) charges to the rescue. The always relevant &quot;don&amp;#039;t judge a book by its cover&quot; moral is conveyed with subtlety and wit, the animation style is clean and calming, and the scenery is rendered with an easy-on-the-eye pastel palette. There&amp;#039;s an assortment of fun and lovely songs as well, including: &quot;The Horrible, Hazardous Heffalumps,&quot; &quot;Shoulder to Shoulder,&quot; and &quot;Little Mister Roo&quot; by Carly Simon. Parents may heave a nice sigh of relief to see that an animated film doesn&amp;#039;t have to be rife with hyperkinetic action and over-the-top clowning to excite their kids&amp;#039; imagination.\n\nSpecial Winnie Pooh at www.solodvd.org","torrent":{"xt":"urn:btih:84226be11ecf3d7fe875a6cfbcfca390aacdf4a9","amp;dn":"Pooh%5C%27s+Heffalump+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84226be11ecf3d7fe875a6cfbcfca390aacdf4a9","infoHashBuffer":{"type":"Buffer","data":[132,34,107,225,30,207,61,127,232,117,166,207,188,252,163,144,170,205,244,169]},"announce":[],"urlList":[]}}