{"title":"BOLLAND &amp; BOLLAND - Greatest Hits","uid":3949885,"size":86789095,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:866f46a19951e823a78b66c2bb0e208e3d1e5f23&amp;dn=BOLLAND+%26+BOLLAND+-+Greatest+Hits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"badbigdog","files":-1,"time":1198773277,"description":"CD TRACKS       1.\tWait For The Sun\n\t\t2.\tSummer Of '71\n\t\t3.\tMexico I Can't Say Goodbye\n\t\t4.\tOhh La La\n\t\t5.\tLeaving Tomorrow\n\t\t6.\tSpaceman\n\t\t7.\tUFO (We Are Not Alone)\n\t\t8.\tYou're In The Army Now\n\t\t9.\tMusic Man\n\t\t10.\tFlorida\n\t\t11.\tVirginia In The Rain\n\t\t12.\tLast Apache\n\t\t13.\tHold On\n\t\t14.\tHeart And Soul\n\t\t15.\tI Won't Go Anywhere\n\t\t16.\tIf You Leave Meolland                                BOLLAND &amp; BOLLAND are two Dutch music producers - the brothers Rob and Ferdi Bolland.\n\nThey produced and wrote for artists like Falco (including the No.1 hit &quot;Rock Me Amadeus&quot;), Samantha Fox (&quot;Love House&quot;), and wrote the Status Quo hit &quot;IN THE ARMY NOW&quot; - which they released under their own name in 1981 and which was also recorded by Gerard Joling. As musicians in their own right they released their first eponymous album in 1975.\n\nTheir hit singles career however started as early as 1972 with Wait for the sun in an folky a cappella-style following the success of Simon and Garfunkel and their Dutch equivalents Greenfield and Cook. When in 1976 their success started to wane, they turned towards a more electronic sound, an early example of which can be heard in Spaceman, a 1978 hit in Holland.\n\nOutside the Netherlands they shortened their name to Bolland and established their name internationally with the release of the concept album The Domino Theory. The edgy, tuneful album is a critical look at war and US intervention in foreign conflicts from the viewpoint of the foot soldier. It contains the single &quot;You're In The Army Now&quot;, which became a small hit. In South Africa, the land of their birth, the single peaked at number 9 in May 1982, sales largely boosted by the fact that South Africa had a conscription army at the time. Francis Rossi, lead singer of Status Quo, is quoted widely as having heard the song while on the Autobahn in Germany. He eventually persuaded Quo to record it, and the single reached number 2 in the UK in Autumn 1986. However, the song is best understood as part of the original Bolland album.----They are the owners of Bolland Studios, located in Blaricum, the Dutch countryside.[W I K I P E D I A http://en.wikipedia.org/wiki/Bolland_&amp;_Bolland]","torrent":{"xt":"urn:btih:866f46a19951e823a78b66c2bb0e208e3d1e5f23","amp;dn":"BOLLAND+%26+BOLLAND+-+Greatest+Hits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866f46a19951e823a78b66c2bb0e208e3d1e5f23","infoHashBuffer":{"type":"Buffer","data":[134,111,70,161,153,81,232,35,167,139,102,194,187,14,32,142,61,30,95,35]},"announce":[],"urlList":[]}}