{"title":"Frontline-A Hidden Life (Outing and Fall of Spokane Mayor Jim We","uid":3695756,"size":662339412,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:86d4f937df7f1b5509b434a310a3440cbdce1c81&amp;dn=Frontline-A+Hidden+Life+%28Outing+and+Fall+of+Spokane+Mayor+Jim+We&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"5cardstud","files":1,"time":1179970856,"description":"Jim West was the Mayor of Spokane, Washington (map), a large and influential city in its particular region. By population, the US Pacific North-West (PNW) is a moderate-to-liberal place, politically.  But in the larger and less-populated expanse west of the Cascade Mountains, a much more conservative bent is the norm. \n\nJim West was a popular, life-time politician, who grew up in this area.   For him, coming out of the closet was unthinkable.  People of his generation, as well as the people in his area, were strict conformists.  If his secret was ever learned, Jim feared it would end many life-long friendships, disappoint others, and end his beloved career. \n\nAs a State Senator and career Republican, he supported and sponsored the Party&amp;#039;s bills -- including several anti-gay rights measures.  Many never had hope of becoming law in this more Libertarian state, but they did help solidify support within his conservative district.  He married at 39 (to a rather masculine-looking woman, in my opinion).  Now in his 50s, he was the esteemed Mayor of the largest city for 300 miles (400 km).\n\nThen one day, the unthinkable happened.\t\t","torrent":{"xt":"urn:btih:86d4f937df7f1b5509b434a310a3440cbdce1c81","amp;dn":"Frontline-A+Hidden+Life+%28Outing+and+Fall+of+Spokane+Mayor+Jim+We","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d4f937df7f1b5509b434a310a3440cbdce1c81","infoHashBuffer":{"type":"Buffer","data":[134,212,249,55,223,127,27,85,9,180,52,163,16,163,68,12,189,206,28,129]},"announce":[],"urlList":[]}}