{"title":"[Kung Fu] Bruce Lee, The Legend Lives On (2002) - DVD/Rmvb","uid":3790920,"size":319245874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8741514cca5c333a727d9b2ca989a947cd0d2dab&amp;dn=%5BKung+Fu%5D+Bruce+Lee%2C+The+Legend+Lives+On+%282002%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1188600799,"description":"Bruce Lee, The Legend Lives On (2002)\n\n\nReview by John Wallis:\n\nIt is always sad when people die before their time, and it is a testament to Bruce Lee&amp;#039;s legend that his fame continues, so much so, that I&amp;#039;ve seen at least four different documentary programs this year featuring either cursory or a wealth of info about the enigmatic martial artist.\n\nOne of the unfortunate things setbacks any popular figure or event faces when being compiled for a documentary is the filmmakers being able to say something new. From the start, I got a sense that Bruce Lee: The Legend Lives On was going to be one of those cases where I wasn&amp;#039;t going to see much I hadn&amp;#039;t already seen. And, by the end, when I saw that there were absolutely no credits, no one taking responsibility for the documentary, well, I wasn&amp;#039;t too surprised. Not that it was terrible, but it was just a slapdash affair of the standard interviews with his brother, his students (including right hand man Taky Kimura and the recently deceased James Coburn) , one of his school teachers, various actors/film producers (including Jackie Chan and the Vice Pres of Golden Harvest), interspersed with the standard Lee bio info , some clips from his films and candid stills. Some if the info is in annoying scrolling (or should I say &amp;#039;stuttering&amp;#039;) text at the bottom of the screen. \n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:8741514cca5c333a727d9b2ca989a947cd0d2dab","amp;dn":"%5BKung+Fu%5D+Bruce+Lee%2C+The+Legend+Lives+On+%282002%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8741514cca5c333a727d9b2ca989a947cd0d2dab","infoHashBuffer":{"type":"Buffer","data":[135,65,81,76,202,92,51,58,114,125,155,44,169,137,169,71,205,13,45,171]},"announce":[],"urlList":[]}}