{"title":"[Kung Fu] Wu Dang II (Monica Chan, Norman Tsui, 2007) - DVD/Rmvb","uid":3839367,"size":5117150651,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8768352b781031ca535b9f507b557abca7b6dc38&amp;dn=%5BKung+Fu%5D+Wu+Dang+II+%28Monica+Chan%2C+Norman+Tsui%2C+2007%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":46,"time":1192205873,"description":"Wu Dang II (Monica Chan, Norman Tsui, 2007) - Rmvb, Episodes 01-40\n\nPlot: Ming Dynasty, Reign of Yongle. When the attempts of both Zhang Wu Ji and Han Yi Shang to gain admission into the training ground of Shaolin Temple meet with failure, a Shaolin elder assigns them on undercover mission to Mt Wu Dang to uncover the mystery of Wu Dang martial arts and 13 Postures of Tai Chi. Over the years, having witnessed the magnanimity and chivalry of Zhang San Feng, Zhang Wu Ji&amp;#039;s love and admiration for Wu Dang is further fortified. Because of this, he faces opposition and chastisement from Han Yi Shan. Zhang San Deng&amp;#039;s sublime skills enable him to defeat various pugilists and earn the approval from Emperor Yongle. Zhang Wu Ji, after undergoing numerous hardships, eventually comprehends the essence of Tai Chi and defeats various vile martial arts masters who seek to threaten Wu Dang. The Imperial Court awards Wu Dang with a Martial Arts Supremacy plaque. Yet, when everyone is celebrating the success of Wu Dang, Zhang Wu Ji isolates himself as he ponders over the past. \n\nWu Jing, who plays a legendary figure Zhang Wu Ji in Wu Dang 2 Â«??2Â», is especially particular about the action scenes. In order to best portray the authentic side of Wudang kungfu, he went to Chen Village again to seek further tutelage. He trained mostly in practical combat there. He is leaving everything to his management to help him break into Hollywood. However, he does not consider Hollywood as the be-all and end-all dream of Asian stars, since there are areas in which Chinese culture excels in, such as martial arts, though Hollywood has an edge in technology. He laments the lack of martial artists on the screen in the recent years and looks forward to teaming up with Jet Li some day.\n\nMonica Chan who plays a downtrodden princess in Wu Dang 2, doesn&amp;#039;t get to wear exquisite clothes and has lots of fight scenes to do. Things didn&amp;#039;t go on very smoothly for her either. She once had a heatstroke due to the weather. On another occasion, she hurt herself on the lips with a General Guan&amp;#039;s sabre she had to wield in one scene.\n\nRef.: www.wu-jing.org/News\n &lt;a href=&quot;\nhttp://us.yesasia.com/en/PrdDept.aspx/code-c/section-videos/pid-1004541973/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://us.yesasia.com/en/PrdDept.aspx/code-c/section-videos/pid-1004541973/&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:8768352b781031ca535b9f507b557abca7b6dc38","amp;dn":"%5BKung+Fu%5D+Wu+Dang+II+%28Monica+Chan%2C+Norman+Tsui%2C+2007%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8768352b781031ca535b9f507b557abca7b6dc38","infoHashBuffer":{"type":"Buffer","data":[135,104,53,43,120,16,49,202,83,91,159,80,123,85,122,188,167,182,220,56]},"announce":[],"urlList":[]}}