{"title":"Joss Stone - 1st 2 CDs","uid":3702374,"size":204762389,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8798b588f40de7f14b7c252a98726e93f36b8073&amp;dn=Joss+Stone+-+1st+2+CDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marckos","files":28,"time":1180682631,"description":"Artist : Joss Stone\nTitle : The Soul Sessions/Mind, Body &amp; Soul\nGenre : Soul\nSource : CD\nRipper : EAC 0.95b (Secure mode)\nCodec : MP3\nEncoder : LAME 3.97\nCommand line : -V 0 --vbr-new -m s\nBitrate : VBR ~250kbps\nMode : Stereo\nFrequency : 44100Hz\nTags : ID3v2.3 (With covers images)\n\nBiography\nEnglish singer Joss Stone was just 16 when she emerged on the pop/rock scene in 2003. Ready to take on the pop domination of Britney and Christina with a sound wise beyond her teenage years, Stone positioned herself among the more established and credible artists (Norah Jones, Jill Scott, Nikka Costa) reigning adult alternative pop/rock. Born Joscelyn Eve Stoker in 1987, the sun-kissed blonde darling grew up listening to American soul and R&amp;B. Aretha Franklin was a favorite, and in time, Stone realized that she possessed an impressive throaty vocal style with both depth and emotion, much like her idols. In 2002, Stone took a chance. She left her family home in Devon, England (also home to Coldplay&amp;#039;s Chris Martin), for an audition in New York City. Stone wowed S-Curve CEO Steve Greenberg with her rendition of Donna Summer&amp;#039;s &quot;On the Radio&quot; and landed herself a deal. R&amp;B/soul pioneer Betty Wright joined Stone for her first recording, becoming an instant mentor and friend to the impressionable girl with big dreams. Vocalist Angie Stone and the Roots also assisted Stone in the studio in 2003 for what became The Soul Sessions EP. A riveting set of 1970s classics by the likes of Laura Lee and Bettye Swann, as well as tracks by Wright and Franklin, The Soul Sessions EP was accentuated by fellow Miami soul musicians Benny Latimore, Timmy Thomas, and Little Beaver. S-Curve couldn&amp;#039;t wait to tell the world about their one-of-a-kind starlet with an old soul, and so Stone hurriedly crafted this neo-soul gem in just four days. In early 2004, Stone introduced herself to the MTV generation with the funky strut of &quot;Fell in Love with a Boy,&quot; which was a rework of the White Stripes hit &quot;Fell in Love with a Girl.&quot; The Soul Sessions was a huge success, selling over two million copies. Mind, Body &amp; Soul was released in 2004, again from S-Curve Records, and its 14 tracks featured 12 that were written or co-written by Stone. After performances at London&amp;#039;s Live 8 in the summer of 2005 and Superbowl XL in early 2006, the singer set about recording her next album. Introducing Joss Stone, which she claimed was a more accurate representation of what she was, and featured appearances from Common and the ever-elusive Lauryn Hill, came out in 2007.\n\nAll Music: http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3bfwxqy0ldte~T1\n\nSample: http://media.putfile.com/03---Fell-In-Love-With-A-Boy","torrent":{"xt":"urn:btih:8798b588f40de7f14b7c252a98726e93f36b8073","amp;dn":"Joss+Stone+-+1st+2+CDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8798b588f40de7f14b7c252a98726e93f36b8073","infoHashBuffer":{"type":"Buffer","data":[135,152,181,136,244,13,231,241,75,124,37,42,152,114,110,147,243,107,128,115]},"announce":[],"urlList":[]}}