{"title":"UK - 20071001 - Immigrants: The Inconvenient Truth","uid":3828880,"size":730425344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87a1292265b75e5c6526902a5cf46115edf34305&amp;dn=UK+-+20071001+-+Immigrants%3A+The+Inconvenient+Truth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grimerking","files":1,"time":1191449716,"description":"UK TV\n\nChannel 4 Documentary - Dispatches\n\nImmigrants: The Inconvenient Truth\n\nImmigration is a pressing and hotly debated issue in the UK - the Cambridgeshire police chief has called for more staff and resources to cope with a sudden influx of migrant workers, local authorities have attacked the way migrant numbers are calculated and the Liberal Democrats have proposed an amnesty for illegal immigrants who have resided in Britain for more than 10 years.\n\nBut what is really known about the multitudes of immigrant communities in Britain and the impact they have on the economy?\n\nChannel 4 News presenter Jon Snow reveals the contributions made by different immigrant groups, drawing on exclusive research from the Institute for Public Policy Research. This brand new statistical information breaks down 25 of Britain&amp;#039;s biggest immigrant groups to paint the most revealing economic portrait to date of the one in nine people living in the UK who were born abroad.\n\nDispatches will reveal which immigrant groups, by country of origin, appear as a debit and which as a credit on Britain&amp;#039;s balance sheet - uncovering some key facts about immigration.\n\nDispatches meets the former asylum seekers who have a council house while, in the same town, UK born citizens sit on the waiting list. The film examines the cost to the health service of dealing with the thousands of people who bring potentially life-threatening diseases into the UK and reveals the unlikely group which makes the biggest financial contribution to the economy.\n\nAmong the facts revealed by this report are: which immigrant groups are the most likely to be unemployed, which earn the most, which groups have the least education and which come here far more qualified than the average British-born person.\n\nThis edition of Dispatches will give a voice to the issues many people feel they can&amp;#039;t talk about and which many politicians are afraid to tackle.\n\nFile Properties:\n\nDVB-T Capture (Freeview)\nGordian Knot Conversion\nVideo Codec = XviD\nResolution = 640x352\nRunning Time = 47:04\nAudio Codec = 128kbps CBR","torrent":{"xt":"urn:btih:87a1292265b75e5c6526902a5cf46115edf34305","amp;dn":"UK+-+20071001+-+Immigrants%3A+The+Inconvenient+Truth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a1292265b75e5c6526902a5cf46115edf34305","infoHashBuffer":{"type":"Buffer","data":[135,161,41,34,101,183,94,92,101,38,144,42,92,244,97,21,237,243,67,5]},"announce":[],"urlList":[]}}