{"title":"Naruto Shippuuden pack episode 11-20 HDTV XviD-Dattebayo","uid":3961447,"size":1785716786,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:88cedd1150f45926c2e97b34bed9f8b1cee732ff&amp;dn=Naruto+Shippuuden+pack+episode+11-20+HDTV+XviD-Dattebayo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"markofink","files":10,"time":1199475361,"description":"Episode 11 : The Medical Ninja&amp;#039;s Pupil\n  Sakura proceeds to extract the poison from Kankuro and even succeeds in making an antidote.  Using the scrap of Sasori&amp;#039;s mask Kankuro recovered, Kakashi summons his ninja dogs to begin tracking. \t\n\nEpisode 12 : The Retired Old Woman&amp;#039;s Determination\n  Pakkun locates the Akatsuki cave and relays the information to Team Gai.  Temari wants to go with Team Kakashi, but it is Chiyo who volunteers instead.  Both teams are intercepted by Akatsuki members on route;  Team Gai by Kisame and Team Kakashi by Itachi.\n\nEpisode 13 : The Fated Meetings\n  Kisame ambushes Team Gai in the water and transforms the landscape with a torrent of water.  Itachi intercepts Team Kakashi in the woods, but this time Kakashi is ready to face him.\n\n\t\n\tEpisode 14 : Naruto&amp;#039;s Growth\n  The battle between Kisame and Gai grows fiercer, forcing Gai to use the Eight Gates. Naruto is trapped in Itachi&amp;#039;s genjutsu and attempts to break free using his own power.\n\n\t\n\tEpisode 15 : The Hidden Orb&amp;#039;s Name\n  Naruto is freed from Itachi&amp;#039;s genjutsu and is aided by Kakashi to finish off Itachi; at the same time Gai is victorious over Kisame.  But both teams soon realize that they&amp;#039;ve been fooled by Akatsuki.\n\n\t\nEpisode 16 : The Secret of the Jinchuuriki\n  Having been delayed by the shapeshift doubles of Itachi and Kisame, both Team Kakashi and Team Gai need to rest for the night before continuing their pursuit.\n\n\t\n\tEpisode 17 : Gaara&amp;#039;s Death\n  After a short night&amp;#039;s rest, both Konoha teams arrive at the entrance to the Akatsuki hideout.  But they are too late, the extraction jutsu is complete and Gaara is already dead.\n\n\t\n     Episode 18 : Break In! Button Hook Entry\n  Team Gai and Team Kakashi work together to take down the barrier blocking the entrance to the Akatsuki hideout.  But once inside, they discover that it is already too late for Gaara.\n\n\t\n  Episode 19 : The Trap is Sprung! Team Gai&amp;#039;s Enemies\nWhile Team Kakashi encounters Deidara and Sasori, Gai&amp;#039;s team is held back by exact replicate clones of themselves.  Naruto is enraged by Gaara&amp;#039;s death and is taunted into going after Deidara.  Kakashi has no choice but to follow and leaves Sakura and Chiyo to face Sasori.\n\t\nEpisode 20 : Hiruko vs the Two Female Ninja\n  The battle between Sasori and the team of Sakura and Chiyo begins.  Thanks to Chiyo&amp;#039;s battle experience, Sakura is able to close in on Sasori and destroy his outer puppet body, Hiruko.","torrent":{"xt":"urn:btih:88cedd1150f45926c2e97b34bed9f8b1cee732ff","amp;dn":"Naruto+Shippuuden+pack+episode+11-20+HDTV+XviD-Dattebayo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88cedd1150f45926c2e97b34bed9f8b1cee732ff","infoHashBuffer":{"type":"Buffer","data":[136,206,221,17,80,244,89,38,194,233,123,52,190,217,248,177,206,231,50,255]},"announce":[],"urlList":[]}}