{"title":"Damn Vulnerable Linux 1.2 Strychnine","uid":3699180,"size":832820129,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:88df1c2d994c1f89d0fdfd65b647b316d5502b5e&amp;dn=Damn+Vulnerable+Linux+1.2+Strychnine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"damnvulnerablelinux","files":1,"time":1180342604,"description":"Damn Vulnerable Linux (DVL) is a Linux-based (modified Damn Small Linux) tool for IT-Security &amp; IT-Anti-Security and Attack &amp; Defense.\n\nThe constant website for Damn Vulnerable Linux (DVL) is located at http://www.damnvulnerablelinux.org. \n\nDamn Vulnerable Linux (DVL) is for educational purposes only!\n\nActually, it is a perverted Linux distribution made to be as insecure as possible. It is collection of IT-Security and IT-Anti-Security tools. Additional it includes a fullscaled lesson based environment for Attack &amp; Defense on/for IT systems for self-study or teaching activities during university lectures. It&amp;#039;s a Live Linux Distro, which means it runs from a bootable CD in memory without changing the native operating system of the host computer. As well it can be run within virtual machine environments, such as qemu or vmware. There is no need to install a virtual machine if you use the embedded option. Its sole purpose in life is to put as many security tools at your disposal with as much training options as it can. It contains a huge ammount of lessons including lesson description - and solutions if the level has been solved by a community member at crackmes.de.\n\nDamn Vulnerable Linux (DVL) is meant to be used by both novice and professional security personnel but is not ideal for the Linux uninitiated. Damn Vulnerable Linux (DVL) assumes you know the basics of Linux as most of your work will be done from the command line. If you are completely new to Linux, it&amp;#039;s best you stop playing with this system. ","torrent":{"xt":"urn:btih:88df1c2d994c1f89d0fdfd65b647b316d5502b5e","amp;dn":"Damn+Vulnerable+Linux+1.2+Strychnine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88df1c2d994c1f89d0fdfd65b647b316d5502b5e","infoHashBuffer":{"type":"Buffer","data":[136,223,28,45,153,76,31,137,208,253,253,101,182,71,179,22,213,80,43,94]},"announce":[],"urlList":[]}}