{"title":"Lydia Laska - White Trash Attack","uid":3571931,"size":14720573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:893112daf835d87b371bb51e0c8f6d85cecbaf30&amp;dn=Lydia+Laska+-+White+Trash+Attack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Videoboi","files":1,"time":1165431267,"description":"In 2002, two hobos left Norway for the golden streets of Europe, but they only found trash.\n\n\nBusking for beer cans and canned beans, living in dumpsters and car wrecks, songs started popping up like cockroaches. After seven months failing to find a singer, a fistfight nearly killed the band before it was even formed.\n\nHowever, much like vermin these blokes wouldnt betray their pestilent nature and years later, (now a five-piece) once again found themselves plotting against the mundane.\n\nDrawing inspiration from The Velvet Underground, Stooges, Sonic Youth, Bowie and oldschool black metal, the band recorded their first ep, brimming with infectious songwriting and brutally honest lyrics. Like a fucked up concoction of honey and bee stings, White Trash Attack feels like a bottle of Macallan single malt smashed in your face.\n\nLive, Lydia Laska is an experience in itself; crossdressing, violence/making out, whipping and throwing pinecones at the audience and not giving a fuck. During their May performance at John Dee, lead singer Candy Whorehole bit guitar player Solans nipples off, and at the following gig he was banned from the venue for hitting a security guard... Who knows what future concerts might bring?\n &lt;a href=&quot;\nhttp://myspace.com/lydialaska&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://myspace.com/lydialaska&lt;/a&gt;\n","torrent":{"xt":"urn:btih:893112daf835d87b371bb51e0c8f6d85cecbaf30","amp;dn":"Lydia+Laska+-+White+Trash+Attack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"893112daf835d87b371bb51e0c8f6d85cecbaf30","infoHashBuffer":{"type":"Buffer","data":[137,49,18,218,248,53,216,123,55,27,181,30,12,143,109,133,206,203,175,48]},"announce":[],"urlList":[]}}