{"title":"[Wakeboard] The Butter Effect","uid":3561042,"size":3026030822,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:898ff53c21aaaedc1e7a6a5e02bf6c82eaeda8b3&amp;dn=%5BWakeboard%5D+The+Butter+Effect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pjelew84","files":2,"time":1163980992,"description":"Release date:   4/2005\nAvailable formats: DVD\nDVD extras: Additional bonus disc with behind the scenes footage, outtakes, commentaries and interviews.\nRun time: 42 minutes\nMedium: 100% 16MM, 0% Digital\nLocations: Mexico, Washington, Florida, California\nCameramen: Sean Kilgus, Mark Shonka\nProducer: BFY Productions\n\n\nMain riders: Shawn Watson, Scott Byerly, Aaron Reed, Ben Greenwood, Andrew Adkison, Rusty Malinoski, Brent Starr, Danny Harf, Keith Lyman, w/appearances by Shane Bonifay, Parks Bonifay, Gerry Nunn and Chad Sharpe\n\nDescription: Captured entirely in 16mm film, the Butter Effect, the newest wakeboard film project from BFY Productions and acclaimed producer, Sean Kilgus, proves once again that film truly is king. Taking almost a year to make and shot on location in some of the most premier and secretive waterways in Florida, Nor Cal, Washington and in a remote volcanic lake in Mexico, this film is slated for being the best wakeboard video of 2005.\n\nWith explosive rider sections from the top wakeboarders and wakeskaters in the world like Danny Harf, Shawn Watson, Rusty Malinoski, Brent Starr, Aaron Reed, Ben Greenwood, Andrew Adkison, Keith Lyman and Scott Byerly and unbelievably progressive cameo appearances from Shane and Parks Bonifay, Gerry Nunn and Chad Sharpe, the Butter Effect undoubtedly will captivate your attention and give you an unimagineable cinematic experience.\n\nAlong with the feature film DVD which contains over 40 minutes of some of the most amazing riding footage ever captured; like Ben Greenwood&amp;#039;s hammering break-through section, Rusty Malinoski&amp;#039;s fearless and valiant attempts and successes of conquering the enormous Fox Riders Co. rail, Shane, Parks and Watson&amp;#039;s murderous shredding of the roof top rail, and Reed and Byerly&amp;#039;s mindblowing wakeskating section, just to mention a few, this package will also contain a bonus DVD. On this disc, you will find never before seen rider footage, side splitting outtakes and commentary, interviews and and a myriad of interactive options. \n\n\nREAD THIS!!: I FOUND THIS TORRENT ON ANOTHER SITE, I&amp;#039;M NOT SURE YOU CAN GET THIS COMPLETE!!","torrent":{"xt":"urn:btih:898ff53c21aaaedc1e7a6a5e02bf6c82eaeda8b3","amp;dn":"%5BWakeboard%5D+The+Butter+Effect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898ff53c21aaaedc1e7a6a5e02bf6c82eaeda8b3","infoHashBuffer":{"type":"Buffer","data":[137,143,245,60,33,170,174,220,30,122,106,94,2,191,108,130,234,237,168,179]},"announce":[],"urlList":[]}}