{"title":"Google Earth v4.2 Incl Patch-P2PCRACKERS","uid":3849829,"size":13473024,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:89b323cb9d32a4f2d77ea6be0ee100409ce29b5f&amp;dn=Google+Earth+v4.2+Incl+Patch-P2PCRACKERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Antje14","files":1,"time":1192878056,"description":"Parody group P2PCRACKERS have come up with the goods in Google Earth 4.2. (Btw, love the NFO :p) Most of you know what Google Earth is so there?s no need to get in-depth about it, but basically you can look anywhere on the globe thanks to some nice little (Well, rather large) satellite photos. New in 4.2 is the ability to look into space. Anyway this comes in 3 archives, and includes a patch.\n\nFrom popular destinations like Maui and Paris, to the reaches of the universe, to local restaurants and schools, Google Earth puts a wealth of Earth and space imagery and other geographic information right on your desktop. See satellite images of your childhood home, read articles from Wikipedia, or view images of distant galaxies from the Hubble Space Telescope.\n\nProgram Features:\n\n    * Take virtual tours around the world\n      It?s the universe inside your PC; an atlas, encyclopedia and flight simulator, all rolled into one. Just point and zoom to any place you want to explore. Cities, mountains, and valleys are depicted in high-resolution 3D, along with related information. Or, fly amongst the stars to see planets, galaxies, and nebulae.\n    * Find local information and plan trips\n      Search for local businesses, and get driving directions. Results are shown on-screen. You can easily layer multiple searches, save results to folders, and share placemarks with others.\n    * Explore multimedia content\n      Find rich multimedia information from the web community and popular sources like National Geographic. Explore the left sidebar and look for the Geographic Web and Featured Content layers as well as layers for 3D buildings, parks, schools, hospitals, airports, shops and more.\n    * Share information about your travels\n      Placemark places you have visited, then share them with friends. Google Earth lets you add tons of information to placemarks, for example ? photos, notes, restaurant reviews and more. View thousands of such data points created by other Google Earth users, using .KML, the Google Earth file format.\n\nRelease Name: Google.Earth.v4.2.Incl.Patch-P2PCRACKERS\nSize: 12.85 MB (13,475,777 bytes), p2pge42*","torrent":{"xt":"urn:btih:89b323cb9d32a4f2d77ea6be0ee100409ce29b5f","amp;dn":"Google+Earth+v4.2+Incl+Patch-P2PCRACKERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89b323cb9d32a4f2d77ea6be0ee100409ce29b5f","infoHashBuffer":{"type":"Buffer","data":[137,179,35,203,157,50,164,242,215,126,166,190,14,225,0,64,156,226,155,95]},"announce":[],"urlList":[]}}