{"title":"Dial M for Murder - Hitchcock - 1954","uid":3581414,"size":5864466432,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8b9eeb23be233e46bf9c4ea12e102d1168a75291&amp;dn=Dial+M+for+Murder+-+Hitchcock+-+1954&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spammerdespam","files":17,"time":1166740108,"description":"One of the most famous Hitchcock films, &quot;Dial M for Murder&quot; from 1954\n\n\n\nPlot synopsis from allmovie.com (http://www.allmovie.com/cg/avg.dll?p=avg&amp;sql=1:13590):\n\nBased on the popular mystery play by Frederick Knott, Dial M For Murder is more talky and stagebound than most Hitchcock films, but no less enjoyable. British tennis pro Ray Milland suspects that his wealthy wife Grace Kelly is fooling around with handsome American Robert Cummings. Milland blackmails a disgraced former army comrade (Anthony Dawson) into murdering Kelly and making it look like the work of a burglar. But Milland&amp;#039;s carefully mapped-out scheme does not take into account the notion that Kelly might fight back and kill her assailant. When the police (represented by John Williams) investigate, Milland improvises quickly, subtly planting the suggestion that his wife has committed first-degree murder. He almost gets away with it; to tell you more would spoil the fun of the film&amp;#039;s final thirty minutes. Hitchcock claimed that he chose this single-set play because he was worn out from several earlier, more ambitious projects, and wanted to &quot;recharge his batteries.&quot; Compelled by Warner Bros. to film Dial M for Murder in 3-D, Hitchcock perversely refused to throw in the standard in-your-face gimmickry of most stereoscopic films of the era?though watch how he visually emphasizes an important piece of evidence towards the end of the film.\n\n\nCompletely untouched, ripped with DVDDecrypter.\n\nSize: 5.46 GB\nPlaying time: 101 minutes\nAudio: English, French, Italian\nSubs: Dutch, English, French, Italian, German, Arabic, Bulgarian\n\nDon&amp;#039;t often upload stuff, so let me know whether this works","torrent":{"xt":"urn:btih:8b9eeb23be233e46bf9c4ea12e102d1168a75291","amp;dn":"Dial+M+for+Murder+-+Hitchcock+-+1954","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b9eeb23be233e46bf9c4ea12e102d1168a75291","infoHashBuffer":{"type":"Buffer","data":[139,158,235,35,190,35,62,70,191,156,78,161,46,16,45,17,104,167,82,145]},"announce":[],"urlList":[]}}