{"title":"2005.04.NIX_-_Namibia_Internet_Exchange.ogm.avi","uid":3695244,"size":32721849,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:8d17f7e0664f044975242b9312e5731ad993800f&amp;dn=2005.04.NIX_-_Namibia_Internet_Exchange.ogm.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tslab","files":1,"time":1179933104,"description":"NIX - Namibia Itnernet Exchange\nCSD 2005 - Team 4 &lt;a href=&quot;\nhttp://www.tslab.ssvl.kth.se/csd/projects/0504/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tslab.ssvl.kth.se/csd/projects/0504/&lt;/a&gt;\n\nCSD - http://www.tslab.ssvl.kth.se/csd/\n\nCSD - A framework for learning by solving real world problems\nIn the Communication Systems Design framework, teams of senior MSc and PhD students, faculty members, consulting experts and a wide spectrum of stakeholders, work together, using leading edge technologies, to solve real world problems. The projects are requested and sponsored by external project owners and the project portofolio includes projects from industry, including private and public sector companies, public administration, civil society and organisations for international development cooperation. CSD runs over one semester at a time with 15-20 projects ran by groups of 5-6 students.\nStudents from around the world work together with external project owners and experts\n\nStudents are recruited from different education programmes and universities, by their competence, in order to provide the projects with the best possible staffing. Interested students are asked to read the prerequisite requirements here.\n\nThe projects are formulated and sponsored by external project owners. The project portofolio (see under Current Project Themes or Project web sites in the right column) so far includes projects from industry, including commercial and/or public sector companies as well as startups, public administration, civil society, organisations for international development cooperation, etc.\n\nStudents, teachers and interested project owners who want to participate in the 2007 course offerings should sign up in the list on the left hand side of this page. Students can check the prerequisite requirements here.\nCall for Partners\nNew partners and projects are always welcome! Download the project principal guidelines below. Sign up at the home page of the appropriate course offering in the left column of this page to define the project you and your organisation would like to submit. Project owners act as prinicipals, i.e. steer and influence the work so that it is carried out in the direction of the contract.\n","torrent":{"xt":"urn:btih:8d17f7e0664f044975242b9312e5731ad993800f","amp;dn":"2005.04.NIX_-_Namibia_Internet_Exchange.ogm.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d17f7e0664f044975242b9312e5731ad993800f","infoHashBuffer":{"type":"Buffer","data":[141,23,247,224,102,79,4,73,117,36,43,147,18,229,115,26,217,147,128,15]},"announce":[],"urlList":[]}}