{"title":"Messenger Plus! Live","uid":3832903,"size":3756866,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8d7ef666094d2bb718d958bc124c1bcbec953d5a&amp;dn=Messenger+Plus%21+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"00061205","files":1,"time":1191757525,"description":"Messenger Plus! Live is an add-on for Windows Live Messenger which adds lots of features and extras that make your instant messenger easier, more useful or just tons more entertaining.\n\nTabbed Chats\nUse a tabbed web browser? Even if you don&amp;#039;t, you might find tabbed conversations useful for organizing your chats by converting a myriad of windows into a simple single one. Vertical tabs on the left, normal tabs on the top. You name it. You can also use tabs to group just some special chats and keep all the rest in normal windows if you want.\n\nQuick Texts\nTired of always typing the same? Meet quick texts and text replacements: automatic and customizable messages that can be sent with a simple shortcut or typed command, or automatic text replacing to use written shortcuts or using it as a word filter.\n\nCustom Sounds\nThe Custom Emotion Sound feature brings sound integration in Messenger to the next level by allowing users to send their own sounds during a conversation. Sounds are played instantly on both ends and are transferred automatically and transparently when needed.New emotion sounds can be easily created from existing sound files (such as MP3s) or can be recorded live from a microphone or other audio source but, if sound authoring isn&amp;#039;t your thing, thousands of sounds can be found in the public database or imported from sound packs.\n\nColors, formatting and commands\nMessenger Plus! gives you the possibility to choose any color you want for front and background, and add formatting, such as bold, italic, underlined and stoke-out. It also lets you control almost every aspect of Messenger via text shortcuts called commands, much like the ones in traditional IRC chat rooms.\n\nContacts on Desktop\nSimilar to what ICQ used to offer, you can show the status of any desired contact on your desktop in the form of small floating windows. You can drag and drop messages or links into these to send a message to the contact, or drop a file to start a transfer.\n\nPolygamy (run multiple Messenger sessions)\nJust check a box in the Messenger Plus! Live Preferences and you&amp;#039;ll be up and running for logging into more than one Messenger session at the same time, all integrating with Plus! correctly and without patching any files.","torrent":{"xt":"urn:btih:8d7ef666094d2bb718d958bc124c1bcbec953d5a","amp;dn":"Messenger+Plus%21+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7ef666094d2bb718d958bc124c1bcbec953d5a","infoHashBuffer":{"type":"Buffer","data":[141,126,246,102,9,77,43,183,24,217,88,188,18,76,27,203,236,149,61,90]},"announce":[],"urlList":[]}}