{"title":"Killtrocity_V2_Hacks-4-snacks.com","uid":3790889,"size":448166415,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:8e223cc8e53b55000be982ee9373871dd7905cbf&amp;dn=Killtrocity_V2_Hacks-4-snacks.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"symph0ny","files":1,"time":1188599399,"description":"This is Version 2 of the popular Killtrocity Map pack by xHeadshotmastax, and friends at hacks-4-snacks.com.  Read the readme, the installation has a few steps.\n\n~~~ Readme ~~~\n\nHello there, and I welcome you to the second version of the Killtrocity Mappack.\nI want you to read this guide proper and thorough in order for you (the noob) to patch these maps.\n \nFirst we go through a checklist:\n \nMake sure you have Microsoft Framework 1.1 installed (http://www.google.com)\nMake sure you have Microsoft Framework 2.0 installed (http://www.google.com)\nMake sure you have FTP software and a working FTP connection to your xbox. (!important!)\n \n **NOTE: For help making a FTP connection go to http://www.xbox-scene.com ** REALLY EASY!!\n \n \n*Needed to take the original maps and new maps from your HDD, and needed to ftp the modded maps*\n \n \nHaving those two Frameworks will allow you to run:\nthe UPDATE REMOVER tool (made by Detox)\nthe Serenity autopatcher\n \n**NOTE: DO NOT FORGET TO USE CLEAN .MAP FILES IN THE NEXT FEW STEPS!!!**\n \nSecondly we go through yet another checklist in order to prepare the patchprocess:\n \nPut every old and new map in the &quot;original maps&quot; directory, including the mainmenu.map.\n (Get the maps from your disc and/or HDD with FTP)\n .\nOriginal maps needed(18 in total):\n \nMainmenu.map\nShared.map\n \n \nAscension.map\nBackwash.map\nBeaver Creek.map\nBurial Mounds.map\nCoagulation.map\nCyclotron.map\nDeltatap.map\nDune.map\nElongation.map\nFoundation.map\nGemini.map\nHeadlong.map\nMidship.map\nTurf.map\nWarlock.map\nWaterworks.map\nZanzibar.map\n \n \n2.       Now copy over the shared.map from your halo 2 disc into the modified maps folder \n \n \n3.       Execute the Serenity Autopatcher. It?ll now start making the .map files into the ?modified maps? folder.\n \n \n4.       After the patching process click  ?YES? when it asks you to resign the maps.\n \n \n5.       YAY you have patched all of the maps!!! \n If you don?t know how to make a separate game folder for this on your xbox proceed to step 6.\n***NOTE: For those of you who do know how to make separate game folder, and or make a ISO don?t forget to disable the autoupdate in the default.xbe using the update remover tool.***\n Now get a clean default.xbe from the halo 2 disc you have.. Open it up in the UPDATE REMOVER tool, and click ?disable Autoupdate?, and if you want you can press ?Rename Internal Name? also\n\n  \nIf you want to create another game folder on your xbox (or you want to make an ISO file so you can burn it to a DVD.) so you can select the new Halo 2 Killtrocity from your dashboard then do like so:\n \n \n \n6.       Make a folder called ?Halo 2 Killtrocity? on your desktop.\n \n \n7.       Make a folder called ?maps? and put this in the root of the ?Halo 2 Killtrocity? folder.\n \n \n8.       Also DO NOT FORGET to transfer the ?fonts? folder into the ?maps? directory you have just made.\n \n \n9.       Get the ?media? folder from your halo 2 disc or your xbox harddrive, and the ?default.xbe? file, and put these in the root of the ?Halo 2 Killtrocity? folder. \n \n \n10.    The ?Halo 2 Killtrocity? folder now looks like this:\n - Halo 2 Killtrocity\n   - maps\n     - fonts\n   - media\n   default.xbe\n \nGet all of the maps from the ?modified maps? folder and put them in the ?maps? folder.\n \n \nNow you can either:\n \n - Transfer over the ?Halo 2 Killtrocity? folder to the games directory on your xbox by using FTP to play the new mappack from your xbox-hdd\n \n or\n \n - Create a new ISO from this folder, so you can burn this to a DVD.\n \n Download: xISO\n \n Now install and in the program choose &quot;Make a xISO&quot; and find the &quot;Halo 2 Killtrocity&quot; folder on your desktop and hit &quot;OK&quot;.  Make sure you give the program a few minutes to create the .iso and that&amp;#039;s it.\n \n Then open up what ever burning software program you have and load the .iso and burn away!\n \n \nHAVE FUN PLAYING!!! \n P.S. If you still don?t get it, LEARN TO READ u homo!!! =P\n every step has been mentioned, so you can?t possibly mess up,\n unless you are truly a number 1 noobchampion.\n\n EVEN MY GRAMPS CAN DO THIS!!!\n \nPS IVE INCLUDED QWIX AN AWESOME PROGRAM TO MAKE YOUR ISO WITH AND FOR SOME OTHER STUFF","torrent":{"xt":"urn:btih:8e223cc8e53b55000be982ee9373871dd7905cbf","amp;dn":"Killtrocity_V2_Hacks-4-snacks.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e223cc8e53b55000be982ee9373871dd7905cbf","infoHashBuffer":{"type":"Buffer","data":[142,34,60,200,229,59,85,0,11,233,130,238,147,115,135,29,215,144,92,191]},"announce":[],"urlList":[]}}