{"title":"FireStarter_PC.rar","uid":3565255,"size":696285743,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:90bc8f2e4ea2c01e80e5a1acb5bbcd77f2e52658&amp;dn=FireStarter_PC.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Wit]-Ã‚Â­[in","files":1,"time":1164549918,"description":"After testing a preview build of GSC Game World&amp;#039;s shooter FireStarter, we were optimistic to see how the FPS community would receive it. Recently, the final version of the game arrived to the AT office, and we played through some multiplayer LAN matches as well as the single-player campaign. A majority of gamers will see this game as a rip-off of Unreal Tournament. Although there a number of aspects making this action game a similar experience to playing games like UT and Quake 2, there&amp;#039;s also a variety of welcomed unique features that should compel any FPS fan to try it out.\n\nTo kickoff we&amp;#039;d like to commend the developers for attempting to enwrap FireStarter in a reasonably appealing story which helps players understand a bit more about the world they are involved in and the creatures and machines that are so strongly after their blood. In a nutshell, your character enters a virtual combat simulation and finds himself trapped by a deadly virus which unexpectedly altered the rules of the game. The catch is that you must complete the whole game within 48 hours or you will be killed. This simplistic approach to the narrative provides sufficient grounds for clear-cut FPS action. We strongly believe that a majority of gamers won&amp;#039;t even bother to find out what the game is actually about. It all revolves around gunning down as many opponents as possible. We regret, however, that the Russian dudes at GSC Game World didn&amp;#039;t invest a bit more time and effort into improving on a promising single-player sci-fi gothic-flavored FPS setting. For some reason though, the developers opted to stick with an overly gloomy gothic look portrayed throughout the entire game - a somewhat irritating aspect of the design (more on that further on).\n\nThe first disappointing characteristic of FireStarter is the surprising exclusion of online support (A FPS that doesn&amp;#039;t support online play? Unforgivable. -Six). Unfortunately, due to such a serious omission, we feel there&amp;#039;s no hope in hell this game will last long under the looming shadow of the increasingly dominant UT 2004. (And it&amp;#039;s not even out yet! - 2Lions) However, the game centers around LAN play, allowing gamers to try out a range of multiplayer modes - Deathmatch, Hunting, Slaughter, and Co-op. Each mode can be addictive, especially when a large number of players enter the combat zone. Switching between a praiseworthy assortment of classic Unreal inspired and Quake style weaponry, players will find many ways to blow their opponents to bits, ranging from plasma guns, mortars, machine guns, mini-guns, rockets launchers, etc. Certain maps are well-designed and should provide adequate grounds for some decent multiplayer action.\n\nThe inclusion of characters in FireStarter helps spice up the gameplay in both single-player and multiplayer. Like we&amp;#039;ve mentioned in our hands-on preview - we also recommend you give this article a gander, so you can get a clearer picture of how the single-player campaign is played) there are several characters you may choose from - Marine, Policeman, Agent, Cyborg, Mutant, and Gunslinger. Every character differs in weapon proficiency, armor, speed, and health capacity. The upgrading option also delivers a welcomed boost to the gameplay. For example, every eliminated creature leaves its soul behind. Collecting them can increase your character&amp;#039;s speed for a specific amount of time, provided you took the time to upgrade the appropriate skill before entering the arena. The time limit stretches and the character&amp;#039;s velocity increases each time you upgrade the skill. Other skills were also included, allowing you to improve the damage effect of heavy and light weaponry, raise the default health bar, etc. All these elements may not sound like much, but we found them to be an appreciated addition to the gameplay.\n\nOne of the most pleasing aspects of FireStarter is the intuitive map system and interface which helps gamers find their way around combat zones. At the beginning of the game, you&amp;#039;re liable to take about 10 to 15 minutes of gameplay before you know your way around. Also, even gamers with average FPS skills can complete the game in roughly ten to twelve hours tops. Yep, that sure sounds short, doesn&amp;#039;t it? Still, all through the single-player mode we witnessed a solid AI routine present with each opponent. Foes appear to handle themselves pretty well and will take every available opportunity to fire from a distance or to locate you if you decide to hide in a remote part of the map.\n\nWe must stress that the FS engine, sadly, doesn&amp;#039;t borrow any aspects from GSC Game World&amp;#039;s X-Ray technology that powers the upcoming shooter, S.T.A.L.K.E.R.. Don&amp;#039;t take this the wrong way though; FireStarter runs fairly well even when you beef up all the visual parameters to the max. The thing is we were disappointed with character modeling and animation which clearly don&amp;#039;t come off well in the game. Other effects, however, improve the overall visual appeal; like particle effects, colorful explosions, bullet shells and blood flying everywhere, effective use of lighting and reflections, and so forth. Regrettably, this game suffers from an extremely annoying camera issue that often screws things up when you&amp;#039;re in mid-combat. Each time a new weapon or an artifact spawns, the game will pause for a few seconds as the camera quickly shifts away from the first-person view to show you exactly where you can pick up a specific item. It&amp;#039;s kind of like hitting &amp;#039;escape&amp;#039; during an intense shoot-out and swiftly returning to the game. This can be quite disorienting if you&amp;#039;re caught in a firefight. And that&amp;#039;s putting it mildly. To our disappointment, players are not allowed to disable this camera feature, so it remains a constant nuisance during the entire game. Another drawback is the aforementioned gloominess in the overall design. Although each map appears to be furnished with a sufficient amount of polys and textures, the bleak atmosphere can soon become dreary.\n\nSince the game has no (or very little) story and character dialogue, players won&amp;#039;t be disappointed with the quality of voice acting (seeing how there is none). It would have been nice though, if the sound designing team incorporated more responses from enemies when they get hit - some of them sound too repetitive. Other audio features are quite good, so you&amp;#039;ll be treated to authentic-sounding explosions, gunfire, and similar things. The music is fairly solid and keeps a good pace with the action. Well, by fairly solid, I mean standard, or better yet, mediocre.","torrent":{"xt":"urn:btih:90bc8f2e4ea2c01e80e5a1acb5bbcd77f2e52658","amp;dn":"FireStarter_PC.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90bc8f2e4ea2c01e80e5a1acb5bbcd77f2e52658","infoHashBuffer":{"type":"Buffer","data":[144,188,143,46,78,162,192,30,128,229,161,172,181,187,205,119,242,229,38,88]},"announce":[],"urlList":[]}}