{"title":"BT - This Binary Universe","uid":3554769,"size":4543043197,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:91a358a37b35356909b1257bdfbdf21f9069cc69&amp;dn=BT+-+This+Binary+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hedkandi","files":42,"time":1163117643,"description":"The artist known as BT (Brian Transeau) was initially known for his pioneering work in trance music and now creates film scores and does arranging and production for pop albums, all with an emphasis on cutting-edge sonic landscapes. He did the score for the film Monster, as well as The Fast and the Furious and Under Suspicion, and for the TV series Tommy Lee Goes to College. \n\nThe idea for this new disc was to combine seven examples of his unique approach to both electronic music and film scoring with seven original animated short films by some of leading-edge animators and computer artists around today. The films were created in high definition so they will be available for the new generation of hi-def formats. Plus BT will go on tour of 25 cities with This Binary Universe starting in September, performing the soundtrack live in surround sound with the projected films in  venues around the U.S. \n\nBT attempts an artistic synthesis of the images and sound in the seven shorts. There is a close unity of the music and sound, sometimes the sounds almost seeming to generate the images as does the soundtrack music in the Animusic DVDs. Most of the sounds are fairly subtle, and the beat wasn\\&amp;#039;t as continuous or prominent as I had expected from the small amount of trance/dance music I have heard on the Internet. The third film &amp; track, The Internal Locus, has as a main theme a piano passage which sounds very much like it comes from Debussy\\&amp;#039;s Sunken Cathedral.  The Anhtkythera Mechanism (named after a supposed ancient Greek \\&quot;computer\\&quot; discovered at the bottom of the Aegean Sea) uses similar keyboard sounds giving a dreamy underwater sonic effect.  In general I find this electronic music more enjoyable than most \\&quot;serious\\&quot; electronic music today, but not being a twenty-something it\\&amp;#039;s not exactly the music of my life.  Hence the \\&quot;depending\\&quot; rating on the stars above.\n\nSome of the films have a trippy New Age appearance, such as the dreamlike moonlight flight of the robot creature on the front cover in Dynamic Symmetry.  But others are so abstract and minimalist that they lost me.  I think the music would appeal to me more if I hadn\\&amp;#039;t spent a good deal of my life working with analog recording tape.  Several of the special effects BT uses may sound cutting-edge to young ears, but to mine they sound like serious problems with an analog tape deck - tape pulling away from the heads, bad splices, poor connections, overload etc.  It probably doesn\\&amp;#039;t disturb most listeners to these admittedly extremely creative sonic environments. \n\nThe 5.1 channel DTS surround mix is vital to the best effect of BT\\&amp;#039;s scoring.  Often the primary attribute of the listening experience is the feeling of a vast and continually changing but unidentifiable sonic soundfield 360 degrees around you.  In this regard the provided standard CD loses much of the audio experience by being only two channel. (But it\\&amp;#039;s certainly better than gluing the CD and DVD back-to-back!) \n\nTracks/Films: \nAll That Makes Us Human, \nDynamic Symmetry, \nThe Internal Locus, \n1.618, \nSee You on the Other Side, \nThe Anhtkythera Mechanism, \nGood Morning Kaia.\n\nThe DVD that i upload only have DTS AUDIO","torrent":{"xt":"urn:btih:91a358a37b35356909b1257bdfbdf21f9069cc69","amp;dn":"BT+-+This+Binary+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a358a37b35356909b1257bdfbdf21f9069cc69","infoHashBuffer":{"type":"Buffer","data":[145,163,88,163,123,53,53,105,9,177,37,123,223,189,242,31,144,105,204,105]},"announce":[],"urlList":[]}}