{"title":"Let's Re-Make / Lets Remake - ART book","uid":3564909,"size":3743584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e4c0fdd75b53ea005037470842c47a01b9a206&amp;dn=Let%5C%27s+Re-Make+%2F+Lets+Remake+-+ART+book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"isakn","files":3,"time":1164495194,"description":"Let?s Re-Make\n &lt;a href=&quot;\nhttp://www.letsremake.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.letsremake.info/&lt;/a&gt;\n\nLet?s Re-make is a collaborative art project by Bonnie Fortune and Brett Bloom.\n\nBrett Bloom is an artist and activist. He works with the Chicago-based groups Temporary Services and Department of Space and Land Reclamation,\nand the Hamburg-based projektgruppe. He helps run Groups and Spaces - a platform for collecting and distributing information on people working\nin independent groups and/or running non-commercial spaces.\n\nBonnie Fortune is a Chicago based art organizer. She collaborates with uncontrollable reprobates in goods and services of intangible significance,\nand occasionally will give you directions on how to get there. Currently, her main projects are Free Walking (www.freewalking.org) and\nIn the Weather (www.intheweather.org), with Chicago artist Melinda Fries. In 2004, she graduated from the School of the Art Institute of Chicago\nand started her Free Walking Project (www.freewalking.org), a curatorial framework for exploring her adopted city while talking about ideas of public space,\ndecay, lost histories, and horizons. In the Weather is a growing compendium of directions for self-guided walks, online and in guidebook form.\nThese projects and others have been included in exhibitions in Chicago, Atlanta, Toronto, and North Adam\n\nIntroduction to The Library of Radiant Optimism for Let\\&amp;#039;s Re-Make the World:\n\nWe started the library as way to gather, look at, and catalog a groundswell of optimistic and visionary activities in the late 1960s and early 1970s.\nWe had discussions about the similarities between a handful of books we knew of, and the culture of Mess Hall, an experimental cultural center in Chicago\nthat we have both been active in for over three years. Mess Hall is organized around an \\&quot;economy of generosity,? freely sharing information and materials.\nThe books are important precursors to Mess Hall, embracing the grass roots exchange of information and themes of self and community empowerment.\nThese books are written from the counter-culture. Their authors were interested in communicating their direct experience as it related to their experiments\nfor living in harmony with the natural landscape, building sustainable communities, and so on. We were excited to read about practical applications of\noptimistic ideas for radical change, and to continue putting our own ideas into this tradition.\n\nThere are parallels between the cultural and political climate of the 1970s and current global conditions. However, we feel that an important difference\nis in the absence of a massive counter-cultural movement for change. We face many of the same problems ? large-scale ideological wars, energy crises,\nenvironmental devastation, destructive global capitalism and more. The hopeful quality of these books encourages us in developing a movement of our own,\nin the form of how-to manuals with the explicit intent of building a new society of optimistic resistance. This gives us hope as we go through our experiments;\nsome things will not work, but the diversity of investigations in living creatively means that more possibilities for intelligent solutions will appear.\n\nWe will add these and more books from around the world, and our own projects to the history, and are currently looking for similar books and projects in Denmark.","torrent":{"xt":"urn:btih:91e4c0fdd75b53ea005037470842c47a01b9a206","amp;dn":"Let%5C%27s+Re-Make+%2F+Lets+Remake+-+ART+book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e4c0fdd75b53ea005037470842c47a01b9a206","infoHashBuffer":{"type":"Buffer","data":[145,228,192,253,215,91,83,234,0,80,55,71,8,66,196,122,1,185,162,6]},"announce":[],"urlList":[]}}