{"title":"FS2004 - Oceanflight Simulation - MegaHubsUSA","uid":3862576,"size":59754006,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:92110ce9732aaa25ec256f32d8e0a11175797ca9&amp;dn=FS2004+-+Oceanflight+Simulation+-+MegaHubsUSA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"4X-AXG","files":1,"time":1193589589,"description":"Los Angeles - New York JFK - Chicago O&amp;#039;Hare - Atlanta - Houston G. Bush - Orlando\n\nA quite outstanding deal - MegaHubsUSA packs together six of the busiest and most important airport hubs in the US today into one easy product. Nowhere else can you get such great value for money, each airport works out at just over 4 dollars (3 euros) each! These airports were developed by the internationally recognized SimFlyers Associated and to acquire them previously would have cost approximately US$145 (EUR113). \n\n\nEach airport features realistic buildings and objects with full texturing, an active docking system at the terminals, active jetways, numerous aircraft and vehicles, objects, cars, buses, service vehicles - everything is illuminated and lit at night. Runways and taxiways including all markings and hundreds of signs, all with realistic lighting. Documentation with airport map and background information about the airports yesterday and today. \n\n\nService vehicles at each active terminal gate: After parking and docking at the gate the jetway docks with your aircraft, then an armada of supply and catering vehicles arrives. A baggage loader is there to unload the baggage and the baggage car and trailers are ready to take it to the terminal. A water truck refreshes your stock of water. The catering truck is there to supply new food for the convenience of your passengers, the push back truck already is waiting and the fuel truck refuels your aircraft. A ground power unit provides you with electrical power and cones are placed around your aircraft to ensure the safety of workers and passengers. All these vehicles are set up individually according to your aircraft type - even the catering truck changes its height! \n\n\nIncluded is the &amp;#039;Display Tool&amp;#039; utility that enables all users across a wide variety of PC systems and specification to enjoy MegaHubsUSA. This tool allows you to customize each installation to suit your particular set up. If you have the latest all powerful game platform then Display Tool can configure the installation to run the airports at maximum density, with every object and the tiniest detail. If you have a system that&amp;#039;s starting to &amp;#039;feel it&amp;#039;s age&amp;#039;, Display Tool allows you to pick and choose aspects of each airport to help you keep framerate performance up. See page 21 of the MegaHubsUSA manual for further details.","torrent":{"xt":"urn:btih:92110ce9732aaa25ec256f32d8e0a11175797ca9","amp;dn":"FS2004+-+Oceanflight+Simulation+-+MegaHubsUSA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92110ce9732aaa25ec256f32d8e0a11175797ca9","infoHashBuffer":{"type":"Buffer","data":[146,17,12,233,115,42,170,37,236,37,111,50,216,224,161,17,117,121,124,169]},"announce":[],"urlList":[]}}