{"title":"Xandros 4 OCE","uid":3950067,"size":928743447,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:921be40e878fed61e2b1abbcd6259ce0eb605547&amp;dn=Xandros+4+OCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zero_Assassin","files":2,"time":1198782717,"description":"Xandros 4 - Open Circulation Edition DVD\n\nThe Open Circulation Edition is a limited version of Xandros Desktop OS that can be freely distributed. It includes all the easy-to-use features of the Xandros Desktop OS Deluxe and Business editions, including four-click install with automatic disk partitioning, industry-leading hardware detection and configuration, seamless file and print sharing on Windows networks, and drag-and-drop CD burning in Xandros File Manager.\n\nThe principal differences between the Open Circulation Edition Desktop OS and the commercial editions of Xandros are as follows:\n\n   * The Open Circulation Edition may be freely distributed.\n   * CD burning speed in Xandros File Manager is limited to the minimum burning speed.\n   * The Open Circulation Edition installs an ad-sponsored version of the Opera web browser and e-mail client.\n   * You may access the Xandros user forums but you are not entitled to e-mail installation support.\n   * No user guide is included with the Open Circulation Edition.\n   * The Open Circulation Edition does not include CodeWeavers CrossOver Office or Plugins so you are not able to run any Windows compatible applications on Xandros Desktop.\n\nFor more info on Xandros, check out http://en.wikipedia.org/wiki/Xandros\n","torrent":{"xt":"urn:btih:921be40e878fed61e2b1abbcd6259ce0eb605547","amp;dn":"Xandros+4+OCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921be40e878fed61e2b1abbcd6259ce0eb605547","infoHashBuffer":{"type":"Buffer","data":[146,27,228,14,135,143,237,97,226,177,171,188,214,37,156,224,235,96,85,71]},"announce":[],"urlList":[]}}