{"title":"Syndromeda - Resurrection - New Age, 2006","uid":3606412,"size":110947897,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93b6358863dd1506b621b8d2f0dec32299a51a6c&amp;dn=Syndromeda+-+Resurrection+-+New+Age%2C+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tryandthenbuy","files":8,"time":1170129423,"description":"Artist     : Syndromeda\nAlbum      : Resurrection\nSource     : CD\nYear       : 2006\nGenre      : New Age\n\nCodec      : Lame 3.97 \nQuality    : VBR, average 206kbps, joint stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\n\nIncluded   : This Info-File (NFO)\n             Frontcover\n             Backcover\n\nTracklisting\n------------\n01 (12:02) Joy For All\n02 (20:40) The Resurrection\n03 (14:35) I Dreamed I Could Fly\n04 (08:46) Learning From the Past\n05 (14:23) China on the Move\n\nPlaying Time : 70:26\nTotal Size   : 103 MB\n\n\n\n\n?Joy for all? despite its title is initially one of the most melancholy and heartfelt pieces I have ever heard from Syndromeda. String pads and electronics combine together exquisitely but then in the second minute a ballsy bass sequence rumbles forward and the mood changes instantly to one of a tense excitement. Mellotron and twittery effects complete a perfect ?Berlin School New Age? picture. Little melodies start to form as this already awesome track gets better and better. These melodies solidify into wonderful lead lines (no meandering doodles here!). Faint, rather Gothic organ sounds mix with both cosmic and wordless vocal pads to give the title track a rather brooding but also ethereal beginning. A staccato melody intrudes on the peacefulness then a razor sharp lead flashes over the top jolting us into full action ready wakefulness. The tension builds until all descends to silence at the thirteenth minute mark. From here a brace of sequences start to form though the mood is just as uneasy and menacing as before.\n\n?I Dreamed I Could Fly? continues the atmos created in the previous track. A slow sequence lopes into being like a camel making its sedate pace across a shimmering desert. The most impressive feature of this track is the subtle lead line which nestles in the middle of the mix creating a feeling of mystery. In the fifth minute we shift up a gear, bubbling along moodily until the end. ?Learning from the Past? returns us to the melancholy as wordless vocal pads mix with tron, tinkling sequence and exquisite flutey synth. The pace gradually increases, my feet moving pleasurably to the beats. This really is stunning. ?China on the Move? features a wonderful mournful cello. The sequences emerge in classic Syndromeda style creating quite a trance like state, wordless female wailing giving things quite a psychedelic feel. In the ninth minute things fade to silence and many will assume that this is the end and take the CD out, but no, Syndromeda is playing a trick on us as an additional four minute track ?The Circle is Round? fizzes and shimmers into being gaining excitement and menace as the sequence arrives then fades away again to bring us to the real conclusion of the album- honest. (DL) \n\nThis is a DOWNLOAD album. For information on how to purchase please refer to the DOWNLOAD SHOP section. &lt;a href=&quot;\nhttp://www.synthmusicdirect.com/download.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.synthmusicdirect.com/download.htm&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:93b6358863dd1506b621b8d2f0dec32299a51a6c","amp;dn":"Syndromeda+-+Resurrection+-+New+Age%2C+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93b6358863dd1506b621b8d2f0dec32299a51a6c","infoHashBuffer":{"type":"Buffer","data":[147,182,53,136,99,221,21,6,182,33,184,210,240,222,195,34,153,165,26,108]},"announce":[],"urlList":[]}}