{"title":"Michelle Shocked-Don't Ask Don't Tell (FLAC+EAC)","uid":3606420,"size":320088777,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:942b4bf15bd65bb3b09ce6446ace112e3535eb5d&amp;dn=Michelle+Shocked-Don%5C%27t+Ask+Don%5C%27t+Tell+%28FLAC%2BEAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"atlasshep","files":13,"time":1170130497,"description":"This is one cd of a trilogy released in 2005. I will be upping other Michelle Shocked in the next few days.\n\nAmazon.com\nOf the three simultaneous releases that Michelle Shocked bills as her latest trilogy, Don&amp;#039;t Ask Don&amp;#039;t Tell is the most seriously ambitious and eclectic, so much so that she might have considered combining the strongest tracks from its companions with the best here to make a single powerhouse release. It&amp;#039;s also the least conceptually focused, though the centerpiece of a kiss-off song, &quot;Hardly Gonna Miss Him,&quot; suggests a theme of love gone bad, reinforced by titles such as &quot;Elaborate Sabotage,&quot; &quot;Fools Like Us,&quot; &quot;Evacuation Route,&quot; and &quot;Goodbye.&quot; Whatever Shocked has lost with the end of a relationship, the song cycle benefits from a creative emancipation. Like a musical chameleon as she adopts various vocal styles, she sounds willing to try anything--from the jazzy sophistication of &quot;Early Morning Saturday&quot; to the hipster spoken-word wisdom of &quot;How You Play the Game&quot; to the rollicking New Orleans spirit of &quot;Don&amp;#039;t Tell.&quot; Most atmospherically audacious is &quot;Don&amp;#039;t Ask,&quot; which sounds like a cross between Dr. John in his Night Tripper days and Uncle Remus. Don&amp;#039;t miss the unlisted bonus track, which ends Shocked&amp;#039;s most diverse collection to date in an explosion of punk-rock fury. --Don McLeese \n\n\nThis is my second attempt at FLAC and multi-track seeding. If you have any problems please let me know ASAP.\n\nPlease do a search to find my other Michelle Shocked torrents","torrent":{"xt":"urn:btih:942b4bf15bd65bb3b09ce6446ace112e3535eb5d","amp;dn":"Michelle+Shocked-Don%5C%27t+Ask+Don%5C%27t+Tell+%28FLAC%2BEAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"942b4bf15bd65bb3b09ce6446ace112e3535eb5d","infoHashBuffer":{"type":"Buffer","data":[148,43,75,241,91,214,91,179,176,156,230,68,106,206,17,46,53,53,235,93]},"announce":[],"urlList":[]}}