{"title":"Kamikaza.in.color.pal","uid":3794024,"size":4159971697,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:95cb4c38564db6f9d0082d324a1af9ba19fe3452&amp;dn=Kamikaza.in.color.pal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"=michael=","files":33,"time":1188781083,"description":"Kamikaza in color\n\nAudio: English\nSubtitles: Dutch / Nederlands\nMenu: YES\nExtras: YES\n\nPlot:\nIn WOII krijgen de Amerikanen voor het eerst te maken met een moeilijk te bestrijden vijand; de Kamikaze (goddelijke wind)! Jonge Japanse soldaten, gedreven door geloof en nationalisme, offeren zichzelf op voor de keizer in ruil voor de hoogst haalbare eer en een prachtig leven in het hiernamaals. \n\nDeze documentaire toont u de vele aanvalsgolven van de Kamikazes op de Amerikaanse vloot. Boordevol spectaculaire en indrukwekkende beelden, allemaal in kleur! \n\nKamikaze. Als je strijd tegen een vijand die geen angsten meer kent.\n\nPlot:\nWWII... a desperate time when humans found new and more terrible ways of killing each other. Out of this desperation came the Japanese suicide bomber known as the Kamikaze. To the Kamikaze, bomb and bomber were one and the same. Called into power by Emperor Hirohito and creatively offered the new rank of &quot;god&quot;, 2,500 men were to spend their last terrifying moments as human artillery streaking towards their targets encased in airplanes, mini subs and small boats. These &quot;Knights of the Divine Wind&quot;, so horrifyingly accurate in their attack, took the lives of over 7,000 allied servicemen and women during the reign of those first initiated... and there were still another 4,500 Japanese men being prepared for knighthood. The fear of these human weapons became a critical factor in the United States&amp;#039; decision to avoid an invasion of the Japanese mainland and, instead, drop the atomic bomb. This extraordinary production takes you close to ground zero of these devastating attacks. Featuring astounding, never before seen footage from U.S. and Japanese archives, this incredible film footage from cameramen who narrowly escaped with their lives as well as the words of the men who were actually there. You will experience the Kamikaze more vividly than you ever thought possible. This film stands as an important and provocative look at some of the most horrible wartime tactics ever imagined...tactics that continue to haunt the world to this day. \n\nDont forget to seed!!!","torrent":{"xt":"urn:btih:95cb4c38564db6f9d0082d324a1af9ba19fe3452","amp;dn":"Kamikaza.in.color.pal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95cb4c38564db6f9d0082d324a1af9ba19fe3452","infoHashBuffer":{"type":"Buffer","data":[149,203,76,56,86,77,182,249,208,8,45,50,74,26,249,186,25,254,52,82]},"announce":[],"urlList":[]}}