{"title":"FS2004 FDC Live Cockpit With Working Serial","uid":3548214,"size":268035719,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9658f7452c37e5837d6cb1c8cba2203851a78e84&amp;dn=FS2004+FDC+Live+Cockpit+With+Working+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"raf-aldergrove","files":1,"time":1162185015,"description":"FDC Live Cockpit By RAF-ALDERGROVE\n\nThis exciting, feature packed Add-on enhances the virtual world for every aircraft in Microsoft Flight Simulator.\n\nFDC Live Cockpit! brings the PC Pilots flight deck to life with full crew audio enhancements and a complete airport ambience including boarding sounds etc. He can choose from 15 different flight deck voice sets and can even add his own voice variations. In addition he can choose cabin crew announcements in many different languages and dialects. \n\nA virtual co-pilot catapults the reality feeling to new heights in flight simulation. Audio checklists with many interactive items underline the professional approach in flying an aircraft. Numerous flight deck calls are based on the aircraft type, weight and speed. The user can hear the captain making flap and gear calls at the correct time to which the virtual co-pilot will respond to and will operate gear and flaps.\n\nCustom aircraft files for all Microsoft default and numerous add-on aircraft are included and a checklist and performance editor will let the user add any aircraft he likes.\n\nNumerous presets are ready for a quick and professional flight. Still the program is fully configurable to fit the needs of each and every aircraft and pilot.\n\nAlso included: a Flight Log, Blackbox Log and many, many more items, which will make the Flightsimmer a happy pilot.\n\n\n \nENJOY PEOPLE ALSO PLEASE SEED AS MUCH AS POSSIBLE THANKS\n","torrent":{"xt":"urn:btih:9658f7452c37e5837d6cb1c8cba2203851a78e84","amp;dn":"FS2004+FDC+Live+Cockpit+With+Working+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9658f7452c37e5837d6cb1c8cba2203851a78e84","infoHashBuffer":{"type":"Buffer","data":[150,88,247,69,44,55,229,131,125,108,177,200,203,162,32,56,81,167,142,132]},"announce":[],"urlList":[]}}