{"title":"[Kung Fu] Crouching Tiger, Hidden Dragon (2000) - DVD/Rmvb","uid":3822657,"size":351065965,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:965831a09a407f9951357d6419ae24d4affabf6d&amp;dn=%5BKung+Fu%5D+Crouching+Tiger%2C+Hidden+Dragon+%282000%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JamesKees","files":8,"time":1191002573,"description":"Crouching Tiger, Hidden Dragon (2000)\n\nAvg. Rating:  \n \n  4.4 / 5 (based on 9 ratings).\n\nPlot: During the China Dynasty, the daughter of a Chinese aristocrat has a secret identity as a subversive outlaw who strikes at night with an array of martial arts skills. She is tracked by China&amp;#039;s greatest female warrior but ends up befriending her. \n \nOverview: For his first Chinese-language assignment since 1994&amp;#039;s &quot;Eat Drink Man Woman,&quot; Ang Lee tries a little martial arts on for size with jaw-droppingly exhilarating results. \nA sweeping romantic epic with a strong feminist backbone, the thoroughly entertaining &quot;Crouching Tiger, Hidden Dragon&quot; also happens to boast a generous offering of seriously kick-ass action sequences that make &quot;The Matrix&quot; seem downright quaint by comparison. \n\nWith a cast headed by genre superstars Chow Yun Fat and Michelle Yeoh, the film is poised to conquer virtually every territory it plays in, although it could probably stand a slight trimming for North American consumption. \n\nScreened out of competition (luckily for the others), this impressive effort from Sony Pictures Entertainment&amp;#039;s fledgling Asian production division is set in the early 19th century, during the last great years of the mighty Qing dynasty. \n\nDeciding to hang up his trusty sword - the mythical Green Destiny - legendary warrior Li Mu Bai (Chow) entrusts the ancient weapon to Yu Shu Lien (Yeoh), his equally skilled female partner in crime-fighting. They also share a undeclared love for each other. \n\nIt is agreed that she&amp;#039;ll deliver the sword as a gift to Sir Te, a revered Beijing elder, and it is there she encounters the strong willed En (Gang Zip Ii), a young woman who is about to be married off, but who envies Yu&amp;#039;s independence. \n\nWhen the Green Destiny is stolen, Yu&amp;#039;s detective work leads her to none other than the young girl, who proves to be an enormously skilled fighter trained in the ways of combat by the notorious but evasive Jade Fox. \n\nThe scenario allows for some astoundingly choreographed (courtesy of &quot;Matrix&quot; man Yuen Wo Ping) face-offs between the two women that simply have to be seen to be believed. \n\nIncorporating some digital know-how from Cine Asia and Manex Visual Effects, Lee has his warriors taking their gravity-defying battles along walls, across rooftops or from treetop to treetop, making like Ninja Peter Pans. \n\nAnd in between the well-placed action, there&amp;#039;s a simple, moving poetry both in cinematographer Peter Pau&amp;#039;s lush visuals and in the words, with writers James Schamus, Wang Hui Ling and Tsai Kuo Jung working from Wang Du Lu&amp;#039;s novel of the same name. \n\nLee&amp;#039;s cast is nimbly up to both the action and the acting, with Yeoh and Yun Fat given the kind of opportunity to emote that hasn&amp;#039;t to date been afforded them in their American films. \n\nAs the highly defiant En, college student Gang Zip Ii (&quot;The Road Home&quot;) is assured a rewarding future in front of the cameras. Her potent combination of impassioned defiance and youthful innocence help give &quot;Crouching Tiger, Hidden Dragon&quot; both its quiet beauty and its considerable firepower. \n \nCast: Chow Yun Fat  ||  Michelle Yeoh  ||  Zhang Ziyi  ||  Chang Chen  ||  Lung Sihung  ||  Cheng Pei Pei  \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.534814/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.534814/qx/details.htm&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:965831a09a407f9951357d6419ae24d4affabf6d","amp;dn":"%5BKung+Fu%5D+Crouching+Tiger%2C+Hidden+Dragon+%282000%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"965831a09a407f9951357d6419ae24d4affabf6d","infoHashBuffer":{"type":"Buffer","data":[150,88,49,160,154,64,127,153,81,53,125,100,25,174,36,212,175,250,191,109]},"announce":[],"urlList":[]}}