{"title":"(digimob) Psi Literature Update #1","uid":3816866,"size":1507221815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96ae0abca967818dc75a884c4be487fdf64d6765&amp;dn=%28digimob%29+Psi+Literature+Update+%231&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"occultmobilization","files":44,"time":1190583423,"description":"This torrent represents a work of LOVE. All texts so far gathered, as well as all future gatherings aim at exposing interested students to occult information.\n\nFuture releases will include submissions from users like YOU.\n\nFor some of us, the time has come to mobilize. If you have an interest in assisting in this process - we all have strengths to bring to the table - please email occult.digital.mobilization AT gmail.com\n\nComplacency serves the old gods.\n\nTorrent contains:\n\nBennet, Ernest - Appolonius; or, The Present and Future of Psychical Research\nBuchanan, Joseph - Manual of Psychometry - The Dawn of a New Civilization (1893)\nCarrington, Whatley - A Theory of the Mechanism of Survival: The Fourth Dimension and its Applications (1920)\nCarrington, Hereward - Psychical Phenomena and the War (1920)\nChevreuil, L?on - Proofs of the Spirit World (1920)\nCoville, William Wilberforce Juvenal - Ancient Mysteries and Modern Revelations (1916)\nCrowe, Catherine - The Night Side of Nature, or, Ghosts and Ghost Seers vols. 1 &amp; 2 (1848)\nDendy, Walter Cooper - The Philosophy of Mystery\nFunk, Isaac K. - The Widow&amp;#039;s Mite and Other Psychic Phenomena (1904)\nGurney, Edmund - Phantasms of the Living vols. 1 &amp; 2 (1886, 1918)\nHolt, Henry - The Cosmic Relations and Immortality vols. 1 &amp; 2 (1919)\nHudson, Thomas Jay - A Scientific Demonstration of the Future Life (1895)\nHudson, Thomas Jay - The Law of Psychic Phenomena, Spiritism, Mental Therapeutics, etc (1904)\nHyslop, James - Psychical Research and Survival (1913)\nRhine, J.B. - Parapsychology: Frontier Science of the Mind (1957)\nJournal of the Society for Psychical Research vols. 2 - 20\nLodge, Oliver Sir. - The Survival of Man: A Study in Unrecognized Human Faculty vols. 1 &amp; 2 (1909, 1920)\nMason, R. Osgood - Telepathy and the Subliminal Self: An Account of Recent Investigations (1897)\nMcComb, Samuel - The Future Light in the Light of Modern Inquiry (1919)\nTucket, Ivor Lloyd - The Evidence for the Supernatural: A Study Made with &quot;Uncommon Sense&quot; (1911)\n","torrent":{"xt":"urn:btih:96ae0abca967818dc75a884c4be487fdf64d6765","amp;dn":"%28digimob%29+Psi+Literature+Update+%231","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96ae0abca967818dc75a884c4be487fdf64d6765","infoHashBuffer":{"type":"Buffer","data":[150,174,10,188,169,103,129,141,199,90,136,76,75,228,135,253,246,77,103,101]},"announce":[],"urlList":[]}}