{"title":"[Kung Fu] The Super Inframan (Bruce Li, 1975) - DVD/Rmvb","uid":3806835,"size":431184146,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:98318d6b78ad7ff50fecd9deb81cb0d7e2d10022&amp;dn=%5BKung+Fu%5D+The+Super+Inframan+%28Bruce+Li%2C+1975%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":7,"time":1189809061,"description":"The Super Inframan (Bruce Li, 1975) - DVD/Rmvb\n\n\nAvg. Rating:  \t\n  4.1 / 5 (based on 10 ratings).\n\nPlot:\tA dormant volcano suddenly erupts with the most horrific monsters, threatening the existence of mankind. To stand against these creatures, Professor Liu Ying-Te transforms the brave scientific researcher Ray into The Super Inframan.\n\nOverview:\tIn the future, the world is coming to an end.\n\nAt the corner of the Earth, a dormant volcano suddenly erupts with the most horrific monsters. Scientists believe they might be creatures from the Ice Age...\n\nThese ferocious and damaging monsters seriously threaten the existence of men, and they are under the command of the Demon Princess to take over the world.\n\nTo stand against these creatures, Professor Liu Ying-te, the director of a satellite research station, transforms the brave scientific researcher Ray into the most powerful and indestructible The Super Inframan. This superhero possesses the ultra power to strike and defend, together with X-ray vision, solar armor, laser blades, flaming bombs and soul-splitting kicks. The Super Inframan is meant to be invincible, but the Demon Princess mesmerizes a station researcher Chu Ming to steal the Inframan blueprint for her.\n\nDemon Princess sends Chu Ming and Armadillo to blow up the research station. As Armadillo is setting up in a cave, curiosity has driven Mei-mei, the Professor&amp;#039;s daughter, and Ray&amp;#039;s young brother Tiger to walk in and discovers the monster. Armadillo captures and leaves the children inside the station. At the last second, Ray rushes in and saves the day.\n\nThe same night, the Professor has successfully invented the most powerful &quot;Lightning Fists&quot;. But Chu Ming and Armadillo are back and kidnaps Mei-mei again, threatening the Professor to come to them...\n\nThe ultimate battle between men and beasts is about to begin...\n\nCast: \tDanny Lee Sau-Yin  ||  Yuen Man Tzu (Yuan Man-Tzu)  ||  Wong Hap  ||  Lau Wai Yue  ||  Lam Man Wai  ||  Bruce Le  ||  Lo Wai  ||  Leung Maan Yee  ||  Kong Yeung \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.529399/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.529399/qx/details.htm&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:98318d6b78ad7ff50fecd9deb81cb0d7e2d10022","amp;dn":"%5BKung+Fu%5D+The+Super+Inframan+%28Bruce+Li%2C+1975%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98318d6b78ad7ff50fecd9deb81cb0d7e2d10022","infoHashBuffer":{"type":"Buffer","data":[152,49,141,107,120,173,127,245,15,236,217,222,184,28,176,215,226,209,0,34]},"announce":[],"urlList":[]}}