{"title":"BackTrack 2","uid":3849465,"size":723281920,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:989513a0b8e00469ecb7c71f62f850aca15ddf32&amp;dn=BackTrack+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Amunz","files":1,"time":1192863826,"description":"BackTrack is a Linux distribution distributed as a LiveDistro which resulted from the merger of WHAX and the Auditor Security Collection.[1] It takes advantage of SLAX&amp;#039;s modular design and structure to enable the user to include customizable scripts, additional tools and configurable kernels in personalized distributions. The BackTrack project was created by Mati Aharoni and Max Moser and is a collaborative effort involving the community.\n\nBackTrack focuses its central idea on the needs of computer penetration testers. The inclusion of LiveCD and LiveUSB functionality enables any user to just insert their respective data medium and boot up BackTrack. Direct hard disk installations (2.7 GB uncompressed) can also be completed within the LiveCD (700 MB compressed) environment through the basic graphical installation wizard with no restart subsequent to installation. BackTrack further continues its compatibility with the computer forensics demographic with accessibility and internationalization by including support for Japanese input in reading and writing in Hiragana, Katakana and Kanji.","torrent":{"xt":"urn:btih:989513a0b8e00469ecb7c71f62f850aca15ddf32","amp;dn":"BackTrack+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989513a0b8e00469ecb7c71f62f850aca15ddf32","infoHashBuffer":{"type":"Buffer","data":[152,149,19,160,184,224,4,105,236,183,199,31,98,248,80,172,161,93,223,50]},"announce":[],"urlList":[]}}