{"title":"Inhabitants [NTSC-U] (Dreamcast)","uid":3846259,"size":297090539,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:989a55a4415dec72082facc0921457a67fa05c54&amp;dn=Inhabitants+%5BNTSC-U%5D+%28Dreamcast%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pornek","files":5,"time":1192657781,"description":"Officially named Inhabitants Dreamcast, this is an advanced port of the freeware game by S+F Software, which was released in 2004 for the PC. While the original game was mainly programmed by Steve Thompson, the Dreamcast port was done by Brandon Parker. Other credits include Andrew Bado on graphics, music by Josh Deeb, and comprehensive software testing conducted by Austin Vashaw.\n\nThe goal of this puzzler is to clear up as many tiles as possible at once, never less than two at a time but also never more than five. Five tiles can only be cleared if they have the shape of a plus, meaning one in the center, two at the sides and two above and below. If you can clear a whole five-tile you get a bonus. This type of gameplay also requires you to use new kinds of strategies.\n\nThere is an easy mode and a normal mode with fifteen levels each. By finishing those levels without running out of tiles with at least two tiles of the same shape, you can unlock new tilesets and advanced extras like a challenge mode.\n\nAlso a multiplayer mode is included where you can play with up to three friends.\n","torrent":{"xt":"urn:btih:989a55a4415dec72082facc0921457a67fa05c54","amp;dn":"Inhabitants+%5BNTSC-U%5D+%28Dreamcast%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989a55a4415dec72082facc0921457a67fa05c54","infoHashBuffer":{"type":"Buffer","data":[152,154,85,164,65,93,236,114,8,47,172,192,146,20,87,166,127,160,92,84]},"announce":[],"urlList":[]}}