{"title":"The Gore Gore Girls.......FFF","uid":3800669,"size":688883200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99334088699972a6e45b3eba794801d64299531c&amp;dn=The+Gore+Gore+Girls.......FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFuckFrank","files":1,"time":1189311709,"description":"If there was ever a film that went out of its way to be even sicker, gorier, and more offensive that Blood Feast, it&amp;#039;s this twisted puppy, the last film to date from HERSCHELL GORDON LEWIS, and easily one of the most appalling, ultra-violent horror movie gross-outs of all time. \n\nA lunatic with a grudge against g-strings, pasties, and pretty women is slaughtering the sexy strippers who work for strip club impresario Marzdone Mobilie (HENNY YOUNGMAN -- yes, the Henny Youngman). Not content with mere murder, the psycho enthusiastically mangles and mutilates the women, thus turning Marzdone&amp;#039;s go go girls into The Gore Gore Girls. \n\nTrying to solve the gruesome goings-on are obnoxious private eye Abraham Gentry (rank Kress) and a ditzy reporter Nancy Weston (Amy Farrell). Burrowing through the underbelly of the sleaze-and-tease business, Abraham eventually offers the killer the perfect bait by coercing a drunken Nancy to perform in an amateur strip contest... \n\nOf course, the threadbare plot is just an excuse for a parade of extremely over the top gore scenes which, despite the obviously sloppy special effects, are still dazzling in their creative savagery. The carnage include a face being steam ironed; a bare buttock bashed bloody with a meat tenderizer ( to which salt is then literally added to the wound); a pair of eyeballs squeezed and popped; scissors snipping off a woman&amp;#039;s nipples which squirt white milk and chocolate milk into champagne glasses; and even a head being boiled to death in a bowl of french fries! \n\nYes, It&amp;#039;s a comedy. \n\nAlso known as Blood Orgy (for those audiences who found the original title too, uh ... sophisticated), The Gore Gore Girls (like I Drink Your Blood) was among the first films ever rated X for Violence by the indi-hating MPAA at a time when the ratings board was actually far more liberal than it is today). Lewis appealed the ruling, lost, but nevertheless released the film uncut. ","torrent":{"xt":"urn:btih:99334088699972a6e45b3eba794801d64299531c","amp;dn":"The+Gore+Gore+Girls.......FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99334088699972a6e45b3eba794801d64299531c","infoHashBuffer":{"type":"Buffer","data":[153,51,64,136,105,153,114,166,228,91,62,186,121,72,1,214,66,153,83,28]},"announce":[],"urlList":[]}}