{"title":"aclu_foreign_claims_act","uid":3699148,"size":82612730,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9a4ceaeb34ba635c4ee46322e85edb898f987f66&amp;dn=aclu_foreign_claims_act&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"recordsquest","files":506,"time":1180338377,"description":"This is the full volume of public records relating to the following project:\n\nCivilian Deaths -\nThe Human Cost of War\n\nSince U.S. troops first set foot in Afghanistan in 2001, the Defense Department has gone to significant lengths to control and suppress information about the human cost of war. It banned photographers on U.S. military bases from covering the arrival of caskets containing the remains of soldiers killed overseas. It paid Iraqi journalists to write positive accounts of the U.S. war effort. It invited U.S. journalists to \\\\\\&quot;embed\\\\\\&quot; with military units but required them to submit their stories to the military for pre-publication review; according to some reports, the policy was meant to co-opt the embedded journalists and make independent and objective reporting more difficult. It has erased journalists\\\\\\&amp;#039; footage of civilian deaths in Afghanistan . And it has refused to disclose statistics on civilian casualties. \\\\\\&quot;We don\\\\\\&amp;#039;t do body counts,\\\\\\&quot; General Tommy Franks has said.\n\nBut it is critical that the public have full and accurate information about the human cost of war. As Justice Stewart wrote in 1971, \\\\\\&quot;the only effective restraint upon executive policy and power in the areas of national defense and international affairs may lie in an enlightened citizenry - in an informed and critical public opinion which alone can here protect the values of democratic government.\\\\\\&quot;\n\nIn an effort to obtain more information about the human costs of war, the ACLU filed Freedom of Information Act requests with various components of the Defense Department. The documents searchable on this page were provided to the ACLU in response to those requests.","torrent":{"xt":"urn:btih:9a4ceaeb34ba635c4ee46322e85edb898f987f66","amp;dn":"aclu_foreign_claims_act","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a4ceaeb34ba635c4ee46322e85edb898f987f66","infoHashBuffer":{"type":"Buffer","data":[154,76,234,235,52,186,99,92,78,228,99,34,232,94,219,137,143,152,127,102]},"announce":[],"urlList":[]}}