{"title":"Jeremy Clarkson - Hot Metal","uid":3558315,"size":3324248064,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9d089e093e6644b407d4431f0098f4452dc2caf5&amp;dn=Jeremy+Clarkson+-+Hot+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thesaint76","files":1,"time":1163627999,"description":"\nJeremy Clarkson poses the question: where is modern motoring now on ultimate speed, grip, handling, reliability, styling and noise output?\n\nClarkson sets the scene by taking you on a brief history on the advances of automotive travel during the last century. In the past we have achieved superior speed, power and height in outer space, the air, on rails and over water. \\&quot;Everywhere you look machines are slowing down. But what about cars?\\&quot;\n\nHe begins to demonstrate his answer with a drag race between a Brabus Mercedes and a PTC by Austin 1100 and on to other amazing cars at speed, such as the Italian supercar Pagani Zonda and the expensive but commercially unsuccessful Jaguar XJ220. There is the thrill of comparing the performances of the McClaren Mercedes SLR, Porsche Carrera GT, Lotus Exige and its sister the Elise, the BMW CSL and the Alfa Romeo GTV6 of yester year with the Mercedes SL55 very much of today.\n\nAfter delivering us the cars from the past, present and future and putting them through their paces only one question remains: is motoring as much fun as it used to be? Why? Why not?!\n\nAnd, of course, Jeremy just had to riddle a Nissan with machine gun fire as he takes up the new and dangerous sprot of \\&amp;#039;Clay Car Shooting\\&amp;#039;!\n","torrent":{"xt":"urn:btih:9d089e093e6644b407d4431f0098f4452dc2caf5","amp;dn":"Jeremy+Clarkson+-+Hot+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d089e093e6644b407d4431f0098f4452dc2caf5","infoHashBuffer":{"type":"Buffer","data":[157,8,158,9,62,102,68,180,7,212,67,31,0,152,244,69,45,194,202,245]},"announce":[],"urlList":[]}}