{"title":"The Dead Texan - The Dead Texan","uid":3959739,"size":2662586368,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9e059e34e44509b7d8bb333395ce7b1889c56ee3&amp;dn=The+Dead+Texan+-+The+Dead+Texan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"plastic25","files":36,"time":1199379371,"description":"The Dead Texan is a collaborative audio-visual release that contains a compact disc paired with a DVD containing seven video pieces designed to accompany the music on the album.  Adam Wiltzie is a sound engineer and musician who has done live sound and recording work for numerous bands. He is best known as one half of the noctambulant drone duo Stars of the Lid.  That  group that has already collaborated with painter Jon McCafferty on one album, Per Aspera ad Astra, and plays with the stunning film accompaniment of Luke Savisky.  This experience makes Wiltzie uniquely qualified to create videos for the music he makes under the name The Dead Texan.\n\nChristina Vantzos has a bachelor&amp;#039;s degree from the Maryland College of Art and has made video art to accompany live musical performances (most recently at the Cimatics International VJ&amp;#039;ing Festival in Brussels, Belgium) as well as short films.  Her work has been shown in art, music and film festivals such as  LadyFest East, Transmissions 004 in Chicago in 2001, the 2001 Still Not Art Festival in Boston,  the 2002 Microcine Festival in Baltimore, the 2002 Kansas City Filmakers Jubilee, and the 2003 Once. Twice Sound Festival in Baltimore.  Christina Vantzos is the recipient of a 2002 Baltimore City Community Arts Project Grant for her Wide Angle Community Media project.  She is currently working on a video documentary on teenage life in Scotland.\n\nThe DVD combines animation with video footage of people, places and things (like Brussels&amp;#039; singular Atomium or the city&amp;#039;s baroque center) in ways that are both playful and profound.   Accompanying is the music, which resemble Wiltzie&amp;#039;s work with Stars of the Lid and is reminiscent of the film music of Zbigniew Preisner and George Delerue.  The videos unfold at a deliberate and engrossing pace.  By the end of work on the project, the creation of music and of videos became so intertwined that The Dead Texan DVD is a work unto itself and not merely a collection of promotional videos for a group of songs.\n\n\nTracklisting:\n\nDVD-1  \t   \tAegina Airlines (2:56)\nDVD-2 \t  \tGlen&amp;#039;s Goo (Instrumental) (4:23)\nDVD-3 \t  \tThe 6 Million Dollar Sandwhich (3:11)\nDVD-4 \t  \tTace Me Manque (2:45)\nDVD-5 \t  \tWhen I See Scissors, I Can&amp;#039;t Help But Think Of You (4:03)\nDVD-6 \t  \tBeatrice Pt. 2 (2:08)\nDVD-7 \t  \tThe Struggle (5:29)","torrent":{"xt":"urn:btih:9e059e34e44509b7d8bb333395ce7b1889c56ee3","amp;dn":"The+Dead+Texan+-+The+Dead+Texan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e059e34e44509b7d8bb333395ce7b1889c56ee3","infoHashBuffer":{"type":"Buffer","data":[158,5,158,52,228,69,9,183,216,187,51,51,149,206,123,24,137,197,110,227]},"announce":[],"urlList":[]}}