{"title":"Martin Lawrence Black Night 2001 DVDRip. By( Hariwan)","uid":3601477,"size":733028352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f1e6baf716cac4ae9a2419821bbdf6c5ef01c29&amp;dn=Martin+Lawrence+Black+Night+2001+DVDRip.+By%28+Hariwan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hariwan","files":1,"time":1169485895,"description":"Black Knight (2001) * 1/2 \n\n\n--------------------------------------------------------------------------------\n\nDirected by Gil Junger. Written by Darryl J.Quarles, Peter Gaulke, Gerry Swallow. Photography, Ueli Steiger. Editing, Michael R. Miller. Production design, Leslie Dilley. Costumes, Marie France. Music, Randy Edelman. Producers, Arnon Milchan plus 7. Cast: Martin Lawrence, Marsha Thomason, Tom Wilkinson, Vincent Regan, et al. A 20th Century Fox release. 95 minutes. PG-13. \n\n--------------------------------------------------------------------------------\n\nThis umpteenth movie version of Marx Twain&amp;#039;s &quot;A Connecticut Yankee in King Arthur&amp;#039;s Court&quot; will not become a footnote in film history. Not even as what it is, a vehicle for the exuberant Martin Lawrence. \nHe plays Jamal Walker, a streetwise employee at Medieval World, a Los Angeles theme park. The personnel seem to be almost all black. The enterprise is certainly in the red and on the brink of folding. \n\nThe fake castle&amp;#039;s moat is a sewage-like affair in whose liquid debris Jamal plunges (don&amp;#039;t ask) and out of which he emerges in 1328 A.D. England. \n\nJamal becomes rapidly involved in the affairs of an usurper king (who does not look a bit like a villain); his main henchman (ditto); his nympho daughter; and others. He falls for the princess&amp;#039;s housemaid Number 7 -- the pretty, Moorish (sic) Victoria (Marsha Thomason) who is also an undefined, high-ranking member of the Resistance against the king. A few assorted types in small parts pad the cast without fleshing it out. \n\nAll this happens because willing Jamal somehow gets mistaken for the envoy of the Duke (pronounced &quot;Dook&quot;) of Normandy. He also (don&amp;#039;t ask) is taken for a court jester. As such he multiplies his activities, all of them mugging, clowning and Lawrence-centered. Jamal brings his big city savvy to bear on everything, easily wins Victoria, teaches hip-hop music and dancing to the court, re-mugs endlessly, becomes a major factor in the inevitable, successful revolt against the king and his bad guys. \n\nThe last movie I saw Lawrence in was the unambitious, unexciting, cobbled together yet somehow watchable &quot;Blue Streak&quot; (1999). It was very mildly redeemed by that special, inimitable, jiving, wild-acting-and-talking energy and effervescence of many African-American comedians. Those traits re-emerge in &quot;Black Knight&quot; but are mostly defeated by a terrible script patched together by three &quot;writers&quot; plus, I suspect, the irrelevant input of additional contributors. \n\nThere is a small paradox here. The film is bad but no necessarily dull or boring. Your brain will go on hold so that you probably will not resent the movie for having wasted 90-plus minutes of your time. All this in spite of the absence of real humor, inventions or imagination.There are hardly any solid gags. It looks as though whenever some scribbler came up with a passable idea it was never worked on, polished or refined. \n\nI am not talking about vulgarity which is something that can work in advanced slapstick, but of an indigence of jokes, attitudes, and ideas in general. Martin Lawrence (who reportedly got 7 million dollars for this thing) may or may not have his own brand of abilities, but here he is a sub-sub-Eddie Murphy --and who wants a bad copy of good originals? And his hyperthyroid brio reminds one more of bad Jerry Lewis acting than of good Danny Kaye or Eddie Murphy craziness. \n\nThe combination of disorganized, incoherent script plus overdoses of deja vu gimmickry does not result in anything clever or really funny, except perhaps for very young audiences. (The PG-13 rating probably comes from one scene of sexual noises and another when the king&amp;#039;s daughter sneaks into Jamal&amp;#039;s bed, and he thinks, all night long, that he is having sex with Victoria). \n\nI must repeat, however, that this mess of a movie is, oddly, not sleep-inducing. And there are two positive things about it. One is the pretty, bucolic landscape around the palace. The other, much more important, is the tiny scene of Jamal, back in 2001, re-plunging into the moat. That most (only?) inventive bit of the film comes at the very last moment, just before the end-credits. \n","torrent":{"xt":"urn:btih:9f1e6baf716cac4ae9a2419821bbdf6c5ef01c29","amp;dn":"Martin+Lawrence+Black+Night+2001+DVDRip.+By%28+Hariwan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f1e6baf716cac4ae9a2419821bbdf6c5ef01c29","infoHashBuffer":{"type":"Buffer","data":[159,30,107,175,113,108,172,74,233,162,65,152,33,187,223,108,94,240,28,41]},"announce":[],"urlList":[]}}