{"title":"Meridian 59 Resurrection Server and Client.rar","uid":3821857,"size":93459539,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f247ccc705d584aa1b25f2056d73162a43750c6&amp;dn=Meridian+59+Resurrection+Server+and+Client.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Daenks","files":1,"time":1190941420,"description":"We finally got the server software for resurrection and it is working!\nThere are two versions of it, one german and one english. The english one is a early version of resurrection so it does not have all new things, but the german one is updated, and it got like all new things that was made before the new client Evolution with the new graphic was created. \n\nIMPORTANT!! you need to set the year to 2002 to be able to cast spells and attack OR you download this apihook and place it in the server folder and start it using the runme.bat\n\nThe resurrection client (plain without any updates)\n\nThe meridian.exe which will let you see \\&quot;halos\\&quot; on minimap. You guildmates have a yellow halo, your allies got green halo and your enemies got a red halo:\n\nAll the updates I could find for resurrection. They are *.arq files so you need to open them using arq.exe, then just add them in the client folder. You also need the latest rsc0000.rsb for the german server to make it to english!\n\nTo be able to use admin window when logging on as admin you need to add the admin.dll to the RESOURCE folder in the client:\n\nI have also found a speedhack detector, it does not automaticly ban players but you can see in the log if someone used speedhack and ban them later:\n\nThis is all new I got for now smile if you got any questions just post it. Now we can get a free NDS server smile\n\nGerman version NOT included in this torrent, contact me if you need it.","torrent":{"xt":"urn:btih:9f247ccc705d584aa1b25f2056d73162a43750c6","amp;dn":"Meridian+59+Resurrection+Server+and+Client.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f247ccc705d584aa1b25f2056d73162a43750c6","infoHashBuffer":{"type":"Buffer","data":[159,36,124,204,112,93,88,74,161,178,95,32,86,215,49,98,164,55,80,198]},"announce":[],"urlList":[]}}