{"title":"FS2004 - Zinertek UNE 2007","uid":3796337,"size":67675360,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f52db4ebc789364745e9b7fe69a55e87baff745&amp;dn=FS2004+-+Zinertek+UNE+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"N076AW","files":1,"time":1189009235,"description":"With this new version it will be a breathtaking experience to fly around cities and airports at night. Cities, towns, and airports throughout the world come alive at night with enhanced and detailed night textures.\n\nAll ground textures have been re-done individually from scratch in painstaking detail to bring the best possible detail out of each texture. \n\nEnhanced night textures make buildings, airports, vehicles, bridges, and auto-gen buildings more accurately represented at night.\n\nCities, towns and airports at night have never looked any better!\n\n-Over 1000+ new ground textures done in painstaking detail bring cities and towns throughout the world to life. Even with auto-gen buildings turned off cities look as detailed as ever. In fact, all of the screenshots show cities without auto-gen buildings to show you how much detail these new textures add to cities and towns. \n\n-Lighting for buildings, auto-gen buildings, bridges, vehicles and landmarks has been further enhanced.\n\n-Improved lighting for small, large, and international airports throughout the world.\n\n-Improved lighting for roads and highways. \n\n-Improved lighting for airport terminals, gates, hangars, control towers, VOR stations, radar towers, and more. \n\n-New textures add a nice sunset and sunrise effect. \n\n\n-Frame rate friendly. No impact on framerates whatsoever. \n\n-Blends seamlessly with Ultimate Terrain\\\\\\&amp;#039;s 3D lights to create the most amazing night scenery ever created for Flight Simulator. \n\nhxxp://zinertek.com/flightsimulator/nightenvironment2007.html","torrent":{"xt":"urn:btih:9f52db4ebc789364745e9b7fe69a55e87baff745","amp;dn":"FS2004+-+Zinertek+UNE+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f52db4ebc789364745e9b7fe69a55e87baff745","infoHashBuffer":{"type":"Buffer","data":[159,82,219,78,188,120,147,100,116,94,155,127,230,154,85,232,123,175,247,69]},"announce":[],"urlList":[]}}