{"title":"Worms of the Earth - Promo [2007] (UNRELEASED/RARE) [Industrial,","uid":3707461,"size":113150898,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9ff93e19290ddadaf4c88cd3df5f8f2f2c2cdbd4&amp;dn=Worms+of+the+Earth+-+Promo+%5B2007%5D+%28UNRELEASED%2FRARE%29+%5BIndustrial%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"TCV","files":13,"time":1181226930,"description":"Worms of the Earth - Promo [2007] (UNRELEASED/RARE) [Industrial, Power Noise, Rhythmic Noise, EBM]\n\nThis is an unreleased and rare promo CD from industrial band Worms of the Earth. It was only handed out to a few DJs within the Baltimore area and is not even supposed to be released to the general public. The tracks are exclusive to this promo CD. The best way to sum up Worms of the Earth is by using the quote on their myspace (www.myspace.com/wormsoftheearth):\n=========================\nWorms of the Earth :: Biography\nbegan with the creation of the human race. sometime at the end of the 20th century we infested the host body known as &quot;.d4nb4rr3tt.&quot;. eventually, in the human gregorian calendar year of two thousand and three, the host body was instructed to begin our work. learning the ins and out of the host body was slow and tedious, but slowly our aural work evolved towards the sound of our own consciousness. we released a couple of demo records before we shifted phase and decided to explore the darker more organic side of the human existence. we we lucky enough to release a strange split channel project through dark ambient label advaita audio. we began to construct a massive storyline for our full length album based on our origins and the continuation of &amp;#039;the creators&amp;#039; inside the bowels of this planet. before that work came to fruition, the host body had its own set of traumatic worldly events and we decided to write sounds that would accurate describe the unseen portions of the human world. we entitled this release &amp;#039;tides of dream and madness&amp;#039; in tribute to the mind of the host body. beyond this release, we again dabbled in the dark waters of ambient texture and ritualized deteriorating soundscapes. we performed a split album with the short lived icbm.cluster project. following that, we realized the low quality of the vocal equipment we were utilizing and decided to do away with it, at least temporarily. Currently we are working with new and more devastating sound forms and are trying to return to the origins of industrial music, that is, the focus on industry.\n=========================\n\nIt&amp;#039;s definitely good stuff. If you like the style, Worms of the Earth has more available on their website that you can check out.","torrent":{"xt":"urn:btih:9ff93e19290ddadaf4c88cd3df5f8f2f2c2cdbd4","amp;dn":"Worms+of+the+Earth+-+Promo+%5B2007%5D+%28UNRELEASED%2FRARE%29+%5BIndustrial%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ff93e19290ddadaf4c88cd3df5f8f2f2c2cdbd4","infoHashBuffer":{"type":"Buffer","data":[159,249,62,25,41,13,218,218,244,200,140,211,223,95,143,47,44,44,219,212]},"announce":[],"urlList":[]}}