{"title":"Sybex A+ FastPass (CD-ROM only)","uid":3856016,"size":72720384,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a11334558139f5abe1f56098cadb2b5f4287f7ee&amp;dn=Sybex+A%2B+FastPass+%28CD-ROM+only%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chamelion24","files":1,"time":1193197437,"description":"The A+ certification from CompTIA certifies the competency of service technicians in the computer industry. Revised exams are due out Q4 of this year. A+ candidates must pass two exams?Core Hardware and Operating System Technologies. These two A+ exams cover a lot of ground, and many candidates who have read a Study Guide or taken a course are looking for well-organized review guides to help them brush up on key topics. The A+ Fast Pass is that book!\n\nThe products on this CD have been tested on and are compatible with Windows 98, Windows NT 4.x Workstation, Windows 2000 Professional, Windows XP Home Edition, and Windows Server 2003. To use the included study materials, we recommend a monitor resolution of 1024x768 or higher.\n\nThis CD includes a Director-created interface, which makes it easy for you to install and download the programs you want from the CD. The interface starts automatically and runs completely from the CD.\n\nIf you&amp;#039;d rather install or run the programs without using the CD interface, or if the interface isn&amp;#039;t working for you, please read the installation instructions for each product listed in this Readme, and proceed to install directly from the root of the CD.\n\nNote: Some products on this CD may not be compatible with all user operating systems; please note any system requirements mentioned in this Readme file.\n\n \t? The Glossary of key terms is a handy, digital reference guide you can copy to your desktop and access during your A+ studies. The glossary is reproduced from your companion text and is provided as a PDF file on this CD.\n\nTo access the glossary, open the Glossary directory from the root of this CD and double-click Glossary.pdf.\n\nNote: Before attempting to use the glossary, please make sure you have a current version of Adobe Acrobat Reader running on your computer. As a courtesy to our readers, we&amp;#039;ve included a copy of the software that can be installed from this disk. \n\n  \t? The Sybex Test Engine is a customized exam preparatory program that allows you to deepen your knowledge of the material required for the A+ exams. Gauge your knowledge and refine your studying with the two bonus exams found only on this CD.\n\nNote: Windows 98, Windows 2000 Professional, Windows NT 4.0 Workstation, Windows XP, or Windows Server 2003 is required for this program. We also recommend 1024x768 or greater display resolution and a high color (16-bit or greater) video card.\n\nTo run the Test Engine, click the SYBEX TEST ENGINE button from the interface main menu, then choose from one of the two exams available.\n\n \t? We have included PC Flashcards to jog your memory and assess your level of knowledge for the A+ exams. In response to reader demand, we have included flashcards for the PC, Pocket PC, and the Palm.\n\nTo run the flashcards, go to the Flashcards folder, enter the PC folder, and double-click one of the available flashcard files that relate to the two exams which make up the A+ certification.\n\nNote: Windows 98, Windows 2000 Professional, Windows NT 4.0 Workstation, Windows XP, or Windows Server 2003 is required for this program. We also recommend 1024x768 or greater display and a high color (16-bit or greater) video card.","torrent":{"xt":"urn:btih:a11334558139f5abe1f56098cadb2b5f4287f7ee","amp;dn":"Sybex+A%2B+FastPass+%28CD-ROM+only%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a11334558139f5abe1f56098cadb2b5f4287f7ee","infoHashBuffer":{"type":"Buffer","data":[161,19,52,85,129,57,245,171,225,245,96,152,202,219,43,95,66,135,247,238]},"announce":[],"urlList":[]}}