{"title":"12th Edition PC-SIG Shareware CD - Complete","uid":3785048,"size":560033651,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a2ce9d824616f058ea80b4babb6f4015ff2c2216&amp;dn=12th+Edition+PC-SIG+Shareware+CD+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"griffie","files":2,"time":1188140831,"description":"Here&amp;#039;s a copy of the 12th Edition of the PC-SIG Shareware CD. Before the internet brough massive amounts of programs to your digital door, companies like PC-SIG would send you (for a small fee, of course) copies of popular shareware, freeware, or trialware programs on floppy disk. Or, if you had a few grand to drop on a CD reader, and a few more thousand dollars (yes!) to drop on a CD, you could get the entire library delivered to your doorstep. This is a copy of one of those CDs. \n\nPC-SIG compiled a fairly nice list of games and applications, but was ultimately killed off by the internet and the fact that the founder, Richard Peterson, liked to ignore the wishes of the software owners and include things that he was asked to remove. \n\nThis disc is from 1993, and comprises one of the last (if not the last) edition of PC-SIG&amp;#039;s CD collections. The guide was published as a catalog book (not included) but most of the categories on the disk are easy enough to figure out, and the programs themselves usually have README files embedded somewhere in the list. \n\nTo use this collection, just unzip and dump the files somewhere. The big .zip file is a complete collection of everything on the CD. Don&amp;#039;t pay any attention to the install program in the root directory, I have no idea what it will do with a modern operating system. Other than that, simply navigate to the folder of choice, pick a &quot;disc,&quot; unzip to a directory, (attempt) to run the old DOS (or Win3.1) program contained within, and be amazed* \n\n* Amazement is optional and is void where prohibited by law. May incur charges not covered by your insurance provider. Batteries not included. Be responsible. Don&amp;#039;t unzip and drive.","torrent":{"xt":"urn:btih:a2ce9d824616f058ea80b4babb6f4015ff2c2216","amp;dn":"12th+Edition+PC-SIG+Shareware+CD+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2ce9d824616f058ea80b4babb6f4015ff2c2216","infoHashBuffer":{"type":"Buffer","data":[162,206,157,130,70,22,240,88,234,128,180,186,187,111,64,21,255,44,34,22]},"announce":[],"urlList":[]}}