{"title":"ArmiVaBuuren-10_Years-2CD-320-2006-TRANCEZONE","uid":3554547,"size":384848969,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2d25b2f4b0843af6e756f9630021b6d05e23546&amp;dn=ArmiVaBuuren-10_Years-2CD-320-2006-TRANCEZONE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"misiek2007","files":26,"time":1163117388,"description":"TRANCEZONE PRESENT&amp;#039;S:\n\n\n[Artist]..::Armin Van Buuren\n[Title]..: 10 Years\n[Genre]..: Trance \n[Year]..: 2006\n[Tracks]..: 21\n[Quality]..:320kbps\n\n\n\t\t\t\t\t[Tracklist CD1]\n\n\n1. Hymne\n&quot;Written as an opening track for Armin Only 2005 in Ahoy&amp;#039; Rotterdam with Jan Vayne. Originally released as a hidden track on the Shivers album.&quot;\n\n2. Sail \n&quot;Theme track for Armin Only 2005, based on the historic connection Holland has with water and sailing. This track was used for the campaign to promote a huge Dutch boat event called &amp;#039;Sail&amp;#039;, held in Amsterdam every 5 years.&quot;\n\n3. Love you more (feat. Racoon) \n&quot;New version of this beautiful song and nr. 1 hit by Racoon. Originally made for a one time live performance version during Armin Only 2005.&quot; \n\n4. Communication part 3\n&quot;Original version released as Armin ? Communication. This is an updated version of the track that has meant a lot for my career. Originally this version of the track was meant for my DJ sets only.&quot;\n\n5. Yet another Day (feat. Ray Wilson) \n&quot;I met Ray after a gig I did in Bathgate, Scotland. He&amp;#039;s one of the best live performing artists and a truly gifted musician.&quot;\n\n6. Burned with Desire (feat. Justine Suissa) (Rising Star mix)\n&quot;Originally written as a slow chill out track but I did this remix because people asked me if I could play it in my sets. My first attempt at writing vocals with the help of the lovely Justine.&quot; \n\n7. 4 Elements\nOriginally released as Gaia &amp;#039;4 Elements&amp;#039;.\n&quot;I did this track as the theme song for the &amp;#039;4 Elements&amp;#039; festival in Holland in 2001. The track contains references to all 4 elements.&quot;\n\n8. Sound of Goodbye (Dark Matter remix) \n&quot;Original mix previously released as &amp;#039;Perpetuous Dreamer ? The Sound of Goodbye&amp;#039;. This is a previously unreleased mix of the sound of goodbye. A dancefloor favourite, people have been asking me a lot to release this mix.&quot;\n\n9. Clear Blue Moon \n&quot;Originally released as &amp;#039;Rising Star ? Clear Blue Moon&amp;#039;. I wrote this track in the middle of the winter during my internship at the lawfirm I was working for. One of my personal favorites!&quot;\n\n10. Blue Fear\n&quot;Originally released as &amp;#039;Armin ? Blue Fear&amp;#039;. This is where it all started for me 10 years ago. Made with only one sampler with 2 megabytes of internal memory. This track has meant the most for my career. It&amp;#039;s the oldest track on the album and opened a lot of doors when it entered the UK charts.&quot;\n\n11. Exhale (feat. System F)\n&quot;Written with the talented Ferry Corsten. Check out the video for this, recorded in central London and Coalville where we played a gig in the legendary &amp;#039;Passion nightclub&amp;#039;.&quot;\n\n\n\n\t\t\t\t\t[Tracklist CD2]\n\n\n\n1. Who&amp;#039;s Watching (Tonedepth remix) \n&quot;Vocals written and recorded in New York with the beautiful Nadia. The guitar part was recorded in Sweden and the original mixes were done in Holland.&quot;\n\n2. Saturday Night (vs. Herman Brood) \n&quot;New Version of the classic rock tracks by Herman and his wild romance, one the biggest rock artists in Holland and a big hit in the US in the 70s. I found a bassline while working on another track and the riff just worked perfectly with it. This track is the theme to a movie about his life.&quot;\n\n3. Zocalo (feat. Gabriel &amp; Dresden)\n&quot;Written and recorded with two of the world&amp;#039;s best producers in their studio in San Francisco in March 2005. We named it after the local coffeehouse where we got our coffee&amp;#039;s each morning while working on the track. This track always reminds me of Mexico.&quot;\n\n4. This World is watching me (vs Rank 1 feat. Kush) \n&quot;A brand new track made especially for this album with Rank 1 featuring the vocals of Kush. We always said we were going to do a track together one day.&quot;\n\n5. Sunspot (feat. Airwave) \n&quot;Written and produced with Laurant originally for his album back in 2003. Working with him taught me a lot about producing in general.&quot;\n\n6. Touch Me \n&quot;Originally released as &amp;#039;Dark Star ? Feel me&amp;#039;, later changed to &amp;#039;Rising Star ? Touch Me&amp;#039;. Track I originally made as a B-side to a track called &amp;#039;See me&amp;#039;. I opened with this track when I first played in Norway. It was the first time I ever played in another country.&quot;\n\n7. Simple Things (feat. Justine Suissa) \n&quot;Previously unreleased track with Justine. We wrote it in the same week as &amp;#039;Wall of Sound&amp;#039;, but I didn&amp;#039;t have time to finish it for the &amp;#039;Shivers&amp;#039; album. I love the harmonies on this one.&quot;\n\n8. Shivers (Alex M.O.R.P.H. Red light dub) \n&quot;The original of this track was &amp;#039;birth of an angel&amp;#039; and was never supposed to be a vocal track until Raz &amp; Adrian wrote this great hook with Susana. Great remix by Alex M.O.R.P.H.&quot;\n\n9. Wall of Sound (Airbase presents Parc mix) (feat. Justine Suissa) \n&quot;I told Justine I wanted to write about a different subject instead of romance or love for this track. This remix absolutely rocks every floor I&amp;#039;ve played it on.&quot;\n\n10. Intruder (feat. M.I.K.E.)\n&quot;Written in Belgium with M.I.K.E. We both wanted to make something different and came up with this.&quot;\n\n\nENJOY:&gt;","torrent":{"xt":"urn:btih:a2d25b2f4b0843af6e756f9630021b6d05e23546","amp;dn":"ArmiVaBuuren-10_Years-2CD-320-2006-TRANCEZONE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2d25b2f4b0843af6e756f9630021b6d05e23546","infoHashBuffer":{"type":"Buffer","data":[162,210,91,47,75,8,67,175,110,117,111,150,48,2,27,109,5,226,53,70]},"announce":[],"urlList":[]}}