{"title":"MetArt - Update Pack - 070819-070830","uid":3794886,"size":7564251254,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:a3202f659bca4932506c04aa1ec5925aaa7349cb&amp;dn=MetArt+-+Update+Pack+-+070819-070830&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"djmuggs","files":44,"time":1188882410,"description":"More Royalty Free/Stock Nude Photos* of attractive prepubescent Looking 30yr olds, unimaginatively photographed by the masters of paedophilia style porn &quot;Most Erotic Teenagers&quot; (teenÂ·agÂ·er n. A person between the ages of 13 and 19; an adolescent.).\n\nIts such a great shame that these photographers have all of these beautiful women to work with but don&amp;#039;t spend anytime in setting up a shoot or preparing the model instead they continue to use the typical &amp;#039;striptease&amp;#039; style of pornography which compliment&amp;#039;s thier unimaginative settings, Bedrooms, Doorways, Chairs, Forests/Grassland and anything which of course involves water With the models smiling fakley and giggling unnecessarily throughout the shoot with their clashing make-up, clothing and fashion accessories.\n\nThis and many other sites like it are all based on a pretense that beacase there &amp;#039;Models&amp;#039; are not seen sticking sex aids into themselfs and staging other fake sex scenes that this makes them non-pornographic and of a superior quality that they like to call with great pride &amp;#039;Erotic&amp;#039;, &amp;#039;Sensual&amp;#039; &amp;#039;Art&amp;#039;, but theres nothing sexy or erotic in a image of a close up shot of a half shaven vagina or a woman seated in a chair with her legs wide open laughing at the photographer instead of paying attention to her surroundings and own body language and presenting herself accordingly.\n\nThis and many other sites like it will never produce an Erotic or sexy image until they start investing some time and effort into learning how to photograph these models (or should that be Teenagers) in a more professional manner and until that time their images will remain nothing more than dressed up smut.\n\n\n*All Images found freely on publicly accessible websites, No Copyright data was found in either the EXIF/IPTC so therefore all images are belived to be within the public domain.\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a3202f659bca4932506c04aa1ec5925aaa7349cb","amp;dn":"MetArt+-+Update+Pack+-+070819-070830","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3202f659bca4932506c04aa1ec5925aaa7349cb","infoHashBuffer":{"type":"Buffer","data":[163,32,47,101,155,202,73,50,80,108,4,170,30,197,146,90,170,115,73,203]},"announce":[],"urlList":[]}}