{"title":"Metallica - Ride The Lightning 1984 (Unique Custom Remaster, 200","uid":3785601,"size":353871825,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a381fdbc1153e57b52bd46e317a7ca37b67174e3&amp;dn=Metallica+-+Ride+The+Lightning+1984+%28Unique+Custom+Remaster%2C+200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tech-Noir","files":12,"time":1188186240,"description":"Metallica - Ride The Lightning 1984 (Unique Custom Remaster, 2007) FLAC\n\n\n-----------------------------------------------------------------------\nTechnical Info\n-----------------------------------------------------------------------\n\n-Source material:\nFLAC Lossless (&quot;Metallica - Ride The Lightning {DCC Gold CD} (2000) [FLAC]&quot;)\n\n\n-New Encoding:\nFLAC Lossless (In other words, full quality compressed to generally about 1/2 of an Audio CD size)\n\n\n-Total Size:\n337 MB\n\n\n-Total Play Time:\n00:47:36\n\n\n-Tracklist:\n1. Metallica - Fight Fire With Fire (Remastered) (4:45)\n2. Metallica - Ride The Lightning (Remastered) (6:41)\n3. Metallica - For Whom The Bell Tolls (Remastered) (5:09)\n4. Metallica - Fade To Black (Remastered) (6:59)\n5. Metallica - Trapped Under Ice (Remastered) (4:08)\n6. Metallica - Escape (Remastered) (4:24)\n7. Metallica - Creeping Death (Remastered) (6:35)\n8. Metallica - The Call Of Ktulu (Remastered) (8:55)\n\n\n\n\n-----------------------------------------------------------------------\nGeneral Info\n-----------------------------------------------------------------------\n\n\nSo here is &quot;Ride The Lightning&quot;. The source CD is the remastered Gold edition (Same for &quot;Master Of Puppets&quot;).\n\nThis source sounded quite a bit better than Master of Puppets I would say. Still the same EQ problems, but audio overall is much better and there is less distortion and troublesome resonances and such, especially in the lower frequencies. On the other hand the vocals sometimes sound slightly &quot;unnatural&quot; with some frequencies sticking out, compared to the &quot;Puppets&quot; vocals that always seemed even and clear.\n\nAnyways, the changes on this one is alot more subtle than &quot;Master Of Puppets&quot;. Since the bassfrequencies were alot better I didn&amp;#039;t have to do much creative changes with harmonic processors etc to get a smooth even sounding low end. There is still some subtle work there but alot less intrusive than &quot;Puppets&quot;.\n\nThere is also denoising on alot of the tracks that benefit from it, an example being the acoustic intro to &quot;Fade To Black&quot;. The Original has very audible noise that starts as the guitar track starts. This is now gone. Also there is some decrackling applied on parts of tracks where just a guitar is heard. These parts are sometimes a bit distorted on the original but decrackling it takes some of the edge off. Whenever there are drums involved though it isn&amp;#039;t applied since it also takes the edge of drum sounds.\nThe drawback with denoising like I&amp;#039;ve done is that tracks that fadeout at the end usually gets more and more &quot;muted&quot; as the volume get&amp;#039;s lower and lower (Since denoising is usually a &quot;threshold&quot; type process, when teh audio volume descreases during the fade-out the denoising process becomes more aggressive. It would be less problematic if it had been applied to the &quot;master tapes&quot; before fade-outs etc were done. You&amp;#039;ll have to live with it. :)\n\nOther than that, just lots of EQ to correct the skewed spectrum of the original. Stuff sounds alot more natural now, and there is air and openness to the highend. I would have liked to Equalize each instrument individually in this case though. &quot;Master Of Puppets&quot; was quite well-Equalized in regards to the balance between vocals and instruments. All that needed was an overall adjustment to balance the sound.\nHere the vocals tend to lack air and presence a bit when compared to the hihats. Not much change needed, but it would have been nice. Also the acoustic guitars on &quot;Fade To Black&quot; might seem slightly bright (real acoustic guitars are usually quite dull in the sound, although the guitars here could be steelstringed or of a different model than the &quot;usual&quot; acoustic guitar), although I quite like the sound. It&amp;#039;s constantly a compromise between having an instrument as bright as it should be while not making others too bright in the process. :)\n\nNo real compression or such applied either, the original sounds great in that aspect.\n\nSo, this one &quot;might&quot; please purists slightly more than my more &quot;restored&quot; version of &quot;Master Of Puppets&quot;. The sound has still changed quite drastically thanks to EQ, but not much &quot;creative&quot; changes so to speak.\n\nMake sure to listen on a good pair of headphones or a stereo setup\n\n\nHope you enjoy, and you are very welcome to leave a comment if you feel like it (and know where to find the original torrent obviously). :)","torrent":{"xt":"urn:btih:a381fdbc1153e57b52bd46e317a7ca37b67174e3","amp;dn":"Metallica+-+Ride+The+Lightning+1984+%28Unique+Custom+Remaster%2C+200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a381fdbc1153e57b52bd46e317a7ca37b67174e3","infoHashBuffer":{"type":"Buffer","data":[163,129,253,188,17,83,229,123,82,189,70,227,23,167,202,55,182,113,116,227]},"announce":[],"urlList":[]}}