{"title":"A Furry Oddity DVD Volume 1","uid":3709171,"size":4213220245,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a39f4f888f6ec49e2d270cdd1068301d8c3aed34&amp;dn=A+Furry+Oddity+DVD+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"griffie","files":94,"time":1181395038,"description":"A handful of wierd furry anime from Malaysia and a bunch of 90s dinosaur cartoons.\nSkyland Sentinel is a CGI action/adventure series. Episodes 1-4 involve a group of four - Tiger, Dragon, Horse, and Cow - attempting to stop a psychotic military robot that has landed in a world populated by vaguely scary furry charachters, and even scarier psudo-humanoids. 5-8 deal with the same group attempting to stop an infestation of bug-like creatures that have decided that they really don&amp;#039;t care much for the inhabitants of the world. Malaysian spoken language, with Chinese and English (or Engrish) subtitles. A small part of one of the later episodes is not subtitled, but it&amp;#039;s pretty obvious what&amp;#039;s going on. Give this one an A- for effort, but a C for animation value.\nExtreme Dinosaurs is a cartoon from the 90s. If I remember correctly, it was supposed to have some sort of educational value. Maybe that was Dragon Flyz, who knows. Watch this one for the brain rot certain cartoons were able to give to small children. About as much redeeming quality as Animalympics, with none of the good animation. Ha! English spoken language.\nIncludes the covers to all the original VCDs, as well as scans of the discs.\nBurn the files to a DVD for playback in a DVD player.\nPAL video, VCD on DVD, mono audio with subtitles.\n","torrent":{"xt":"urn:btih:a39f4f888f6ec49e2d270cdd1068301d8c3aed34","amp;dn":"A+Furry+Oddity+DVD+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a39f4f888f6ec49e2d270cdd1068301d8c3aed34","infoHashBuffer":{"type":"Buffer","data":[163,159,79,136,143,110,196,158,45,39,12,221,16,104,48,29,140,58,237,52]},"announce":[],"urlList":[]}}