{"title":"Saul Williams - 05 - Break.mp3","uid":3858980,"size":7925017,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4084169cb55d959438de45d12edb02d437ba821&amp;dn=Saul+Williams+-+05+-+Break.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"analiencure","files":1,"time":1193369559,"description":"Big news today!\n\nAs many of you know, I&amp;#039;ve been working closely with Saul Williams on\nhis new record. We&amp;#039;ve spent many hours together in hotel rooms,\nbusses, backstages and studios around the world working on something\nwe knew was great. This is the most involved I&amp;#039;ve been with any\nproject outside NIN since Antichrist Superstar, and I&amp;#039;ve been\nimpatiently waiting for the chance for you to hear it.\n\nWell... guess what?\n\nThe Inevitable Rise and Liberation of NiggyTardust! has arrived!\nAfter my own recent dealings with record labels we decided to release\nit directly to you. Head over to www.niggytardust.com for all the\ndetails. Register now and you can download the record November 1st.\n\nWorking on this project was a real pleasure. Saul was interested in\nbreaking boundaries / crossing genres / defying expectations and we\nlearned a great deal from one another in the process. When asked about\nthe sound of the record, I&amp;#039;ve had to resort to &quot;... I really don&amp;#039;t\nknow HOW to describe it.&quot; That&amp;#039;s a good thing more than ever these\ndays.\n\nA word on the way we&amp;#039;ve chosen to release this.\nThere are obvious similarities in how Radiohead just released their\nnew record and the way we&amp;#039;ve chosen to. After thinking about this way\ntoo much, I feel we&amp;#039;ve improved upon their idea in a few profound ways\nthat benefit you, the consumer. You obviously will be the judge of\nthis in the end. One thing that IS very different in our situation is\nthat Saul&amp;#039;s not the household name (yet!) that Radiohead is, and that\nmeans we need your support on this more than ever. If you like what\nyou hear, spread the word.\n\nI hope you enjoy the music,\n\n-Trent Reznor\n\n\nA blog post from Trent Reznor:\n\n\n10/25/07 : NIGGYTARDUST!\nThe other half of what I was working on the whole time I was doing\nYEAR ZERO will soon be available. Head over to niggytardust.com for\ndetails. Your support on this project would mean a lot to me. It&amp;#039;s a\nweird time to be an artist and it sure would be nice to show the\ncorporate assholes that seem to run everything that an audience CAN be\ntreated with respect.\n\nRegardless of the boring mechanics of how you GET the record, the only\nthing that really matters is the music and if I didn&amp;#039;t believe in this\ncompletely I wouldn&amp;#039;t have dedicated the time or be saying this to you\nright now.\nMany times throughout the process of making this the phrase &quot;I can&amp;#039;t\nwait to blow people&amp;#039;s minds with this&quot; was heard. Check it out!\n\nWill it be on cd? here&amp;#039;s Saul to answer that one:\n\nThere will be nice cd packages with cool artwork, writings etc. in\nstores early next year, but why wait to share the music!\n\n\nAnd more thoughts on the album, which can be found on saul&amp;#039;s myspace.\n\n\nThe Inevitable Rise and Liberation of NiggyTardust! is the lovechild\nof me and Trent Reznor. I met Trent when he asked me to fill the\nopening slot of his European With Teeth tour. After only the 2nd show\nhe asked if I might be down to collaborate on a song or album,\nwhatever I saw fit. At the time we were both listening to the\nKanye/Jon Brion collaborations and feeling like a cocktail of our two\nworlds would fare even more interesting?and harder. Since then, Trent\nReznor has become the big brother I never had, offering his insight,\nexpertise, and shared desire to fuck up the system while believing\nfully in the power of music and the intelligence of the masses. What\nwe both first realized we had in common was a deep love of Public\nEnemy and their Bomb Squad production, which personally served as the\nbackdrop of my adolescence and fueled the fire that matured my vision\nof the sort of artist I wanted to be. A lot of people get caught up on\nmy lyrics and poetry, but my writing is always founded on beats and\npolyrhythmic backdrops. My background as a dancer (I used to dance for\na rap group in ATL in the early 90s) has always made me crave hard\nrhythms. Through Public Enemy I discovered that my ability to dance\nsomehow improved when I truly felt the power of the words. This album\ncaptures everything I have aimed for in a song. Of course, as a\nperformer, what truly inspires me is the opportunity to perform them\nlive. The Niggytardust concept sets me free to do more on stage with\ncostume, etc. than one might expect from a regular Saul Williams show.\nIt allows me to put my theatre training to use. I&amp;#039;ve also thought long\nand hard about all the discussion surrounding racial epithets etc. and\nchose this title as a means of furthering the dialogue while also\nshowing how creativity will outlive and outshine hatred of any kind.\n\nThe album would not have been possible without the collaborative\nspirit Trent and the other artists involved: CX Kidtronik and Thavius\nBeck brought beats and fire to the vision, energizing the process with\nblown amps and head-nodding cramps. Atticus Ross engineered and\nprogrammed. Alan Moulder is sonic testimony from headphone to full\nblown that the very rocks will cry out if you work with the right\nengineer.\n\nI&amp;#039;m also collaborating with visual artists and designers as part of\nthe whole NiggyTardust concept and presentation. Melody Ehsani\ndesigned Tardust jewelry, bracelets, rings. necklaces, etc. and also\ndid the cover layout. Angelbert Metoyer has contributed greatly to the\nvisual aesthetic with paintings and soon to be finished set design for\nthe shows.\n\nAs far as the way we&amp;#039;ve decided to release the album, we&amp;#039;re aware that\nit&amp;#039;s pretty risky, but are even more aware that we cant turn to the\nso-called powers that be of the industry for answers. Someone has got\nto be willing to take chances. I was very inspired by the recent\nRadiohead release and felt compelled, almost instantly, to follow my\ngut and expand on their concept. Obviously, independent artists have\nbeen around for years. My indie film, Slam was in fact what opened so\nmany doors for me. yet, the stigma of being an indie artist in the\nmusic world hasn&amp;#039;t always been rewarding. This time I feel different.\nI feel like the times have conspired to make this album an important\npart of history.\n\n- Saul Williams","torrent":{"xt":"urn:btih:a4084169cb55d959438de45d12edb02d437ba821","amp;dn":"Saul+Williams+-+05+-+Break.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4084169cb55d959438de45d12edb02d437ba821","infoHashBuffer":{"type":"Buffer","data":[164,8,65,105,203,85,217,89,67,141,228,93,18,237,176,45,67,123,168,33]},"announce":[],"urlList":[]}}