{"title":"Storm Hawks 101-02 Age of Heroes [p7]","uid":3707768,"size":356691208,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a45f0128576510c4c8e7024794c1c6582a4d68b7&amp;dn=Storm+Hawks+101-02+Age+of+Heroes+%5Bp7%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lebang","files":1,"time":1181250578,"description":"Series Informaion:\n\nToo young for fear, or a pilot?s license, the Storm Hawks love nothing more than cruising the skies on the lookout for adventure (well, except for Stork, who would really rather stay on the Condor, thank you).  \nLed by Aerrow, one of the most naturally gifted Sky Knights in the Atmos, Piper, Finn, Junko, Stork and Radarr are on a mission to protect the innocent and strike back at oppression?and if that means thwarting Master Cyclonis?s evil plans and humiliating the sinister Dark Ace, so much the better. Armed with high-octane transforming flying motorcycles, these punks are ready and willing to dog-fight some of the nastiest villains to ever hit the skies.  \nThe Sky Knight council may not recognize their official status, but that won?t keep the Storm Hawks from their dangerous quest to save the world of Atmos one terra at a time. And they?ll send anyone who dares try and clip their wings into a serious tailspin!\n\nEpisode Informaion:\nThe Age of Heroes, Part 1 &amp; 2\nPart 1:\nYoung Sky Knight Aerrow and his squadron, the Storm Hawks, get their first taste of battle when the sinister Master Cyclonis sends the dread Dark Ace to steal the most powerful crystal in the Atmos: the Aurora Stone.\nPart 2:\nHaving lost the Aurora Stone to the cunning Dark Ace, The Storm Hawks mount a daring mission, sneaking into the very heart of the evil empire of Cyclonia to take the powerful crystal back.\n","torrent":{"xt":"urn:btih:a45f0128576510c4c8e7024794c1c6582a4d68b7","amp;dn":"Storm+Hawks+101-02+Age+of+Heroes+%5Bp7%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45f0128576510c4c8e7024794c1c6582a4d68b7","infoHashBuffer":{"type":"Buffer","data":[164,95,1,40,87,101,16,196,200,231,2,71,148,193,198,88,42,77,104,183]},"announce":[],"urlList":[]}}