{"title":"[Kung Fu] Amsterdam Connection (Sing Chen, Bolo Yeung, 1977) EN","uid":3961462,"size":427199913,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a496e4dcef3dbeb10bd0e01b6fece82bb626cc11&amp;dn=%5BKung+Fu%5D+Amsterdam+Connection+%28Sing+Chen%2C+Bolo+Yeung%2C+1977%29+EN+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JamesKees","files":2,"time":1199476275,"description":"Guys/Gals,\n\nHappy new year to you and yours!\n\nI have reached and exceeded the limits of my seeding capabilities, burning my PC\\&amp;#039;s CPU in the process due to overheating, and I cannot remain effective in uploading and seeding simultaneously anymore.\nRest assure, the Fu will remain alive. From today onwards, I will keep posting new releases via a new referral, with direct download, at:  &lt;a href=&quot;\nhttp://www.fuflixbulletin.net/bulletin/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fuflixbulletin.net/bulletin/&lt;/a&gt;\n\nThe remaining of today\\&amp;#039;s releases are also available via the above referral.\n\nWe hope that you will come and visit us soon.\n\n---\n\nAmsterdam Connection (Sing Chen, Bolo Yeung, 1977) EN - DVD/Rmvb\n\nPlot:\nFan Mei Sheng concocts a plan to use prostitutes to smuggle drugs from Amsterdam into Hong Kong. When the gang kidnaps the same woman who ruined their friendship, Jason Pai Piao and Wong Yuen San must put aside their differences to free her. \n\nOverview:\nJason Pai Piao (DEATH MASK OF THE NINJA) and Wong Yuen San (TEN TIGER\\&amp;#039;S OF SHAOLIN) are two young martial artists who become good friends, until a woman\\&amp;#039;s affections drive them apart. Jason Pai Piao joins a gang run by Bolo Yeung (Enter the Dragon), and Wong Yuen San ends up in a rival gang of drug smugglers commanded by Fan Mei Sheng. The action begins in the streets of modern day Hong Kong, and shifts to Amsterdam when Fan Mei Sheng concocts a plan to use prostitutes for smuggling drugs back into Hong Kong. When the gang kidnaps the same woman who ruined their friendship, Jason Pai Piao and Wong Yuen San must put aside their differences to free her. Throw Hong Kong bad boy Chen Sing (Bloody Fists) into the mix and you know action, intrigue, corruption, and betrayal will follow. \n\nCast:\nChan Sing (Chen Shing), Wong Yuen San (Wong Yuen Sung), Jason Pai Piao (Jason Pai Piow), Bolo Yeung, Mai Laan, Milan, Fan Mei Sheng (Fang Mui San), Wong Ka Lung, Kid Cherrif, Van Dijkstra, Lookie, Yuen Biao, Lam Ching Ying, Billy Chan Wui-Ngai\n\n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.527493/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.527493/qx/details.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:a496e4dcef3dbeb10bd0e01b6fece82bb626cc11","amp;dn":"%5BKung+Fu%5D+Amsterdam+Connection+%28Sing+Chen%2C+Bolo+Yeung%2C+1977%29+EN+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a496e4dcef3dbeb10bd0e01b6fece82bb626cc11","infoHashBuffer":{"type":"Buffer","data":[164,150,228,220,239,61,190,177,11,208,224,27,111,236,232,43,182,38,204,17]},"announce":[],"urlList":[]}}