{"title":"Destruction And Creation","uid":3542582,"size":100908344,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a49d14b94e08aec6b36fa080f0e5e43205dbab2e&amp;dn=Destruction+And+Creation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"azathothian666","files":12,"time":1161299936,"description":"Concerto Moon - Destruction And Creation\n\nRelease date: \t2002\nStyle: \tPower metal\n\nRating: \t\n5.3 | 4 votes\n\n\n01. Unstill Night\n02. King Of The Judas\n03. Lonely Last Journey\n04. Dream Chaser\n05. Holy Child\n06. Halfway To The Sun\n07. From Father To Son\n08. Fight To The Death\n09. Change My Heart\n10. Out Of Deep Freeze\n11. Angels In Black\n12. Second War In Heaven\n\n\nReview by Iron Markus\n\nOne year after the release of Gate Of Triumph the five metallers of Concerto Moon chose to do a compilation of their earlier albums, but not in the classic sense. Instead it was a rerecording with their new vocalist Takashi Inoue. Probably this happened in vein of the two rerecorded tracks on their predecessing album. Maybe just because their new singer is so great. Who knows, but what will be actually new on this record?\n\nApart from three newly recorded songs that will be mentioned later on we find new sonds through the altered lyrics of Takashi Inoue. Changes can be heard in lead guitar parts of all songs, &amp;#039;King Of The Judas&amp;#039; and &amp;#039;Change My Heart&amp;#039; got new keyboard-solos. On &amp;#039;Holy Child&amp;#039; the keyboards did change completely. The overall production seems to be more powerful than the old tunes and more aggressive though not lacking the melody. In fact you can take notice of that on all of the songs. After the first nine rerecorded songs come three new ones out of which two are instrumentals. The first one, &amp;#039;Out Of Deep Freeze,&amp;#039; is a typical Concerto Moon instrumental that could have been heard before. &amp;#039;Angels In Black&amp;#039; is way harder and not too melodic, so it&amp;#039;s not that typical. It has about the coolest intro ever: keyboards playing fast lines and guitar filling with heavy distorted sound. The last song belongs to the best that Concerto Moon have ever recorded (if you don&amp;#039;t mind some strange English), it is called &amp;#039;Second War In Heaven&amp;#039; musically and vocally one of the best. If the band succeeds in improving their songwriting in terms of lyrics and their English skills they should be able to overcome their unknown status over the boarders of Japan once and forever.\n\nEvaluating the whole album the mini bonus cd with &amp;#039;Over and Over&amp;#039; and &amp;#039;Gate Of Triumph&amp;#039; live versions has to be taken into account. The more profound production with the improved sound and the (not very drastic) instrumental changes and the overall improvement of the lead singer should receive 9 points.","torrent":{"xt":"urn:btih:a49d14b94e08aec6b36fa080f0e5e43205dbab2e","amp;dn":"Destruction+And+Creation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49d14b94e08aec6b36fa080f0e5e43205dbab2e","infoHashBuffer":{"type":"Buffer","data":[164,157,20,185,78,8,174,198,179,111,160,128,240,229,228,50,5,219,171,46]},"announce":[],"urlList":[]}}