{"title":"software pack.zip","uid":3957554,"size":56433698,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a6bd31d07f44a1c19519e1eae455c9da212bc7c8&amp;dn=software+pack.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"silvanov2","files":1,"time":1199250442,"description":"Just a quick pack of installers for software I reccomend all my friends and family to use, most alternatives to standard applications. \n\n\nList:\n\n-Firefox (internet explorer alternative, and the only browser I use)\n\n-Thunderbird (outlook express alternative. I prefer local software for my email, so ive got my isp, domain, and \ngmail email adresses all going into thunderbird)\n\n-Foxit pdf reader ( Much smaller, faster, and less intrusive pdf viewer, alternative to adobe pdf reader, that wont nag you to update twice a month)\n\n-Vlc player (media player, plays most formats, i use this in combination with klite codec pack to play just about any file you&amp;#039;ll ever run into)\n\n-K Lite Codec Pack (see above)\n\n-Utorrent (if your into filesharing, get of limewire/kazaa/bearshare and learn how to use torrents. This in combination withor piratebay.org should get you all the downloads you&amp;#039;d want)\n\n-Pidgin (Instant messenger client that allows you to talk on just about all of the different messenger accounts out there. Yahoo, aol, msn, google talk, and probably more that i dont use) \n\n-Imgburn (downloaded a dvd in iso format? or a game iso? got bin and cue files? imgburn will burn them to cd/dvd for you. lightweight free alternative to nero)\n\n-MediaMonkey 3 beta (I&amp;#039;ve used winamp since napster came out WAY BACK when. Just within the past year, ive found mediamonkey, and its probably the best mp3 player/organizer ive ever used. Similar to itunes, can tag/rename your files, move them, get album art/covers, create playlists, burn audio cds. and synch up your mp3 player.)\n\n-Launchy (hit alt enter and start typing what you want to find/run. So much quicker than clicking through your start menu.)\n\n-Winrar (this Should let extract just about any file you download.)\n\n\nHope someone finds this useful, will upload on a few public trackers, as well, as a few forums.\n\n\nIf your looking for game reviews, rap music singles and albums, or random computer tips and software, please check out http://www.silvanov.com/blog/","torrent":{"xt":"urn:btih:a6bd31d07f44a1c19519e1eae455c9da212bc7c8","amp;dn":"software+pack.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6bd31d07f44a1c19519e1eae455c9da212bc7c8","infoHashBuffer":{"type":"Buffer","data":[166,189,49,208,127,68,161,193,149,25,225,234,228,85,201,218,33,43,199,200]},"announce":[],"urlList":[]}}