{"title":"The Sons of Katie Elder DVD9 Spa,Eng,Ger,Ita,Fre+Multisubs","uid":3804211,"size":8027105453,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a7e30be134130c55c42ea1b58901cfde6f82f452&amp;dn=The+Sons+of+Katie+Elder+DVD9+Spa%2CEng%2CGer%2CIta%2CFre%2BMultisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jousmari","files":27,"time":1189602087,"description":"SOLODVD ORG .NOW HD!!!\n\nDirector: Henry Hathaway\n\nCast: John Wayne, Dennis Hopper, Sheldon Allman, John Litel, Paul Fix, Dean Martin, Martha Hyer, Michael Anderson Jr., Earl Holliman\n\nLength: 117 min\n\nVideo: Pal Widescreen 2.35:1\n\nLanguages: Mono: English, French, German, Italian, Spanish\n\nSubtitles: English, Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, Finnish, French, German, Greek, Hebrew, Hungarian, Icelandic, Italian, Norwegian, Polish, Portuguese, Rumanian, Slovakian, Spanish, Swedish, Turkish, English for deaf people\n\nSynopsis: Katie Elder bore four sons. The day she is buried they all return home to Clearwater, Texas, to pay their last respects. John Wayne is the eldest and toughest son, the gunslinger. Tom (Dean Martin) is good with a deck of cards and good with a gun when he has to be. Matt (Earl Holliman) is the quiet one -nobody ever called him yellow... twice. Bud (Michael Anderson, Jr.) is the youngest. Any hope for respectability lies with him. Directed by Henry Hathaway (True Grit), an acknowledged master of the Western, the story has a dual theme: not only is this a he-mans story, but it is also a drama of the maternal influence of Katie Elder, movingly portrayed from beginning to conclusion.\n\nOther features: Interactive Menus, Scene Access, Theatrical Trailer\n\nDvd9 Untouched.\n\nSOLODVD ORG .NOW HD!!!","torrent":{"xt":"urn:btih:a7e30be134130c55c42ea1b58901cfde6f82f452","amp;dn":"The+Sons+of+Katie+Elder+DVD9+Spa%2CEng%2CGer%2CIta%2CFre%2BMultisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7e30be134130c55c42ea1b58901cfde6f82f452","infoHashBuffer":{"type":"Buffer","data":[167,227,11,225,52,19,12,85,196,46,161,181,137,1,207,222,111,130,244,82]},"announce":[],"urlList":[]}}