{"title":"Cake.Poker.Online.Poker.Bonus.Review.Edition.rar","uid":3589223,"size":12979535,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a854470c45b8c8faf0a88cf335136ce695175154&amp;dn=Cake.Poker.Online.Poker.Bonus.Review.Edition.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jenny0","files":1,"time":1167871667,"description":"Summary \n \nCake Poker entered the world of online poker in 2005 and has had a mediocre growth ever since. The Cake Poker team has great ambitions however and can achieve great things if they play their cards right. The traffic is rather low, but the positive development of quality tournaments is likely going to make things better. As for variety, there&amp;#039;s not much to add other than the usual Hold&amp;#039;em, Omaha and 7 Card Stud. If you are a person who enjoys collecting items, this portal is definitely interesting due to the Gold Card program, which can earn you a total of $52,000. All in all, Cake Poker is an online poker room with potential, but if you&amp;#039;re looking for a trafficated poker room site, then look at our higher-ranked rooms.\n\nSoftware \n \nThe software of Cake Poker is as realistic as you can get, without making a fully three-dimensional game. The first thing you will notice at the table is that every character is actually a photographed model. The graphics resemble what we&amp;#039;re used to at PokerRoom, but with greater variation; you can choose between several avatars and let them sit at any chair. Other table features include the usual, such as player notes and visual customizations. On the lobby-side of things, we&amp;#039;re slightly disappointed to tell that the lobby is not on par with the table. The graphics are a bit outdated and the navigation isn&amp;#039;t very logical and requires some brain power.\n\nTraffic \n \nEvery new room that is on proprietary software and a closed network requires a few years of growth before we are fully satisfied with the user traffic. Cake Poker is unfortunately not idealistic for people who demand a large traffic flow. The tournaments do get some action every now and then, but during peak hours, we rarely see above 500 players connected simultaneously.\n\nTournaments \n \nDespite the low traffic, Cake Poker puts some effort into creating tournaments of various kinds. We have minor satellites, freerolls, sit &amp; go action and some private tables.\n\nGame Variety \n \nCake Poker offers the typical line-up of poker game modes. The most prominent one is obviously Texas Hold&amp;#039;em with No Limit, Pot Limit and Fixed Limit. Omaha, Omaha Hi/Lo, 7 Card Stud and 7 Card Stud Hi/Lo is available, but we&amp;#039;re missing turbo action.\n\nSoft Competition \n \nNew poker rooms often attract the loose players who tend to fit in the fish category quite well. Cake Poker&amp;#039;s common player is no exception. Even $1/$2 tables reveal players per flop as high as 60 % and beyond. The low stake play is very loose as it always is, but never above 80 %.\n\nSign Up Bonus \n \nEveryPoker.com and Cake Poker are offering a sign up bonus worth a total of $500. The deposit match is at 100 % and it is very easy to claim. To get the full bonus, you are required to deposit $500 using bonus code 1CAKE4FREE.\n\nLoyalty Rewards\n \nCake Poker offers a unique Gold Card lottery, which is basically a small amount of golden cards handed out every day to every player who is participating at the real money ring games and tournaments. If you get a card, you can redeem this for tournaments, merchandise or keep it and collect all 52 cards and receive $52,000. Cake Poker also hands out what&amp;#039;s equivalent to frequent player points. You earn Cake Slices by participating in real money games. The more you make, the bigger rewards you get.\n\nPromotions \n \nYou can own a piece of Cake Poker for life, simply by winning one of the few one-percent shares of Cake Gaming N.V. This is potentially worth millions of dollars in a few years. Other than that, you can participate in small freerolls and friend referral programmes.\n\nSupport \n \nCake Poker offers a basic FAQ and e-mail support. We&amp;#039;re not really expecting a small poker room like CakePoker to offer telephone support or a live chat, but this has grown into a standard nowadays. On the other hand, you get a fast reply and usually very useful information in the mail.\n","torrent":{"xt":"urn:btih:a854470c45b8c8faf0a88cf335136ce695175154","amp;dn":"Cake.Poker.Online.Poker.Bonus.Review.Edition.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a854470c45b8c8faf0a88cf335136ce695175154","infoHashBuffer":{"type":"Buffer","data":[168,84,71,12,69,184,200,250,240,168,140,243,53,19,108,230,149,23,81,84]},"announce":[],"urlList":[]}}