{"title":"Underworld I &amp; II","uid":3829378,"size":2197868757,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8f7896371e5a8b533aa708d1ca755aa36a67bfe&amp;dn=Underworld+I+%26+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cooper_67","files":8,"time":1191489463,"description":"Underworld I info.\n\nVampires and Werewolves have been sworn enemies for hundreds of years. Now fought in a Gothic-like setting, the conflict takes an unexpected and deadly new turn. Selene, a beautiful vampire warrior, uncovers a Lycan plot that could prove fatal for her entire race. She shadows a human, Michael, the Lycan\\&amp;#039;s supposed target. Although she finds herself becoming attracted to him, he becomes infected with the lupine disease during a violent struggle with the Lycan overlord, Lucian, long thought to be dead. Now both sides must decide how to end the conflict and save their species as new and terrifying secrets unearth themselves and threaten their entire existance.\n\nUnderworld Evolution Info.\n\nSelene (Kate Beckinsale) wishes to expose the truth about the death of Viktor to the first true vampire Marcus (Tony Curran) that is hibernating. However, Marcus has already awakened and wants to release his savage Lycan brother William (Brian Steele), who has been imprisoned for centuries. When Marcus tries to get the medal possessed by Lucian from Michael (Scott Speedman), Selene decides to visit Andreas Tanis (Steven Mackintosh), the exiled official historian of the covens, to understand his interest. When Selene and Michael meet Tanis, they disclose the truth about their bloodlines, and later with the support of Alexander Corvinus (Sir Derek Jacobi), Selene faces the powerful Marcus as the last hope left for the mankind.","torrent":{"xt":"urn:btih:a8f7896371e5a8b533aa708d1ca755aa36a67bfe","amp;dn":"Underworld+I+%26+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f7896371e5a8b533aa708d1ca755aa36a67bfe","infoHashBuffer":{"type":"Buffer","data":[168,247,137,99,113,229,168,181,51,170,112,141,28,167,85,170,54,166,123,254]},"announce":[],"urlList":[]}}