{"title":"High School Musical for iPod MP4","uid":3824174,"size":394323667,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a9d7515ebef866f77393b404855dead07b52ef14&amp;dn=High+School+Musical+for+iPod+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"smoochieinla","files":1,"time":1191107245,"description":"The Disney Channel Original Movie High School Musical is a combination of backstage action and Grease without the unwholesome habits. Scoring record ratings at the time of its January 2006 broadcast, it&amp;#039;s a smash hit with tween audiences (ages 6 to 10), but appealing for all ages. At a New Year&amp;#039;s Eve party, Troy (Zac Efron of the WB&amp;#039;s Summerland) has a chance meeting with Gabriella (Vanessa Anne Hudgens) when they share a karaoke song. Lo and behold, when school resumes, they discover that Gabriella has just transferred to Troy&amp;#039;s East High School, a campus divided into tight cliques of jocks, cheerleaders, brainiacs, and skater dudes. Eager to recapture the magic they&amp;#039;d discovered during karaoke, Troy and Gabriella consider auditioning for the school&amp;#039;s upcoming musical, much to the dismay of the school&amp;#039;s frost queen/theater goddess, Sharpay (Ashley Tisdale of The Suite Life of Zack and Cody). Problem is, Troy is also the star of the basketball team and Gabrielle is being recruited to compete in the Scholastic Decathlon. Will they give up their cliques to start something new, or will they do as the show&amp;#039;s first big anthem urges and &quot;Stick to the Status Quo&quot;? Well, this is a Disney movie, so maybe the sacrifices won&amp;#039;t be that hard, and even the hints of romance are mild.","torrent":{"xt":"urn:btih:a9d7515ebef866f77393b404855dead07b52ef14","amp;dn":"High+School+Musical+for+iPod+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d7515ebef866f77393b404855dead07b52ef14","infoHashBuffer":{"type":"Buffer","data":[169,215,81,94,190,248,102,247,115,147,180,4,133,93,234,208,123,82,239,20]},"announce":[],"urlList":[]}}