{"title":"[Kung Fu] Bodyguard From Beijing aka The Defender (Jet Li, 1994)","uid":3859896,"size":343259636,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa105c20fe08fcb3a8deb90b73070d7f04296340&amp;dn=%5BKung+Fu%5D+Bodyguard+From+Beijing+aka+The+Defender+%28Jet+Li%2C+1994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"JamesKees","files":8,"time":1193421028,"description":"Bodyguard From Beijing aka The Defender (Jet Li, 1994) CN - Rmvb\n\nHKFlix Says:  \nAlthough the characters and plot are paper thin, this film redeems itself in its creative action sequences. Jet Li&amp;#039;s lightning fast precision moves are impressive as always, and the fight choreography is fresh and enjoyable. \n\nAvg. Rating:  3.8 / 5 (based on 6 ratings).\n\nPlot: Li plays a hard-hitting and highly trained bodyguard hired by a businessman to protect his girlfriend after she witnesses a murder. While becoming targeted for retribution himself, Li and the girlfriend begin to develop feelings for one another. \n \nOverview: Hong Kong martial arts master Jet Li plays a bodyguard from the Beijing secret police, sent to Hong Kong to protect a beautiful young witness to a mob killing, played by Christy Chung. Li turns her home into a high-security prison, complete with video cameras surveying every room, even her bedroom. Furious, Chung resists his efforts to protect her--until the threat to her life is made abundantly clear in a spectacular shopping mall shootout. As is natural under such circumstances, romance begins to bloom, much to the dismay of Chung&amp;#039;s lawyer boyfriend, who hired Li in the first place. Made in the last few years before the British province of Hong Kong was returned to the rule of mainland China, The Bodyguard from Beijing makes many (possibly anxious) jokes about the differences between the austere Communist bodyguard and the lackadaisical H.K. police. Li&amp;#039;s character is so consistently stone-faced that his usual boyish charm is repressed, and the movie emphasizes gunplay over acrobatic kung fu action, but there are still kicks galore and the usual Hong Kong combination of spectacular violence and outrageous sentimentality--all captured in stylish, glossy cinematography. And how often do you get to see venetian blinds used as an offensive weapon? \n \nCast: Jet Li Lian-Jie  ||  Christy Chung Lai-Tai  ||  Kent Cheng (Jak Si)  ||  Ngai Sing  ||  Leung Wing Chung  ||  Ng Wai Gwok  ||  William Chu (Wai Lim) \n  &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.331/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.331/qx/details.htm&lt;/a&gt;\n\nP.S.\nSubtitles file for &quot;New Crouching Tiger, Hidden Dragon&quot; available at:\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:aa105c20fe08fcb3a8deb90b73070d7f04296340","amp;dn":"%5BKung+Fu%5D+Bodyguard+From+Beijing+aka+The+Defender+%28Jet+Li%2C+1994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa105c20fe08fcb3a8deb90b73070d7f04296340","infoHashBuffer":{"type":"Buffer","data":[170,16,92,32,254,8,252,179,168,222,185,11,115,7,13,127,4,41,99,64]},"announce":[],"urlList":[]}}