{"title":"Don Harriss - Abacus Moon - New Age 1989","uid":3566393,"size":84394167,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aa48959a4aff3ef0d606e6b268bf9ce4b6b54598&amp;dn=Don+Harriss+-+Abacus+Moon+-+New+Age+1989&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Artemi Pugachov NewAger","files":13,"time":1164704601,"description":"---------------------------------------------------------------------\n                      Don Harriss - Abacus Moon\n---------------------------------------------------------------------\n\nArtist...............: Don Harriss\nAlbum................: Abacus Moon\nGenre................: New Age\nLabel................: Sonic Atmospheres \nSource................ CD\nYear.................: 1989\nRipper...............: NMR\nCodec................: LAME 3.94\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 251kbps)\nChannels.............: Joint Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\nInformation..........: \n\n\nIncluded.............: NFO, MD5, M3U,\n\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. (00:04:26) Don Harriss - Crystal Canyons\n   2. (00:04:13) Don Harriss - Inventions\n   3. (00:04:43) Don Harriss - Cloud 7\n   4. (00:04:14) Don Harriss - Porcelain Sky\n   5. (00:05:22) Don Harriss - The Alchemist\n   6. (00:05:14) Don Harriss - Southern Lights\n   7. (00:05:13) Don Harriss - Sea Of Storms\n   8. (00:04:50) Don Harriss - Escapade\n   9. (00:06:30) Don Harriss - Abacus Moon\n\nPlaying Time.........: 00:44:45\nTotal Size...........: 80.45 MB\n\nNFO generated on.....: 11/9/2006 9:19:57 PM\n\n\n:: Generated by Music NFO Builder v1.19 - www.nfobuilder.com ::\n\nProduced, Composed, Arranged and Performed by Don Harriss\nExecutive Producer, Craig Huxley - Recorded and Mixed by Russell Bond\nDon Harriss - Keyboards\nGary Chase - Synclavier programming\nLuis Conte - Acoustic percussion on Crystal Canyons, Porcelain Sky and Southern Lights.\nPatrick Feehan - Electronic percussion programming on Escapade and Porcelain Sky.\nRecorded August 5th - 18th at: The Enterprise, Burbank, California. Assisted by Fred Kelly Jr.\nPiano recorded at: The Mad Hatter, Los Angeles, California. Produced by Don Harriss and Russell Bond. Assisted by Darren Mora.\nMastered by Chris Bellman at Bernie Grundman Mastering Art direction by Pat O&amp;#039;Connell. Don&amp;#039;s photograph by Robert Fujioka. Cover design by Pat O&amp;#039;Connell.\n\n\n\nALL MUSIC BMI Â©1989 SONIC ATMOSPHERES AND NEW MOTION MUSIC.\nALL RIGHTS RESERVED.\nAbacus Moon was performed using a Bosendorfer Imperial grand piano, a New England Digital Synclavier 9600, Korg M1(2), Yamaha TX802(2), DX7, Roland S-550, Jambox 4+ and Macintosh IIci using software by Mark of the Unicorn, Opcode Systems, and Valley Music Design.\n\nThis album was digitally recorded and mixed using a Mitsubishi X850 and X-86.\n\nSpecial Thanks go to Russell Bond; his creativity goes way bounds of engineering and is much appreciated. Also thanks to Hyman Katz and Bill Clodfelter for their tireless efforts and Craig Huxley for the opportunity to &quot;realize&quot; my music. Continuing thanks to Rob Kelly for his help and faith. Many thanks to my family for enduring the four months of effort and late nights it tool to compose this music.\n\nThis one&amp;#039;s for you, &quot;Pete.&quot;\n\nAll selections (p) &amp;Â© Sonic Atmospheres 1989. All Rights Reserved.\nSonic Atmospheres, 14755 Ventura Blvd., Suite 1776 Sherman Oaks, CA 91403\n\n----------------------------------------------------------------\nWhat the Media is Saying...\n\n \n\n&quot;I remember liking Harriss&amp;#039;s 1989 new age synth release Abacus Moon. His first solo piano CD is a sparkler. The vaguely Chopinesque pieces are tuneful and easy to listen to, Harriss&amp;#039;s keyboard touch is confident, and the production (recorded at Chick Corea&amp;#039;s Mad Hatter studio) is flawless.&quot;\n\n-- Jim Aiken, KEYBOARD Magazine - April 2001\n\n\n\n\n\n&quot;Harriss brings a keen sense of melody and form to his compositions.&quot;\n\n-- Steve Feinstein, KKSF RADIO\n\n\n\n\n\n&quot;Spacious, warm release paints a textured landscape that is by turns soothing...and jaunty. Programmers should find a depth here that exceeds most other releases of the same genre.&quot;\n\n-- NEW AGE PICKS, BILLBOARD MAGAZINE\n\n\n\n\n\n&quot;...he is light-years ahead of most adult contemporary synthesists in his sophisticated use of texture and sound.&quot;\n\n-- Linda Kohanov, ALL-MUSIC GUIDE\n\n\n\n\n\n&quot;Moving adeptly from his rangy repertoire of electronic musics to engaging, impromptu rhythms, Don starts out in the area where Windham Hill&amp;#039;s new electronic music series is heading, climbs up through the pristine Private Music styles that Patrick O&amp;#039;Hearn creates, and flies out brilliantly into some of the floatiest dream clouds we&amp;#039;ve lietened on. Subdued, simple and right on the mark.&quot;\n\n-- HEARTBEATS/BACKROADS\n\n\n\n\n\n&quot;Don Harriss is one of the most innovative new age musicians in the business today, having released five critically acclaimed albums in the past decade. It&amp;#039;s Harriss&amp;#039; combination of acoustic and synthesized instrumentation and his warm, inviting melodies that account for his success.&quot;\n\n-- Mary Lynn McCarrick, JAZZ NOTES\n\n\n\n\n\n&quot;You&amp;#039;d never know that Don Harriss was once a member of rocker Pat Travers&amp;#039; Band from listening to his three solo discs. His recent music is about as far away from rock&amp;#039;n&amp;#039;roll as you can get. The latest, ABACUS MOON, features all the hallmarks of the &quot;Don Harriss sound,&quot; simple melodies with beautiful electronic orchestrations.\n\n\n-- Michael Reading, PAC ATTACKS\n\n\n\n\n\n&quot;I listened to the new Don Harriss album with a degree of apprehension because his first album was so good. I couldn&amp;#039;t believe it was possible. VANISHING POINT is better.&quot;\n\n\n-- John Sebastian, KTWV &quot;THE WAVE (L.A.)&quot;\n\n\n\n\n\n&quot;A beautifully composed and orchestrated album - at once minimal and subdued while being full and richly orchestrated.&quot;\n\n\n-- Brad Balfour, REFLEX MAGAZINE\n\n\n\n\n\n&quot;Harriss uplifts with inner vision and beauty.&quot;\n\n\n-- Lee Underwood, PULSE! MAGAZINE\n\n\n\n\n\n&quot;Here&amp;#039;s your chance to catch a rising star&quot;\n\n\n-- Robert Carlberg, ELECTRONIC MUSICIAN MAGAZINE\n\n\n\n\n\n&quot;Don Harriss&amp;#039;s fourth release, Shell Game, is an unqualified success. At first, it seemed he had made another solid album, blending his familiar style with predictable pop hooks, but nothing earthshaking or monumental. Upon closer examination, however, it became apparent that Harriss had developed his music with true craftsmanship, creating a work of immense depth and listenability. He heads off in several directions on the various pieces, many which explore downright romantic spaces. Some compositions, like &quot;Arabesque,&quot; come at you from a distance, while others, like &quot;White Sand and Thunder&quot; and the title track really pack a punch. Half the pieces benefit from the contributions of other musicians, notably Peter Maunu on guitars and Luis Conte on percussion. Don&amp;#039;s performing background in rock music (with the Pat Travers Band) shows through here and there, but his abilities as crafty composer and arranger and his precise production are evident throughout, making Shell Game a strong contender for anybody&amp;#039;s TOP TEN LIST FOR 1990.&quot;\n-- BACKROADS MUSIC/HEARTBEATS(BACKROADS MUSIC/HEART), ALL-MUSIC GUIDE\n\n\n","torrent":{"xt":"urn:btih:aa48959a4aff3ef0d606e6b268bf9ce4b6b54598","amp;dn":"Don+Harriss+-+Abacus+Moon+-+New+Age+1989","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa48959a4aff3ef0d606e6b268bf9ce4b6b54598","infoHashBuffer":{"type":"Buffer","data":[170,72,149,154,74,255,62,240,214,6,230,178,104,191,156,228,182,181,69,152]},"announce":[],"urlList":[]}}