{"title":"Inpage v2.91 (Uncrack) Crack Me Please!","uid":3552549,"size":19929756,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac487873061dde83d10003bdbdf2523c2d3fc650&amp;dn=Inpage+v2.91+%28Uncrack%29+Crack+Me+Please%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tahiramini","files":1,"time":1162833087,"description":"InPage is an extremely powerful publishing software that handles Urdu, Arabic, Persian, English and other language with level of ease and harmony never achieved before. Built on a robust proprietary state-of-the-art multilingual engine, InPage provides for complete flexibility for utilization of all these language, whether they are used separately, side-by-side or fully-integrated in your document.\n\nBased on the universally acclaimed Noorinastaliq font, InPage offer WYSIWYG display of Urdu in nastaliq script. This enables you to layout your documents accurately, aesthetically and in double quick time.\n\nRunning under MS Windows, InPage makes publishing not only easy but also enjoyable. it is as easy to create a one page design as it is to document a 1000 page book . You may import images of most popular formats into your documents, move them around on the fly, write text and create tables in any orientation and then dress it up with built-in color and other typographic /creative features.\n\nWith InPage, you have finally found the software package that combines the power and flexibility of desktop publishing with the calligraphic beauty of nastaliq script.\n","torrent":{"xt":"urn:btih:ac487873061dde83d10003bdbdf2523c2d3fc650","amp;dn":"Inpage+v2.91+%28Uncrack%29+Crack+Me+Please%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac487873061dde83d10003bdbdf2523c2d3fc650","infoHashBuffer":{"type":"Buffer","data":[172,72,120,115,6,29,222,131,209,0,3,189,189,242,82,60,45,63,198,80]},"announce":[],"urlList":[]}}