{"title":"ITVV Airtours 757 Cockpit DVD","uid":3561597,"size":3664562176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad47a84354ecf8b966e672d3d764d42e3c75449f&amp;dn=ITVV+Airtours+757+Cockpit+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"BoeingMan","files":13,"time":1164094280,"description":"Boeing 757-200\nCaptain Rex Taylor takes you on\na trip from Manchester International\nAirport to Dalaman in Southern Turkey\n\nThis documentary style programme will give you an interesting insight into the flightdeck instrumentation on this fascinating aircraft.\n\nYou will join Captain Rex Taylor aboard this Airtours International Boeing 757-200 for a trip to Dalaman (LTBS) in Southern Turkey. Our trip starts at Manchester International airport (EGCC) where Rex will invite you on to the flightdeck, call-sign Tourjet 179P. Once onboard, follow the flightdeck briefing, watch engine start-up and observe the many procedures necessary to get this flight into the air.\n\nFilmstripFlightdeck Guided Tour\nYou will witness both the take-off and landing from the jump seat, once in the cruise you will also be given a full guided tour of the flightdeck instrumentation including the EADI (Electronic Attitude Director Indicator), EHSI (Electronic Horizontal Situation Indicator), EICAS (Engine Indication and Crew Alerting System).\n\nEICAS System\nRex will also show you how the EICAS system works, including the alert, caution and warning operations. Hear the Air Traffic Control for our flight and follow the checklists as we give you the opportunity to explore this fascinating aircraft. This programme was filmed using four cameras to give you an unparalleled view of take-off and landing, including external shots.\n\nCaptain Rex Taylor\nCaptain Rex Taylor joined Airtours International as a Training Captain on the MD 83 when the airline commenced operations in 1991. Rex transferred to the B767 and B757 when they were introduced to the company in 1994.\n\nOn leaving school at 16, Rex joined Smiths Industries Aviation division as a Mechanical engineering apprentice. After completing his apprenticeship and a Mechanical Engineering Degree, Rex was sponsored by British Airways to learn to fly at Oxford Air Training School.\n\nIn 1979 Rex joined the British Antarctic Survey flying De Havilland Twin Otter aircraft on skis throughout the Antarctic. In 1983 Rex joined Jersey European Airways first as a line pilot and later as Chief Training captain and finally as Chief Pilot, Rex has 12000 flying hours. \n\n\n\n\n\n\n\nThis is my first torrent, I am still learning about all this so if it dosnt work, I apologise, and I will try to resolve it.","torrent":{"xt":"urn:btih:ad47a84354ecf8b966e672d3d764d42e3c75449f","amp;dn":"ITVV+Airtours+757+Cockpit+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad47a84354ecf8b966e672d3d764d42e3c75449f","infoHashBuffer":{"type":"Buffer","data":[173,71,168,67,84,236,248,185,102,230,114,211,215,100,212,46,60,117,68,159]},"announce":[],"urlList":[]}}