{"title":"911 Protests and Preparations 2006 (Avi-Mov-Wmv-Rm Videos+Docs)","uid":3568788,"size":2283510327,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ad6380ca8cd166769351c5b7d24b3bd6274bdf83&amp;dn=911+Protests+and+Preparations+2006+%28Avi-Mov-Wmv-Rm+Videos%2BDocs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"p2P2p","files":41,"time":1165004212,"description":"911 PROTESTS AND PREPARATIONS 2006 (Avi-Mov-Wmv-Rm Video Clips)\n\nA collection of 9-11-2006 protest footage videos along with supporting footage and documents.\n\nInspiring progress and new events within the 911 Truth Movement are happening every day. More people are becoming aware of the mistruths of that fateful day back in 2001 and there continues to be good momentum on this and other issues. This really is the time for the big information push people! \n\nThe time is now... don&amp;#039;t wait... and never, ever stop. Keep your chins up, your minds open and always be ready to speak up for what you believe in. Much work still to do... for those who have risked so much to get us where we are so far - don&amp;#039;t let the work completed go to waste... for those who are only just learning about theses issues - join up the cause and stay in the &quot;good&quot; fight! We will need everyone&amp;#039;s help. Good luck friends... peace be on all of you.\n\nCONTENTS:\n\nVideo\n-----\n5th anniversary of 911 (Jon Gold) 2006.mov\n5th anniversary of 911 (Jon Gold) 2006.wmv\n911 2006 Truth Rally at the CFR Headquarters.avi\n911 2006 What we saw.mov\n911 Protests 2006 - Ground Zero.avi\nAlex Jones at Ground Zero 1 (2006).avi\nAlex Jones at Ground Zero 2 (2006).avi\nAlex Jones at Ground Zero 3 (2006).avi\nHomeland Security Troops yell at Alex Jones in New York (2006).avi\nLoose Change Boys 9-7-2006 - Part 1 of 5.avi\nLoose Change Boys 9-8-2006 - Part 2 of 5.avi\nLoose Change Boys 9-9-2006 - Part 3A of 5.avi\nLoose_Change_Covered_CNN-Zahn (2006).wmv\nSept 11th 2006 LC vs PM - dnB20060911a.rm\nSeptember_11th_Revisited_(2006).wmv \n\nDocuments\n---------\nAnswers to 911 Objections and Questions - Prof. Stephen E. Jones Pres.pdf\nCivilian Inmate Labout Program - r210_35.pdf\nClean_Break_or_Dirty_War_(3-27-2003).pdf\nCoverupGuide911.pdf\nDownard,Hoffman - King-Kill 33 (1998).pdf\nFetzer Press Release.pdf\nFluxite.pdf\nOperation Gladio and Terrorism in Western Europe (2005).pdf\nGlobal_Dominance_Group.pdf\nGovernment Terror Info.pdf\nJournal_2_Evidence_for_demolition_20.pdf\nJournal_3_Complicity_inferences21.pdf\nJournal_4_Jet.pdf\nJournal_5_PTransferRoss.pdf\nLooseChangePullTab flyer handout.jpg\nMolten metal.doc\nNew_enemy_Combatent_act_worse_than_patriot_act_2.pdf\nNorthwoods Flyer handout.jpg\nOfficial 9-11 Commision Report (Toilet paper).pdf\nOmmisions 9-11 Commision Report (just a few of many) .txt\nRebuildingAmericasDefenses.pdf\nVanity-fair-loose-change (attempt at debunking - lol nice try).pdf\nWhy Indeed Did the WTC Buildings Collapse - J6p2.doc\nWTC7 A Short Computation - Kuttler.pdf\n\nEnjoy!\n\nConspiracy Research Uploaders Guild (C.R.U.G)\n &lt;a href=&quot;\nhttp://conspiracyresearch.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyresearch.org&lt;/a&gt; (Forum Wiki Blogs Chat) &lt;a href=&quot;\nhttp://tracker.conspiracyresearch.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.conspiracyresearch.org&lt;/a&gt; (Coming real soon)\nWant to join us? The doors are open &amp; membership is free...\n-----------------------------------------------------------\n\nMORE 911 INFO:\n &lt;a href=&quot;\nhttp://www.911truth.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.911truth.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://nineeleven.co.uk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nineeleven.co.uk&lt;/a&gt;\n\nLOOSE CHANGE 2ND EDITION RECUT *NEW* (1hr29m)\n(With any luck this will hit the cinemas soon)\nView Film Online: http://video.google.com/videoplay?docid=7866929448192753501\nBuy it Online Now: https://www.lc911.com/lc911/home.php\nLoose Change Forum: http://s15.invisionfree.com/Loose_Change_Forum/index.php\nLoose Change Website: http://www.loosechange911.com\n\nTERRORSTORM (SCHOLARS SYMPOSIUM EDITION) (1hr52m)\n(Includes 6 mins of extra footage not in the final release)\nView Film Online: http://video.google.com/videoplay?docid=-5948263607579389947&amp;q\nBuy it Online Now: http://infowars-shop.stores.yahoo.net/teascsyed.html\nAlex Jones Website: http://prisonplanet.com \nMore Information Here: http://infowars.com\n\nLIST OF 911 TRUTH WEBSITES: \n(Copied from: http://www.911truth.org/links.php)\n\n    * 9/11 Petition &amp; Complaint--Justice for 9/11 (2630)\n      Submitted to the offices of New York Attorney General Eliot Spitzer (who has yet to respond), the complaint summarizes the best evidence for reopening 9/11 as a criminal case and examining nodes of complicity within the United States government itself. Sign the petition!\n    * 9-11 Research (5500)\n      9-11 Research focuses on the facts of the 9-11 attack and analysis of the official explanation. With extensive references and a video archive.\n    * 9-11 Review (1984)\n      911Review.com covers historical precedents and context and the use of disinformation. It debunks several common 9/11 skeptics&amp;#039; errors.\n    * 9/11 Reading Room (1786)\n      Consists of news stories and other documents (images, government files) related to the most dire unanswered questions about the terrorist acts of September 11, 2001. Requests contributions from readers.\n    * 9/11 Truther Forum (1933)\n      Forum for 9/11 discussion.\n    * 9/11 Visibility Project (3702)\n      Archive of articles, National Activism, Media Outreach, etc.\n    * 911-News.com (29)\n      Our Mission at 9/11 News is to facilitate the growing 9/11 Truth movement. We seek to provide a growing database of documents, links, media, and a variety of other sources related to the Movement, as well as a weekly podcast that encapsulates recent and major events in the 9/11 Truth Movement. In this way, we hope to be a sign post in the bustling and rapidly evolving 9/11 Truth Community.\n    * 911campusaction.blogspot.com/ (273)\n      9/11 Truth: Campus Action Network is a forum for students who are leading university or college 9/11 truth groups. We are interested in sharing ideas, resources and criticisms to help make our campaigns easier, less costly, more effective, and more fun. If you would like to join, contact adam.parrott at gmail.com\n    * 911Courage.org (472)\n      ESCALATE NOW!\n      Translate Courage into Power with Nonviolent Civil Disobedience.\n      Calling all 911Truth activists who want to make a real and lasting difference.\n      We can set a new record for the most states involved in a coordinated civil disobedience action on the same day.\n      THE MEDIA WILL HAVE TO COVER ITS SCALE AND CONTENT.\n    * 911EnvironmentalAction (195)\n      On television screens the world over, people watched the Twin Towers disintegrate into a fine dust which spread for miles. As the fires burned unabated, New York City residents began to realize that they and the many volunteers who had come to their aid had been exposed to an unprecedented mix of asbestos, fiberglass, lead, mercury, cadmium, dioxins, and hundreds of toxic substances that continue to endanger lives. School parents, residents, safety experts, environmentalists, labor unions, and religious and charitable organizations began to organize to protect themselves and each other, as it became all too obvious that government institutions were misleading or ignoring New Yorkers.\n\n      With the discovery that the federal government had the legal responsibility for investigation and clean up, 9/11 ENVIRONMENTAL ACTION was born. The EPA had abandoned us, hidden the data, and silenced their own ombudsman. We demand a comprehensive remediation of the environmental devastation of our beloved city. Our government must never again fail to take precautionary actions to protect the public health after an environmental disaster. Help in our campaign to make our land a safe place to live!\n    * 911Proof (6604)\n      Proof that 9/11 was an inside job. Excellent site for newcomers.\n    * 911revisited.com (922)\n      David Ray Griffin commented, &quot;Here&amp;#039;s new video, which probably provides the best case yet of this type for the controlled demolition of the WTC.&quot;\n\n      From the website: &quot;When I first set out to make this video it was only going to be so I could show my family &amp; friends the biggest question I have surrounding 9/11. Ever since I decided to upload it, I have been contacted by victims&amp;#039; families, firefighters &amp; police officers (that were there on 9/11), military, doctors, lawyers, engineers, professors, and others thanking me for making it.&quot;\n    * 911ShareTheTruth (3273)\n      Excellent site for educational and visibility resources: DVDs, books, posters, pins, stickers, etc.\n    * 911SpeakOut.org (122)\n      9/11 does not go away. It is with us on a daily basis. It is the emotional rationale for a long litany of radical changes in US policy:\n      * a supposed &quot;War on Terrorism&quot;\n      * actual wars in Iraq and Afghanistan\n      * possible future wars against a supposed &quot;axis of evil&quot;\n      * condoning torture and indefinite detention without any kind of due process\n      * scuttling the Geneva conventions\n      * the sacrifice of civil liberties at home\n\n      If 9/11 &quot;changed everything,&quot; as George W. Bush has said, then it is extremely important that we &quot;get it right.&quot; What really happened that day? The administration made a rush to judgment, immediately destroyed much of the evidence, stamped much of the remaining evidence &quot;Secret,&quot; and implied that critics were &quot;with the terrorists.&quot;\n\n      If all you know is what you have read in the papers or seen on the TV News, you are not fully informed, and you are quite possibly misinformed. We believe you have also been intentionally DIS-informed.\n    * CarolforCongress.org (699)\n      Official website of Carol Brouillet, Green candidate for California&amp;#039;s 14th Congressional District\n    * Center for Research on Globalization (2231)\n      Home of Global Outlook magazine.\n    * Citizens for Legitimate Government: 9/11 Exposition Zone (2920)\n      Long-running annotated archive of 9/11 oddities from one of the original skeptic sites.\n    * Colorado911.info (264)\n      The official narrative of 9/11 is based largely on coincidence &amp; conjecture, much of it based on key assumptions which remain untested. It is a responsible act of citizenship to question this official story. Also check out the resources section for publicity posters, general-purpose handouts, &amp; other useful stuff.\n    * CommunityCurrency.org/9-11 (1594)\n      International Inquiry into 9/11 Phase 1: San Francisco, March 26-28, 2004.\n    * Complete 9/11 Timeline (2663)\n      Complete 9/11 Timelines: the definitive online research tool for 9/11 history.\n    * Deception Dollars (2944)\n      Over three million currently in circulation!\n    * Digital Style Designs (1906)\n      Excellent pdf flyer and signage download page. 911 truth movement graphics, photo albums and video clips. New T-shirt storefront with Jan Hoyer&amp;#039;s original 911 truth artwork.\n    * DigitalStyleCreations.com (251)\n      Connect The Dots 9/11 --\n      Information re. &quot;Behind-the-Scenes: Ground Zero--A Collection of Personal Accounts,&quot; a book by the two men who found the black boxes at the WTC and much more information, as well as &quot;Improbably Collapse,&quot; new film from Michael Berger.\n    * Emergency Truth Convergence (876)\n      Historic convergence and alliance of truth groups, activists, and independent media to expose and counter the government&amp;#039;s lies. Includes extensive multimedia area documenting July, 2005 event.\n    * Family Steering Committee - Unanswered Questions (1690)\n      The 9/11 families who fought for the &quot;independent commission&quot; now ask the questions the commission won&amp;#039;t.\n    * Flight77.info (1223)\n      Documents the ongoing FOIA request process undertaken by one man, for 9/11 Pentagon-related video information.\n    * George Washington&amp;#039;s Blog (10)\n      Intelligent, reasonable 9/11 assessment from George Washington...\n    * Global Outlook magazine (850)\n      Global Outlook magazine, CA Top journal of 9/11 Truth movement\n    * Guns and Butter Archives (790)\n      Includes over 100 archived shows, including many interviews with 9/11 researchers, as well as other topics that help put the pieces together! Bonnie Faulkner&amp;#039;s excellent radio show is heard at 2:30 on Wednesdays, on KPFA 94.1 FM in Berkleley, California.\n    * ImprobableCollapse.com (787)\n      A film that explores the puzzling collapse of the Twin Towers and WTC Building 7.\n\n      Starring Steven Jones, Glenn Corbett, David Ray Griffin James T. Hoffman and Kevin Ryan\n      Also featuring Tucker Carlson, Larry Silverstein, Daniel Hopsicker, Geoffrey Blank, Richard Ben-Veniste, et al. With the music of Andrew Lowe Watson &amp; Immortal Technique\n      USA 2006. Directed by Michael Berger\n      Director of Photography: John Gannon\n      Produced by Connect the Dots LLC\n    * Information Clearing House (123)\n      This website does not suggest that it contains the &quot;truth&quot;. The truth is a combination of all information and all facts relating to a topic. It is therefore unachievable (in my opinion) for anyone to say &quot;I know the truth.&quot;\n\n      If you came to this site in search of &quot;the truth&quot; you will be disappointed. That is also true of CNN, FOX , ABC etc. If you came to gather information you may find it a useful resource.\n\n      Gibran says in the &quot;Prophet&quot; Say not, &quot;I have found the truth,&quot; but rather, &quot;I have found a truth.&quot;\n\n      That brings me to my first point:\n\n      John Adams said &quot;Liberty can not be preserved without general knowledge among people&quot; this statement points to the absolute necessity of an informed citizenry if our nation is to remain a functioning free society.\n\n      This means that each citizen has a civic responsibility to inform himself and share that information with others. The corporate media pumps information into our homes and does a great job of providing the information that our government wants us to know. It has in my opinion become the propaganda arm of government, and a great number of those who call themselves journalists are in fact nothing less than presstitutes.\n\n      Those who wish to inhibit free access to information are in my opinion a great danger to our nation. Why would any adult interfere with the right of fellow citizens to inform themselves?\n\n      There is a war going on for the minds of America, those waging this war are determined to control the American people by taking possession of our minds and by controlling our sources of information.\n\n      Truth is indefinable. Information is unlimited.\n    * INN World Report (1537)\n      Weekly news program with the best TV coverage of 9/11 issues.\n    * International Citizens Inquiry into 9/11 (1320)\n      Phase 2: Toronto, May 25-30, 2004\n    * LonestarIconoclast (46)\n      We in the truth movement frequently share the rallying cry, &quot;Become the Media!&quot; These folks have done just that... at last, a newspaper telling us the real news! Courage on every page. Please, support these truthtellers -- put your money where your mouth is with a Meria Heller Show (987)\n      I&amp;#039;ve had almost every 911 author/researcher on my show. They are all archived for relistening for a modest fee.\n    * MUJCA-NET (1029)\n      MUJCA-NET is a group of scholars, religious leaders and activists dedicated to uniting members of the Jewish, Christian and Islamic faiths in pursuit of 9/11 truth.\n    * New York Megaphone (19)\n      The New York Megaphone The new street-smart tabloid, with a circulation of 66,700 throughout New York City and NY State\n      ? 12 pages, Full color front, back, and centerfold\n      ? Subscriptions at www.shop.voxpopnet.net\n      ? Low-Cost Advertising Rates !\n    * NY 9/11 Truth (2763)\n      Home of the &quot;Vigil for Truth at Ground Zero.&quot; Organizing actions in NYC.\n    * Oklahoma Bombing Investigation Committee (745)\n      The mission of the Oklahoma Bombing Investigation Committee is to find the whole truth about the fatal attack on the Murrah Federal Building on April 19, 1995.\n    * Pentagonresearch.com (582)\n      Thorough, rational review of Pentagon events of 9/11/01.\n    * Peter Dale Scott (949)\n      On War, 9/11, Drugs, Oil, Iraq, Bush, Cheney, Bin Laden, Pakistan&amp;#039;s ISI\n    * Petition to Senate to Investigate 9/11 Oddities (1196)\n      Petition to the Senate to Investigate Oddities Involving 9/11 Terrorist Attacks - has gathered more than 25,000 signatures electronically since 2002.\n    * Project for the Old American Century (82)\n      THE PROJECT FOR THE OLD AMERICAN CENTURY\n\n      This website is a free independent online daily news source that presents and distributes under-reported news items focusing on corporate and government corruption. We make available free of charge all of our archives and do our own research, as well, into conflicts of interest and cronyism.\n\n      The news articles we cover fall into the following categories: government, Iraq, Afghanistan, Central Asia, Haiti, domestic programs, foreign affairs, civil liberties, media, environment, human rights, corporate America, veterans issues, women&amp;#039;s issues, depleted uranium studies, the court system, the economy, militarization, church and state, vote fraud, Israel/Palestinian issues, and the war on drugs.\n\n      Aside from maintaining the website we also make available, free of charge, a daily newsletter that contains all of the days headlines for the site with a few extra commentary and human interest stories thrown in. We also make available a monthly newsletter highlighting the top under reported news stories of the month.\n\n      The Project for the OLD American Century is a grass-roots organization that strives to protect and strengthen democracy primarily by disseminating unreported and underreported news stories from a perspective untainted by political or corporate sponsorship.\n\n      The Project was founded in 2002 in response to a rigged election, reduced civil liberties, a hijacking of our domestic and foreign policies by the energy/defense industries, and a compliant corporate media that refused to make these problems prominent in our national consciousness. We felt it our duty as patriots to create a web-based independent media outlet where we can not only debunk the myth of the liberal media but expose the corruption and cronyism taking place at the highest levels of government and corporate power.\n\n      The Project for the Old American Century conducts its own research and compiles dossiers made available to the public both via the web or in print free of charge. Topics include conflicts of interest inside government agencies, specific profiles of top public officials, data acquired through the Freedom of Information Act, and much more.\n    * rat haus reality: Crimes Against Humanity (1172)\n      The 9-11 bombings Are Not Acts of War - The 9-11 bombings Are Crimes Against Humanity\n    * Rawstory.com (39)\n\n      Our mission:\n      The Raw Story is an alternative news nexus. We draw upon a panoply of news sources and select those stories we think most intriguing to a audience seeking news underplayed by the mainstream media.\n\n      At the core, our goal is to unearth and spotlight stories underplayed by the popular press, in particular those which highlight betterment and open people?s eyes to injustice throughout the world.\n\n      Raw Story Media operates both the The Raw Story and its sister content site, The Blue Lemur\n    * Sept11tortlitigation.com (47)\n      Informational site, documents status of 9/11-related court cases:\n\n      This litigation arises out of the September 11, 2001 terrorist attacks in New York City, Washington, D.C., and Shanksville, Pennsylvania. On July 24, 2002, Judge Alvin K. Hellerstein, United States District Judge for the Southern District of New York, issued an Order that all actions for wrongful death, personal injury, property damage or business loss currently pending or to be filed pursuant to the Air Transportation Safety and System Stabilization Act, Pub.L. No. 107-42 Section 408(b)(3), 49 U.S.C. Section 40101 (2002) against any airline and/or airline security company, be consolidated for purposes of pretrial proceedings. These consolidated proceedings do not include any actions against any alleged hijackers or terrorists.\n\n      In its Order of November 1, 2002, the Court established a master docket for these proceedings: &quot;In Re September 11 Litigation,&quot; 21 MC 97 (AKH). In addition, the Clerk of the Southern District of New York has created a link to the September 11 litigation on the Court?s website at nysd.uscourts.gov/Sept11Litigation.htm, that includes the Court?s Rules of Practice and orders relating to the September 11, 2001 Tort Litigation.\n    * September 11 Victims (1792)\n      The site dedicated to the victims of September 11.\n    * sf911truth.org (1496)\n      Fine flash site from the ever active Bay Area 9/11 Truth Coalition\n    * Spychips.com (519)\n      How major corporations and government plan to track your every move with RFID. And what you should be doing about it!\n    * Summer of Truth (830)\n      NY 9/11 Truth 2005 actions &amp; events and a huge archive of links to stories from 2001-2004 establishing the case for complicity, all on one loooooong page.\n    * Taking Aim (76)\n      Taking Aim with Ralph Schoenman and Mya Shone presents: * Uncompromising, fact intensive exposÃ©s of the hidden workings of a capitalist system addicted to permanent war. . .\n    * The Wisdom Fund (6)\n      The mission of The Wisdom Fund is to advance social justice and interfaith understanding by presenting The Truth About Islam.\n\n     &lt;a href=&quot; http://911sig.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://911sig.blogspot.com/&lt;/a&gt; is the specific link for the 9/11 Special Interest Group:\n\n      If you question the official version of what happened on September 11, 2001, and are attempting to uncover the truth, you belong in the 911 Special Interest Group. &quot;Blog This!&quot; to post news of major events, interviews, professional publications, books, etc. Please be courteous and brief. Sponsored by The Wisdom Fund, this is a moderated blog?posts that do not adhere to these guidelines will not be accepted.\n    * Truth911.net (238)\n      Extensive 9/11 information designed in a way to help people new to the issue find important facts.\n    * TruthMove.org (418)\n      TruthMove is as much about summarizing important information as it is about the theory that progressive intellectuals and activists must be unified around principles that they all share. We realized that all of us are generally invested in discovering important facts, under-reported by mainstream journalists, and presenting them to the public. The environment, the war, surveillance, election fraud, media complicity. social control. There is a rational crossroads between all these concerns where we find that what really matters is that the public learn to care about the fact that they don&amp;#039;t know the truth. Motivated by that concern, TruthMove will remind everyone that getting people to think for themselves is more imporant than telling them what to think. As much as we are focused on a popular, accessible approach, making the website a curriculum of sorts, we also hope to remind progressive intellectuals what they all have in common. The truth.\n    * Tyranny Alert (502)\n      Excellent downloadable booklet called &quot;The Fairy Tale from Hell.&quot; Also link to many videos available.\n    * WantToKnow.info (864)\n      This website provides a concise, reliable introduction to vital information of which few are aware. We specialize in providing fact-filled news articles and summaries of major cover-ups which impact our lives and our world. All information is taken from the most reliable sources available\n    * Watchdog: 9/11 Citizens Watch (3442)\n      Monitored the Kean Commission and now tracks other 9/11 developments in DC. Daily Newswire.\n    * WhoKilledJohnO&amp;#039;Neill? (211)\n      One Actor, One Room, Seven Characters: 9/11.\n\n      Traumatized by the September 11th attacks, one man struggles to dismantle official history, at the expense of his sanity and even his life. Grappling with multiple realities - and multiple personalities - he must retreat into his mind in pursuit of the truth. In a fictional film about non-fictional events, there is a place where belief and faith will blind you, where nothing is sacred, and to get there all you have to do is ask:\n      &quot;Who Killed John O&amp;#039;Neill?&quot;\n\n      a dead art film by ty rauber and ryan thurston\n    * Why Indeed Did the WTC Buildings Completely Collapse? (355)\n      Dr. Steven E. Jones, BYU Professor of Physics &amp; Astronomy. This is a direct link to the paper, with updates, including photographs and textual changes as posted by Dr. Jones, peer review/comments, and associated information.\n    * WTC Environmental Organization (685)\n      WTC Environmental Organization, suing EPA for post-9/11 pollution cover-up, lies\n    * wtc7.Net (3409)\n      Wtc7.net focuses on the near-free-fall collapse of World Trade Center 7, which suffered only small fires and no airliner impact.\n    * www.911files.net (193)\n      Website offering high-resolution downloadable 9/11 videos. More videos to be added.\n\nEVEN MORE TRUTH WEBSITES:\n\n    * 9-11 Photo Gallery (3323)\n      Over 1000 Images Archived of people and places and items involved in the 9-11 tragedy. Images from WTC towers, Pentagon attack, suspects.. (Including Bush and PNAC), along with FEMA camps and other conspiracy theory subjects. A good reference point for web-designers and researchers alike. FREE to access. FREE to use, images sourced from Public domain.\n    * 9-11-2001 George A LLanes (813)\n      Since my stepson George was murdered on 9-11-2001 and the crime still goes unsolved, I have devoted much energy looking onto this. This is a dedication and my way to investigate his murder.\n    * 9-11.meetup.com (181)\n      Grassroots groups around the world talking about 9/11 questions. Join a group or start your own.\n    * 911 Investigations (1750)\n      France-based 1000+ Document Archive on 9/11 and the &quot;War on Terror&quot; - useful searchable research resources\n    * 911 Stand Down/All Fall Down by William Thomas (1121)\n      We provide books and audio cd&amp;#039;s on 911.We also provide articles on all types of topics. William Thomas appears on radio discussing 911\n    * 911 Truth Seekers (765)\n      911 Truth Seekers was formed by a group of Utahns who are concerned that our Government is lying regarding the &quot;official story&quot; of 9-11. We are organizing events such as screenings of documentary videos like &quot;Loose Change&quot; and &quot;Martial Law 9/11: Rise Of The Police State.&quot; We are also working to spread the truth via informational pamphlets, free-DVD&amp;#039;s, and by supporting lectures from Professor Steven E. Jones and others who are speaking out about the questionable events of September 11th, 2001.\n    * 911Eyewitness (471)\n      In memory of all those who perished... In tribute to all those who were injured... This program was made by Patriots, for Patriots.\n    * 911injured.org (358)\n      DEDICATED TO BRINGING ALL NEWS, INFORMATION &amp; RESOURCES FOR THOSE UNFORTUNATELY INJURED ON 9/11 IN NEW YORK, WASHINGTON &amp; SHANKSVILLE. News, resources, information &amp; opinion.\n    * 911Inquiry (376)\n      S.I.F.T. -- Skeptics Inquiry For Truth\n    * 911lies.org (252)\n      I merely bring the public to the information that is developed from professionals in their respective fields. Validate, separate and present valid information that is easy to find from search engine requests. I focus as much as possible on the scientific inaccuracies related to the official story of &amp;#039;911&amp;#039;.\n      If you are to frightened to believe your own government could do this, think of how terrifying it would be if you allowed them to get away with it. Find the courage and concern to take the time to at least examine all the factual information and make a decision. If you choose to believe &amp;#039;whatever happened was probably for the best&amp;#039;, then you have failed your country and the ideology on which it was based.\n      You are choosing to relinquish 230 years of American Democracy based on fear, denial, or misplaced political party affiliation loyalty.\n    * 911truth-tucson.org (83)\n      911 Truth In Tucson, Arizona\n      Serious Questions About The Official Story:\n      There are many aspects of the official version of the attacks in New York and Washington, DC on September 11, 2001 that are inconsistent with the huge variety of evidence collected on that day.\n      The most disconcerting inconsistencies are these:\n      Many aspects of the official story are inconsistent with the laws of physics.\n      Many highly qualified, independent experts disagree with the official story.\n      Many eyewitness accounts directly contradict the official story.\n      Much of the physical evidence does not fit the official story.\n      Visual and audio recordings of the events contradict the official story.\n    * 911truthaz.org (85)\n      Our mission is to investigate and publicly expose the lies about the events of 9/11/2001, through education, media attention, and outreach.\n      We support the overall goals and nonviolent methods of the National 9/11 Truth movement. Further details can be found at 911truth.org.\n      Although we encourage our members to seek the truth wherever they can find it, our highest endorsement goes to the Scholars for 9/11Truth (st911.org), where facts are peer reviewed for credibility.\n    * 911TruthEmergence (716)\n      .\n    * Abuse-Of-Power.org (181)\n      Various 9/11 documentaries here and documentaries on a few other subjects also to help spread the good work. I have made the New York Citizens&amp;#039; Commission on 9/11 September 9th 2004 that 911truth.org co-sponsored viewable via streaming video\n    * America In Distress (885)\n      Many links to uncover 9-11, video archives, audio archives, tons of links, and resources so you can seek your own answers.\n    * American-Freedom.org (74)\n      This website is owned by the people for the people of the United States of America for the purpose of maintaining freedom for the people.\n    * Anarchist Pariah (432)\n      This is a revolutionist run and populated grassroots group looking to tell the truth and enact a radical change in our present government.\n    * Conspiracy Videos (2353)\n      Excellent Site to research many topics including 911, 100&amp;#039;s of streaming videos, everything is free.\n    * Critical Analysis: 9/11 (444)\n      Website announcing upcoming event: A Denver, Colorado MAJOR EVENT is coming to town Friday March 31, 2006, 7pm-10:30pm with expert speakers from around the country presenting a multi-media experience which will be both entertaining but also highly disturbing to the status quo! Jim Hoffman of 911research.com will be on hand to present only the most compelling material regarding the day&amp;#039;s events. Professor Emeritus Morgan Reynolds, chief economist until 2003 for the Bush administration and expert in criminal justice will enumerate the body of evidence which demands indictments be made in courts of law, and a real criminal prosecution be carried out, for there to be justice.\n    * David Ray Griffin Discussion List (56)\n      Description\n      For discussion of the work of David Ray Griffin.\n\n      &quot;Still another reason for me, as a Christian theologian, to speak out is that Christianity began as anti-imperial movement; there can be no greater distortion of the original Christian message than the use of Christianity to support imperialism.&quot;\n\n      &quot;Accordingly, when I came to the conclusion that the Bush-Cheney administration orchestrated 9/11 in order to promote this empire under the pretext of the so-called war on terror, I decided that I needed to say so by means of summarizing the evidence for this conclusion&quot; (p. vii-viii, Christian Faith and the Truth Behind 9/11).\n    * DC911truth.org (98)\n      Website of the Washington DC 9/11 Truth Movement.\n    * Documentaries.ws (181)\n      Documentary Streaming Audio and Video regarding 9/11 and more\n    * Explosive911Analysis.com (685)\n      Aidan Monaghan, an associate member of Scholars for 9/11 Truth, has recently launched his website at explosive911analysis.com.\n    * FearorLove.com (226)\n      Once acknowledged and exposed, it is time to stop rehearsing and merely resisting the negative, and begin focusing on and imagining the positive. Now is the time to join others in a great awakening out of the dominance of darkness and the clutches of the New World Order, and into the Light of a new paradigm that can ? and will - transform our world!\n    * FREE PRESS INTERNATIONAL (1707)\n      Brave New World News\n    * From the Wilderness (2534)\n      Website and newsletter of Michael C. Ruppert.\n    * Global Conspiracy Videos (353)\n      Your supply for the truth videos people have been talking about Since always, society has deemed those who believe in conspiracy theories as crazy. I know this because I am one of those ?crazy? conspiracy type people. Whether it is about the 9-11 cover-ups or the existence of a secret government, the vast majority of people could not comprehend how such conspiracies could exist. The time has finally come where these topics are not ?crazy? but actual issues that need to be taking care of. The destiny of our planet will be determined by our generation. As I see it, we (the human race) have two choices: The first choice is to continue living in ignorance and ride this planet and civilization into the ground. The second choice is to become an educated global citizenry by watching the Global Conspiracy Videos with an open mind and sharing the Global Conspiracy Videos with friends and family. Should option one seem the more appealing of the two, than this website is obviously not for you and you may be better served by getting back to your Britney Spears/Brangelina blogs. However, if you are starting to hear people talking about 9-11 truth, the illuminati, the shadow government, new world order, hidden technology, and this staged war on terror then browse this site and find out what all the fuss is about. The truths contained on these videos must become common knowledge in order for our human race to bring about the necessary changes to maintain a healthy existence on this planet. Tell your friends about Global Conspiracy Videos and have fun browsing.\n    * INFOWARS (2221)\n      Daily radio interviews about 911 with related newswire links, archives and 911 videos. Site of The Alex Jones Show.\n    * judgeforyourself.com/ (997)\n      John Judge&amp;#039;s comprehensive truth site.\n    * Killtown (874)\n      Questioning 9/11...\n    * Knowledge Driven Revolution (837)\n      I am the assistant webmaster for a site known as Knowledge Driven Revolution. We are a new site and could use some help with exposure. Our goal is similar to yours in that we want to expose the truth behind many of the current news topics. Although not as in depth as 911 Truth.org, it covers many topics over a broad spectrum. Please have a look. Suggestions are greatly appreciated and, with your permission, we would be glad to link 911truth.org to our website. Thank you\n    * LibertyDollar.org (318)\n      Stop Being Ripped Off by the Rigged Money System. Discover How You Can Protect Your Money While You Make Money, Do Good, And Have Fun With the Liberty Dollar\n    * LoneLantern.org (190)\n      &quot;Place one lantern in the tower and set forth the riders, for they are on our soil. Paul Revere rode at the sight of two lanterns in the Old North Church. He rode his horse and announced, &quot;The British are coming... the British are coming...&quot; Now, decades later enemies of our country are here, and have been, for quite some time. So we are placing a lone lantern in the virtual tower and dispatching the riders to sound the alarm, and expose the new enemies of our great republic.&quot; -- Gary S. Franchi Jr., founder, Lone Lantern Society, 2004\n    * Loose Change (1175)\n      Documentary that questions the official 9/11 story.\n    * Love and Rage on the 9/11 Trail (865)\n      Nick Levis&amp;#039; 9/11 blog.\n    * Lovinrevolution.org (103)\n      Website by Joe Carr, dedicated to the overthrow of US-led global capitalist oppression. &quot;The true revolutionary is guided by a great feeling of love&quot; -Che Guevara &quot;Resistance to Empire, the latest CD by amazingly talented and committed Joe Carr, is a daily &amp;#039;must-listen&amp;#039; for all of us... powerful encouragement to keep up the fight&quot;... Janice Matthews\n    * mime11.com (211)\n      mime11.com : 911 Truth Caught on Film `The Shortcut Video Intro for 911 noobs.&amp;#039; (You need the Flash 8 plugin to view this site.)\n    * mindjustice.org (56)\n      A human rights group working for the rights and protections of mental integrity and freedom from new technologies and weapons which target the mind and nervous system.\n    * Oil Empire - election coups, 9/11, fascism, World War IV, media, Peak Oil (1473)\n      &quot;Oil Empire is by far the best resource for discriminating among the various 9/11 sites, seeking the genuine and avoiding the bogus.&quot; -- Jamey Hecht, Assistant Managing Editor, From the Wilderness\n    * Operation 9/11 (987)\n      Digging deeper into the events of 911. Discovering what really happend, how the operation was carried out, who stands to gain and what it means for freedom.\n    * PeopleFor911Justice.com (459)\n      This site aims to bring people together to put pressure on our government and media to tell us the truth about 9/11. There are too many unanswered questions that need answering. The 9/11 investigation must be re-opened and pursued to the publics satisfaction. Please join us in our cause of truth. Together we will hold those responsible accountable for their actions!\n    * peopleforahealthyplanet.org (91)\n      Welcome to People for a Healthy Planet- the site with lots of cool info and action alerts on issues that really matter. Some of the issues you&amp;#039;ll find covered here are: those that affect health and health freedom, social justice issues, workers&amp;#039; rights, and environmental issues. Our campaigns encourage grassroots citizen action on important legislation. People for a Healthy Planet wishes to foster peace and positive change in the world. We welcome your involvement and feedback.\n    * Piercing the Fog of 9-11 (2377)\n      Irrefutable proof that 9-11 was an inside job\n    * Piercing the FOG with pictures (908)\n      The Imilac research file with added diagrams and images. New research items and a wealth of 9-11 research links.\n    * Plum Dreams Media (174)\n      Using dream guidance to uncover 9/11 and other political truths, for social change, and to shape political action on a global level.\n    * Questioning 9/11 (61)\n      Do YOU know what happened on 9/11? Perfect information for newcomers!\n    * RICO Suit against George Bush, et al. (1844)\n      William Rodriguez files RICO Act lawsuit against the Bush Administration\n    * RINF.COM: Underground Gateway (654)\n      Daily alternative and underground news and multimedia. Specific 9/11 sections dedicated to exposing the government and media lies of 9/11.\n    * Scholars for 9/11 Truth (999)\n      An influential group of prominent experts and scholars have joined together alleging that senior government officials have covered up crucial facts about what really happened on 9/11. The members of this new non-partisan association, &quot;Scholars for 9/11 Truth&quot; (S9/11T), are convinced their research proves the current administration has been dishonest with the nation about events in New York and Washington, D.C.\n    * sd911truth.org (84)\n      San Diegans For 9/11 Truth is a new activist group dedicated to exposing the rogue network within the government which was responsible for planning and executing 9/11.\n    * Strait Gate Ministries (3)\n      Project Strait Gate is an action program started by We Hold These Truths to focus on one of the primary causes of serial wars.\n\n      The inability or unwillingness of some Christian church leaders to act out their God ordained mandate to be peacemakers makes them facilitators for those who make war. The element among us that always opt for conflict as a political mechanism for power is using church leaders to keep serial wars aflame.\n\n      Project Strait Gate takes education directly to the congregation of the church. Learn how you can start your own easy to carry out and effective project with a minimum of time and money. An information package and all needed hand-outs are available. You need only a few banners and signs, and we can show you what to print on them.\n\n      There are few physical limits, only mental ones. Among the first participants were paraplegic in a wheel chair and a 83 year old naturalized American. We have found that as few as three can carry out an effective project at a large church.\n\n      National, celebrity Christians will soon be visited. But first why don?t you start with your neighborhood churches?\n\n      Toward the strait gate (Matthew 7:13)\n    * The 9/11 Conspiracy: What&amp;#039;s Our Government Hiding? (474)\n      A new community on Live Journal I began on March 31st, 2006 to discuss the 9/11 cover-up.\n    * The Effective Citizen (610)\n      Deciphering and virtually decrypting the news, and presenting it in a &amp;#039;plain words&amp;#039; sense.\n    * The Management School of Restorative Business (220)\n      The Management School of Restorative Business (MSRB) is a non-profit organization that specializes in restorative and ecologically sustainable business management working toward a sustainable, just and equitable world.\n    * The Real 911 (452)\n      Why does the twin towers layout resemble the giza plateau? Why does the footprint of WTC7 match the constellation Orion? Why does the ratio of heights between the Wash. monument and the statue of liberty match that of the WTC and the SOL? whne you accept 911 as an inside job, you&amp;#039;re ready for the next step: The Real 911.\n    * The Unofficial 9/11 FAQ (75)\n      This is a site I recently made. It&amp;#039;s basic due to the bandwidth restrictions on free web servers. It contains many frequently asked questions, and the best answers I could determine. This site isn&amp;#039;t to know the truth, but to try and help the reader learn about the core 9/11 info without too many distracting images/reports/articles.\n    * Timeisup.org (307)\n      &quot;Sometimes the message is more than the words on the sign.&quot;\n    * TruthStream (1156)\n      Streaming the TRUTH to the American People - Streaming Video of Government Corruption and Coverups\n    * US Conspiracy 9-11 (120)\n      Dedicated to spreading the truth of 9-11.\n    * Veterans For 911 Truth (290)\n      In pursuit of our mission we have initially chosen to present evidence exposing the deception and lies that many in the military/intelligence/industrial/media establishment have been telling Americans and the world since September 11, 2001 concerning the events of that tragic day. Our mission includes seeking, discovering, and presenting evidence revealing the truth about the events of 9/11.\n    * Voices of Dissent (1088)\n      Award-winning 42 minute documentary &amp; activist tool on authentic patriotism and protecting First Amendment rights from the Bush administration&amp;#039;s attempt to discredit dissent and limit free speech. See the 8-minute trailer.\n    * waitingforthestorm.com (239)\n      Beautiful music... informative articles... hope for change.\n\n      Belief is the most powerful element of culture. It is our beliefs that guide, define, and justify our actions, and it is belief that could very well be our undoing. Though it may be a point of contention for some, to me it seems very clear that we as humans are headed full speed towards disaster. If it is our beliefs that set our course as a society, and if our present course leads to imminent destruction, the logical solution is to change the beliefs of our culture. How on earth would we go about doing such a thing if we were so inclined? (Keeping in mind that the vast majority of the population are in no way interested). . .\n    * warisforsuckers.com (128)\n      VIDEO satire &amp; ripping it site, important and horrifyingly hilarious...it says things that rarely appear anywhere else, and it&amp;#039;s all video. Check the daily updated listing of new videos!\n    * Xymphora Blog (2742)\n      Formerly, an excellent 9/11 skeptics blog. Now under review due to abrupt about-face!\n    * Youth for 9/11 Truth (144)\n      Welcome to the official website of Youth for 9/11 Truth. We are a non-partisan organization consisting of young people who are questioning the official story of the attacks on September 11th, 2001.\nThe members of this organization have researched the events of the 9/11 attacks, and agree that the government is hiding information and ultimately the truth of what happened that day.\nThis organization was founded by Ethan Stroschein, webmaster and editor of The 9/11 Files, who has researched and has came to the conclusion that the United States government not only let the attacks happen, they made it happen.\n\nGet off your butts and DO something... ;)","torrent":{"xt":"urn:btih:ad6380ca8cd166769351c5b7d24b3bd6274bdf83","amp;dn":"911+Protests+and+Preparations+2006+%28Avi-Mov-Wmv-Rm+Videos%2BDocs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad6380ca8cd166769351c5b7d24b3bd6274bdf83","infoHashBuffer":{"type":"Buffer","data":[173,99,128,202,140,209,102,118,147,81,197,183,210,75,59,214,39,75,223,131]},"announce":[],"urlList":[]}}