{"title":"The Simpsons Season 18 Episodes 1-4 by deathmule","uid":3551607,"size":918073344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ae2b58915f941e24d8e0f85bf770f61a7defde9e&amp;dn=The+Simpsons+Season+18+Episodes+1-4+by+deathmule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"deathmule","files":7,"time":1162702890,"description":"\\&quot;The Mook, The Chef, The Wife and Her Homer\\&quot;\n1801 F78888 SI-1715\nOriginal Airdate: 09/10/06\nThe Simpson family is introduced to Fat Tony\\&amp;#039;s son, Michael, while carpooling and Lisa quickly befriends the quiet boy after all of the other kids avoid him. As a sign of gratitude, Fat Tony has the Simpsons over for dinner and is shockingly gunned down by a rival family moments after Michael tells his father that he would rather be a chef than take over the family business. After Michael turns down the gang?s offer to be the new kingpin, Homer steps up and leads his family on a mob spree. Michael can?t bear to see what the Simpsons have become and invites the rival family over for a surrender dinner where he poisons the food and returns power to his family.\n \n\n \\&quot;Jazzy and the Pussycats\\&quot;\n1802 F78888 SI-1718\nOriginal Airdate: 09/17/06\nAfter an outburst at the funeral for Homer\\&amp;#039;s dead Vegas wife, Marge takes Bart to a shrink who prescribes playing the drums over Ritalin. Bart quickly upstages Lisa at a jazz jam and is recruited into a respected trio. A dejected Lisa turns her back on music and pours her heart into rescuing animals from the local pound. Lisa is able to keep her menagerie a secret until a pet tiger attacks her brother. Bart organizes a benefit concert to have his mangled drumming arm operation but has a last minute change of heart and donates the proceeds to an animal shelter in his sister\\&amp;#039;s name.\n \n\n \\&quot;Please Homer Don\\&amp;#039;t Hammer \\&amp;#039;Em\\&quot;\n1803 F80147 SI-1720\nOriginal Airdate: 09/24/06\nMarge discovers her gift for carpentry but has to use Homer as a front in order to overcome people?s predisposed prejudices against women builders. Even though he is completely inept, Homer takes credit for all of Marge?s work which causes her to abandon him just before he lands a job rebuilding a historic Springfield rollercoaster. When Homer?s life is in danger while taking the rebuilt coaster?s maiden voyage, Marge arrives and the couple works out their differences just before the Homer careens off the coaster. Meanwhile, Bart uses Skinner?s peanut allergy to force the Principal to do his bidding.\n \n\n\\&quot;Halloween Special XVII\\&quot;\nS18E04\nOriginal Airdate: 10/05/06","torrent":{"xt":"urn:btih:ae2b58915f941e24d8e0f85bf770f61a7defde9e","amp;dn":"The+Simpsons+Season+18+Episodes+1-4+by+deathmule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae2b58915f941e24d8e0f85bf770f61a7defde9e","infoHashBuffer":{"type":"Buffer","data":[174,43,88,145,95,148,30,36,216,224,248,91,247,112,246,26,125,239,222,158]},"announce":[],"urlList":[]}}