{"title":"Deu a Louca na Cinderela (Happily N'Ever After) 2007 DVDR","uid":3964140,"size":730401135,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aea7a03eacf0c36a449df5963d7013c0a2885183&amp;dn=Deu+a+Louca+na+Cinderela+%28Happily+N%5C%27Ever+After%29+2007+DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bozano","files":3,"time":1199634770,"description":"  Como esta tudo programado no mundo dos contos de fada para que haja um final feliz, o Mago (George Carlin), responsavel pelo equilibrio entre as forcas do bem e do mal, decide sair em ferias. Ele deixa seus assistentes, Mambo (Andy Dick) e Manco (Wallace Shawn), cuidando de tudo. Porem um erro faz com que Frieda (Sigourney Weaver), a madrasta da Cinderela, tenha a posse do cajado magico. Seu objetivo e tomar o controle do mundo de contos de fada, fazendo com que os viloes vencam e que os finais das historias jamais sejam felizes novamente. Isto faz com que Cinderela (Sarah Michelle Gellar), mais conhecida como Ella entre os amigos, tenha que encontrar um meio de deter Frieda, contando com a ajuda de Rick (Freddie Prinze Jr.), Manco, Mambo e um exercito composto de fadas e anoes. \n\n\nAs the story begins, an alliance of evil fairy tale-doers, led by Frieda, looks to take over Fairy Tale Land and take control of. But when Ella A.K.A. Cinderella realizes her own evil stepmother is out to ruin her storybook existence, she takes a dramatic turn and blossoms into the leader of the resistance effort.\n\nEnjoy... :)","torrent":{"xt":"urn:btih:aea7a03eacf0c36a449df5963d7013c0a2885183","amp;dn":"Deu+a+Louca+na+Cinderela+%28Happily+N%5C%27Ever+After%29+2007+DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aea7a03eacf0c36a449df5963d7013c0a2885183","infoHashBuffer":{"type":"Buffer","data":[174,167,160,62,172,240,195,106,68,157,245,150,61,112,19,192,162,136,81,131]},"announce":[],"urlList":[]}}