{"title":"MediaChance.Multimedia.Builder.v4.9.8.7","uid":3860065,"size":28868303,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:afccc465610fd8d371a40a75b89ed8373c39f4e3&amp;dn=MediaChance.Multimedia.Builder.v4.9.8.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Data-Fjotten","files":5,"time":1193429517,"description":"MediaChance Multimedia Builder v4.9.8.7\n\nNEW! 10/19/07 \n\nWindows-based multimedia authoring system allows you to create autorun CD menus, Multimedia Applications on CD-ROM, Demos, Presentations, MP3 players and much, much more.\n\n-- Easy to learn, Non-expensive Multimedia Authoring Software\nWith MMB you can develop autorun menus, multimedia apps, or front-ends for your CD&amp;#039;s* without having to spend months learning complex programming languages.\n\n-- Make an autorun for your CD-ROM or DVD*\nIf you are already distributing software on CD-ROM or DVD, creating your own CD-Audio or making your MP3 CD you will love this easy-to-use, intuitive software.\n\n-- Fast Multimedia applications in minutes !\nCreate multimedia applications with graphic, text, sounds, MP3 ,Video, supporting CD Audio or Mixed-mode CD&amp;#039;s, executing applications and much more...\nApply many cool effects to your images.\n\n-- MMB has many great features...\nMMB creates small stand-alone exe applications and has many bells &amp; whistles you will ever need.\nCreate a cool looking app or small game and send it to all your friends\n\n*To create a CD you need of course a CD writer and a software for recording CD&amp;#039;s . The same apply for DVD-R. MMB doesn&amp;#039;t burn CD&amp;#039;s or DVD&amp;#039;s.\n\n\n\nProfessionals use it as well\nMany large companies realized that using MMB is much easier and faster for building their autorun presentations and menus than their in-house solution.\n\nYou may already have seen some of them in action:\n\n:: Corel Corporation uses autorun menu created in MMB on some of their recent products (for example WordPerfect Office 2002, etc.)\n:: 3DFX uses MMB for their installation CD&amp;#039;s for Voodoo graphic cards (also with some easter-eggs)\n:: BMG Entertainment uses whole presentations made in MMB on some of their PC enhanced audio CD&amp;#039;s\n:: and more...\n\nWith MMB you can create\n\n:: Autorun CD browsers (menus) for corporate CD-ROM&amp;#039;s.\n:: Tutorials\n:: Cue Cards\n:: Kiosks\n:: CD Audio and Mixed-mode CD Audio Players\n:: MP3 Players\n:: Front-end for your corporate or personal CD&amp;#039;s\n:: File launchers and toolbar\n:: Computer based training\n\nNEW!\n10/19/07 Final MMB 4.9.8 is available for download!\nThe major new features are runtime object creation, loading scripts form external files and calling MMB script functions from plugins! Feel free to visit MMB online help to learn more about this new version.\n\nWhat&amp;#039;s new in MMB? \n\n- There are many new features and improvements. Most notably:\n- We have included now over 150 examples in Sample folder!\n- There are many new examples such as fully functional clock, flash, html or mouse samples. \n- Video Object is now based on DirectShow \n- Zoom Tool \n- More script commands \n- Full new multichannel audio support with many new formats (OGG, WMA, ASF, XM, S3M, IT...) \n- Integrated macromedia Flash object - you can control MMB script from Macromedia FLASH! \n- List Box object \n- Audio Visualization object - you want it you have it -oscilloscope and equalizer. \n- You can now fully personalize the File version information in the compiled file. \n- For more info about new version, please visit the What&amp;#039;s New page in MMB Help.\n\n\nHomepage","torrent":{"xt":"urn:btih:afccc465610fd8d371a40a75b89ed8373c39f4e3","amp;dn":"MediaChance.Multimedia.Builder.v4.9.8.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afccc465610fd8d371a40a75b89ed8373c39f4e3","infoHashBuffer":{"type":"Buffer","data":[175,204,196,101,97,15,216,211,113,164,10,117,184,158,216,55,60,57,244,227]},"announce":[],"urlList":[]}}