{"title":"housewife49.avi","uid":3698992,"size":731755966,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1311dc7aea6630f13b7a5833362bc6d96f08940&amp;dn=housewife49.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"edwincluck","files":1,"time":1180316723,"description":"Award winning writer and performer Victoria Wood (Dinnerladies, Acorn Antiques, Pat and Margaret) has written and stars in her first ITV drama for 25 years set in a wartime northern English town.\n\nHousewife, 49 is based on the real diary of a Lancashire housewife and follows Nella Last\\&amp;#039;s struggles to recover from a nervous breakdown, a difficult marriage and the realisation that her two sons are now grown up and no longer need her.\n\nNella joins the local Women\\&amp;#039;s Voluntary Service, run by Mrs Waite (Stephanie Cole - Doc Martin, Back Home, Tenko) and Mrs Lord (Marcia Warren - The All Together, Murder In Suburbia,) and the companionship and sense of purpose she finds there gives her the joy and energy that is missing from her difficult marriage.\n\nAs her relationship with her husband goes through painful changes, Barrow suffers its own blitz and Nella, happily ensconced with her WVS chums.\n\nNella realises war is not the stuff of newsreels, there are no heroics, no Vera Lynn. It\\&amp;#039;s about a woman in her kitchen scribbling on bits of paper with a stubby pencil, trying to find the courage to face up to what she really is.","torrent":{"xt":"urn:btih:b1311dc7aea6630f13b7a5833362bc6d96f08940","amp;dn":"housewife49.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1311dc7aea6630f13b7a5833362bc6d96f08940","infoHashBuffer":{"type":"Buffer","data":[177,49,29,199,174,166,99,15,19,183,165,131,51,98,188,109,150,240,137,64]},"announce":[],"urlList":[]}}