{"title":"Rapid PHP 2006 Full","uid":3567572,"size":4943876,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b21bbddfe4594357c10f197ce3fee4d2246495b4&amp;dn=Rapid+PHP+2006+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cfx65","files":2,"time":1164848096,"description":"Rapid PHP Editor - fast PHP, HTML, CSS, JavaScript editor\n\nRapid PHP editor is powerful, quick and sophisticated PHP editor that extends far beyond the essentials of regular PHP editing environments. Convenient features enable you to instantly create and edit not only PHP, but also HTML, XHTML, CSS and JavaScript code, while integrated tools allow you to easily validate, reuse, navigate and format your code. Whether you are a professional developer or pure enthusiast, with Rapid PHP editor you can get your job done faster, save time and increase productivity. \n\nRapid PHP Editor is the world&amp;#039;s only PHP editor that includes full-scale HTML, CSS and JavaScript editors. Now you can accomplish more with a single tool.\n\nKey Features and Benefits \n\nSpeed - loads very quickly \nSophisticated, fully customizable and familiar text editor \nSyntax highlighting for PHP, HTML, CSS, JavaScript, WML, XML and SQL \nUTF-8 Unicode Support  \nEasily navigate your code with Code Explorer  \nLookup PHP function parameters with Function Hints  \nLookup functions and variables with Auto Complete \nValidate PHP code with Syntax Check  \nIntegration with PHP, HTML and CSS documentation \nSave and open files directly from FTP  \nProject management and FTP publishing \nSQL database connectivity (MySQL, PostgreSQL, Firebird, Interbase)  \nMatching bracket highlighting \nSearch and Replace with Regular Expression Support \nSearch and Replace in files \nSpell Checker for text in HTML code and TXT files \nMulti Item Clipboard \nCode snippet library  \nReady to use Code Templates \nAdvanced HTML editing with Auto Complete, Inspector and other tools \nAdvanced CSS editing with built-in CSS editor  \nAdvanced JavaScript editing with built-in JavaScript editor  \nCountless goodies (code collapse, line highlighting, text indentation etc.)","torrent":{"xt":"urn:btih:b21bbddfe4594357c10f197ce3fee4d2246495b4","amp;dn":"Rapid+PHP+2006+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b21bbddfe4594357c10f197ce3fee4d2246495b4","infoHashBuffer":{"type":"Buffer","data":[178,27,189,223,228,89,67,87,193,15,25,124,227,254,228,210,36,100,149,180]},"announce":[],"urlList":[]}}