{"title":"Hooligans at Play 2 (2006)","uid":3693647,"size":891287552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b26486e0a4bd2023e4a17ae0112f4a960b6fe110&amp;dn=Hooligans+at+Play+2+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hwndjr","files":1,"time":1179780225,"description":" Hooligans at Play made by Tom Fuller was the most succesful documentary about the european hooliganfirms ever made. No question that they have to come part 2. Only CCTV and private footage was used. No scenes from TV stations like other projects did. 99% of material that had never been showed before about the violent acts of hooligans. Exclusive material from the following countries: England, Austria, germany and poland ? very rare stuff.\n  Hooligans at Play 2 is showing mostly scenes from the english lads of the firms from Leeds, Cardiff, Huddersfield, Wrexham, Stoke, Oldham and dozens of other scenes are in the focus of this project.\n  A nonstop documentary with scenes from the following matches:\n  Stoke vs. Oldham 2004\n  Leeds vs. Man U 2002\n  In part one the CCTV footage of the 1997 game was used ; now the perfect CCTV tape in excellent quality was used for the Match in 2002\n  BRITANNIA IN EUROPE\n  West ham goes Heerenveen\n  The ICF is travelling to Holland and clashing with hooligans from holland. Exclusive private footage\n  Italy vs. Wales 2004\n  Soul Crew in Milan . Never shown private footage\n  Leicester vs. Red Star Belgrade\n  Tom Fuller was getting material of this match without any kind of corrupted video that was used in the scenes. Brutal scenes of the serbian lads maybe some mental disorder because of the war. After their arrival clashes with a leicester city firm follows. The provocation of the leicester lads showing nato aircrafts wasn`t unanswered - you can imagine what comes next! Nobody looked on the match this evening.\n  EUROPE (without english participation)\n  Essen vs. frankfurt 2004\n  Frankfurt hooligans used chairs and bottles to make a battlefield inside the stadium.\n  Austria vienna vs. legia warschau 2004\n  The Polish scene 2004 ( different private footage)","torrent":{"xt":"urn:btih:b26486e0a4bd2023e4a17ae0112f4a960b6fe110","amp;dn":"Hooligans+at+Play+2+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b26486e0a4bd2023e4a17ae0112f4a960b6fe110","infoHashBuffer":{"type":"Buffer","data":[178,100,134,224,164,189,32,35,228,161,122,224,17,47,74,150,11,111,225,16]},"announce":[],"urlList":[]}}