{"title":"Spidre-Man 3","uid":3842710,"size":1200202856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b363016694a32de5a4b8e1d48e1b55ef03e40e2d&amp;dn=Spidre-Man+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"islandstylee04","files":4,"time":1192431901,"description":"Add my voice to those underwhelmed by the latest edition of the Spiderman franchise. While it does contain some of the best action sequences I\\&amp;#039;ve ever seen, it is far from the best film ever made.\n\nThe problem with the film is that there is simply too much going on. First off you have the Peter/MJ relationship bumping along, add to that the Peter/Harry story line still playing out, plus we have the addition of the Sandman story and coming in in the final half hour is the addition of Venom. Its too much for the movie to handle, the result of which it all feels half baked. Very few of the characters get the proper amount of time to develop with the worst offender is Eddie Brock and Venom who get zero and so seem to belong in another movie (Venom looks great which makes his under use seem even worse). The real proof the film has too much going on was that there are a couple of times where the plot is moved along by sudden out of left field revelations. The only one I\\&quot;ll reveal, because its in the trailer, is that Sandman killed Uncle Ben in the first film. Had the film been better plotted the revelation wouldn\\&amp;#039;t have been necessary, nor would any of the others. \n\nThere are some bright spots, the majority of the Sandman material is sterling, with the first appearance of Sandman in the sand pit almost perfect, and the sequence that makes up his first battle with Spidey one of the greatest things I\\&amp;#039;ve ever seen put on film. The Sandman sequences alone make it worth slogging through the ups and downs of the rest of the movie.\n\nIs it a bad movie? No, just a disappointing one. Its clear that this could have and should have been the best in the series (and maybe the best film of the year) had all of the right pieces been put in place, indeed the final sequences in the film probably would have reduced most audiences to tears had they gotten the rest of the film right.\n\nAs I said the film is worth seeing at some point, just don\\&amp;#039;t feel the need to run out with everyone else. Was it worth fighting the crowds the first weekend to see? Not really, but it is worth seeing. Hopefully they\\&amp;#039;ll take a break before they make the next one, maybe they\\&amp;#039;ll make the one that this movie should have been \n\n","torrent":{"xt":"urn:btih:b363016694a32de5a4b8e1d48e1b55ef03e40e2d","amp;dn":"Spidre-Man+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b363016694a32de5a4b8e1d48e1b55ef03e40e2d","infoHashBuffer":{"type":"Buffer","data":[179,99,1,102,148,163,45,229,164,184,225,212,142,27,85,239,3,228,14,45]},"announce":[],"urlList":[]}}