{"title":"Bonzo Dog (Doo Dah) Band - Talking Pictures mk2 Disc 2","uid":3707296,"size":4616081221,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b51bfd2499a6e9deb3bfc60f6bbbc4496896ec8b&amp;dn=Bonzo+Dog+%28Doo+Dah%29+Band+-+Talking+Pictures+mk2+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"tygerbug","files":70,"time":1181191399,"description":"THE BONZO DOG BAND: TALKING PICTURES\n(Revised)\nDisc 2\nNTSC DVD\n\nNOT FOR PROFIT\nA free service to the fans with thanks to the people of the official Neil Innes website.\n\nThe Bonzo Dog (Doo Dah) Band are legends of British comedy and music from the 60s. Good friends to both Monty Python and the Beatles ... influenced by the latter and an influence on the former, their surreal brand of humor made 1920s jazz hip to a 60s audience.\n\n\nIn DISC TWO of this epic set (the final NTSC disc of the collection) we check in with Neil and Roger and the band but mostly explore the post-Bonzo work of Vivian Stanshall, who died in 1995. His poetic, comedic and musical genius is unquestioned, but he had a rocky life due to alcoholism and addiction to tranquilizers. Despite this he continued to create works of great originality and brilliance and this disc is intended as a tribute to him.\n\nThe specials &quot;Crank&quot; (aka &quot;Diamond Geezer&quot; or &quot;Vivian Stanshall: The Early Years&quot;) and &quot;One Man&amp;#039;s Week with Vivian Stanshall&quot; are here reproduced in their entirety, as are many other rare TV appearances.\n\nIf you would like to hear more of Neil Innes, ask about our collections of The Innes Book of Records, Rutland Weekend Television, and our many dozens of discs of his TV and live appearances. We have so many discs of Neil already that I felt no need whatsoever to represent him on this disc. (email me at tygerbug at yahoo.com.)\n\nThis one&amp;#039;s for Viv.\n\nSo, once again:\n\nYou may know them from their appearance in the Beatles&amp;#039; &quot;Magical Mystery Tour,&quot; as Vivian Stanshall performs &quot;Death Cab For Cutie.&quot; You may know Neil Innes from singing &quot;Brave Sir Robin&quot; in Monty Python and the Holy Grail, and &quot;How Sweet to Be an Idiot&quot; and a version of &quot;I&amp;#039;m the Urban Spaceman&quot; in Monty Python Live at the Hollywood Bowl. Or even for his masterful faux-Beatles music in the Rutles film. You may have seen them on Do Not Adjust Your Set (a precursor to Monty Python).\n\nThis is the ultimate collection of Bonzo Dog Band performances. Spread across several DVDs, this will provide hours and hours of entertainment as the Bonzos sing most of your favorites. Edited by Garrett Gilchrist (tygerbug/ocpmovie), the editor who created Star Wars Deleted Magic and The Thief and the Cobbler Recobbled Cut.\n\nTheir hilarious and wildly entertaining musical madness will entertain hipsters of any age.\n\nMany many many other Bonzo Dog, Neil Innes, Rutles and Monty Python related DVDs have been preserved by me, notably the Rutland Weekend Television and Innes Book of Records series.\n\nThis is the second, expanded version of a DVD originally created in 2005. The first Talking Pictures was just one DVD long. This revised set includes much more and better quality material spread across several DVDs.\n\nEven if you&amp;#039;re a major Bonzo fan, you won&amp;#039;t have seen much of this footage before. I have used clever editing to create new music videos for songs which had no video, to reconstruct clips which had bits missing, and to generally create new video based on shards and little bits of things, to give a full and very entertaining experience.\n\n\n Whenever possible, all or portions of all video and audio have been restored or reconstructed using the best available elements.\n\nDisc 2:\nCommercials by Vivian Stanshall:\nCommercial: Ruddles at Rawlinson End\nCommercial: Mr. Cadbury&amp;#039;s Parrot\nCommercial: Toshiba &quot;Terry Keeps His Clips On&quot;\nCommercial: The Guardian\nCommercial: Mr. Cadbury&amp;#039;s Parrot (alternate)\nCommercial: Cadbury&amp;#039;s Intro and the Outro\nCommercial: Tennent&amp;#039;s Pilsner\nDeath Cab For Cutie (DNAYS)\nThe Intro and the Outro (DNAYS)\nThe Equestrian Statue (DNAYS)\nUrban Spaceman (RWT)\nI&amp;#039;m Forever Blowing Bubbles (Full House)\nHumanoid Boogie (IBOR reedit)\nUrban Spaceman (IBOR)\nQuiet Talks and Summer Walks (IBOR reedit)\nBaba Tunde (One Man&amp;#039;s Week)\nMontage: Suspicion (One Man&amp;#039;s Week)\nGinger Geezer excerpt (Crank)\nRawlinson End film excerpts and montage\nMontage: Wheelbarrow (SHARE)\nMontage: Nice &amp; Tidy (SHARE)\nSHARE clip: Vivian &quot;Riddles&quot;\nMontage: Imagination (SHARE/Ruddles)\nStinkfoot montage:\nWhat My Public Wants (Andy Black and company)\nLandin&amp;#039; On My Feet Feet (Steve Howe)\nParakeet to Meet You (Cindy Stratton)\nMade of Stone (Nikki B)\nNo Time Like the Future (Viv feat. Middleton&amp;#039;s Changeling and Showboat saga clips)\nArmchair excerpt (Crank)\nMontage: The Cracks are Showing (Bristol Showboat Saga)\nI&amp;#039;d Rather Cut My Hands (Crank)\nThe End (Button Up Your Overcoat)/Fishing (One Man&amp;#039;s Week)\n\n\nVivian Stanshall&amp;#039;s Crank\nChapters:\nDiamond Geezer/Early Years intro by John Peel)\nMadness\nInsurance\nGinger Geezer\nArmchair\nSpreading His Light\nI&amp;#039;d Rather Cut My Hands\n\nOne Man&amp;#039;s Week With Vivian Stanshall\n(Chapters 1-7)\n\nExtras:\nBristol Showboat Saga clips with Vivian Stanshall\nEric Idle sings Captain Fantastic\nFriday Night, Saturday Morning with Vivian Stanshall\nFull House with Joe Melia and Roger Ruskin Spear\nThe Equestrian Statue: Two uncut full color takes from the Pathe newsreel archives\nRunaround with Roger Ruskin Spear\nDo You Remember the First Time? Vivian Stanshall (Pulp Hits)\nFriday Night, Saturday Morning with Vivian Stanshall (clip)\nThe Equestrian Statue (New Faces fullscreen)\n","torrent":{"xt":"urn:btih:b51bfd2499a6e9deb3bfc60f6bbbc4496896ec8b","amp;dn":"Bonzo+Dog+%28Doo+Dah%29+Band+-+Talking+Pictures+mk2+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b51bfd2499a6e9deb3bfc60f6bbbc4496896ec8b","infoHashBuffer":{"type":"Buffer","data":[181,27,253,36,153,166,233,222,179,191,198,15,107,187,196,73,104,150,236,139]},"announce":[],"urlList":[]}}