{"title":"From the heart of the world","uid":3951426,"size":720022769,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b578ba9e712accdd18f787ae79c05a7fa2b58116&amp;dn=From+the+heart+of+the+world&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"radioactive1","files":2,"time":1198881594,"description":"From the Heart of the World: The Elder Brothers Warning\n\nSynopsis:\nThis documentary explores the culture and spiritual beliefs of the Kogi tribe -- a pre-Colombian American tribe once believed destroyed. The Kogi, who call themselves the Elder Brothers of the human race and us the Younger Brothers, are convinced we are destroying the balance of life on earth. Believing that our only hope is to change our ways, the Kogi have set out to teach us what they know of the balance of mankind, nature and the spiritual world.\n\nMovie Review\nby Frederic and Mary Ann Brussat\n\nOne of the best films of 1992 is a warning by a South American Indian tribe that people give up their self-destructive ways and honor the planet before it is too late.\n\nAfter four centuries of seclusion, the Kogi, descendants of a pre-Colombian civilization, asked BBC filmmaker Alan Ereira to visit their homeland in the Sierra Nevada mountains of northern Colombia. From the Heart of the World: The Elder Brothers Warning delivers their prophetic message to the world.\n\nSeeing themselves as guardians of life on earth, the Kogi have a spiritual understanding of the bond between humankind and the natural world. This bond, they insist, must be honored.\n\nThe Kogi are governed by priests called mamas. As children, the mamas were educated in the dark and this early sensory deprivation has made them finely attuned to the mysteries and pleasures of their mountain environment. The Elder Brothers, as they call themselves, are convinced that we, the Younger Brothers, have wounded the earth through industrial exploitation, mining, and clearing of forests. They have seen signs of an ecological crisis in changing bird migrations and the lack of snow in the highest regions of the Sierra Nevada. The Kogis warn that unless we change our ways, the world will end: If we act well, the world can go on.\n\nThere have been many articulate calls for citizens of this planet to live in harmony with the natural world. But this video stands out as an especially cogent and moving plea for ecological wisdom.","torrent":{"xt":"urn:btih:b578ba9e712accdd18f787ae79c05a7fa2b58116","amp;dn":"From+the+heart+of+the+world","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b578ba9e712accdd18f787ae79c05a7fa2b58116","infoHashBuffer":{"type":"Buffer","data":[181,120,186,158,113,42,204,221,24,247,135,174,121,192,90,127,162,181,129,22]},"announce":[],"urlList":[]}}