{"title":"WINner Tweak 3 Pro 3.8.0","uid":3696225,"size":2735652,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b5f1a7e1a06bb59c27e5f9fe02fef8a93a44320c&amp;dn=WINner+Tweak+3+Pro+3.8.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boorstar","files":5,"time":1180030772,"description":"WINner Tweak Pro is a tools suite for tweaking, optimizing and tuning of Windows. WINner Tweak Pro includes hundreds of tweaks, settings and optimizations for Windows. You can browse 5 main sections of the Tune-Up Center - Windows, Hardware, Security, Network and Software to get access to the needed tweak or setting. In addition to the tweaks, the program also offers several additional tools (Power Utilities) that include a Disk Cleaner, Registry Cleaner, Shortcut Cleaner, Uninstall manager, File Shredder, Start-up Manager, Popup Blocker, Password Generator, and a Folder Protector to prevent access to selected folders.\nWith the Power Utilities, you can clean the hard disk and the registry, securely destroy private files, generate highly secure and extremely difficult to crack passwords, organize your desktop with Translucenter utility, manage installed programs and much more...\n\nWINner Tweak includes detailed description for each tweak. Just make right click on the tweak description and you will see tip with detailed explanation!\nThe import and export feature enables to create an export file, that contains specifically selected settings and tweaks. This export file can later be imported into WINner Tweak on the same computer, or to another computer with WINner Tweak. Additionally, you can use configuration export feature to create a template, which can be used to configure multiple computers with the same configuration settings, excluding machine- and system-specific information.\n\nCompatible with Windows XP, Windows 2000, Windows 2003 Server, Windows Vista.\n\n??Â¢ Disk Cleaner - increase the disk space by cleaning up unneeded temp and obsolete files.\n??Â¢ Registry Cleaner - utility for system registry backup and cleanup.Registry Cleaner will scan your entire registry for any invalid entries and provides a list of the errors found.\n??Â¢ Shortcut Cleaner - clean-up your PC from shortcuts pointing nowhere.\n??Â¢ Uninstall Manager - with this utility you can remove installed software and easily manage your programs uninstallers options.\n??Â¢ Start-Up Manager - it is the best way to handle Windows autorun programs. It provides tools to add new, view and edit, disable/enable and remove the items from Windows start-up process to optimize it in best way.\n??Â¢ Pop-Up Blocker - gives you ability to stop Internet Explorer pop-ups and manage the list of blocked sites.\n??Â¢ Internet Cache Analyzer - helps you protect your Internet privacy by erasing internet cache entries. Gives you extended information about each cache item. Also you can export cache entries list to text file or to Microsoft Excel.\n??Â¢ Password Generator - it helps you to create random passwords highly secure and extremely difficult to crack. You can use optional combination of upper and lower case letters, numbers and punctuation symbols.\n??Â¢ Folder Protector (Windows XP/2003 only) -you can lock folders with password on your hard drive. You can Add/Remove protection using folder context menu and choosing &quot;Folder Protector&quot; option.\n??Â¢ Folder Drive - you can create pseudo disk drive(s). Just specify folder where you want create disk drive, choose drive letter and click on the &quot;Create Folder Drive&quot; button.\n??Â¢ File Shredder - securely destroys (shreds) sensitive and private files beyond recovery. Simply drag and drop files to the File Shredder. Your sensitive files will be gone for good and nobody will be able to recover your business plans, personal files, photos or confidential letters.\n??Â¢ System Backup - creates backup of most Windows settings (Desktop settings, Color settings, Mouse and Keyboard configuration, Dial-Up configuration, Internet Explorer settings, Outlook Express accounts, etc.)\n??Â¢ Process Explorer - shows you information about which handles and DLLs processes have opened. Control and get detailed information about each Windows processes.\n??Â¢ Autoshutdown - is a Windows system shutdown manager. The utility provides unattended control for a Windows PC: shutdown, restart, logoff, standby your computer based on time. Autoshutdown can automatically lock the workstation, securing your work. Also autoshutdown can run some application that you have chosen.\n??Â¢ Translucenter is outstanding utility to make any window or part of Windows translucent. With translucent windows you can make your desktop more organized and useful. Just make any window translucent and you can see through it! Translucenter will remember all windows you make transparent and if you enable transparency on all windows in &amp;#039;History&amp;#039; , utility will constantly check for any new window and will make it translucent immediately.\n??Â¢ Access Limiter - with this utility you can limit when your children or employees are able to use a computer","torrent":{"xt":"urn:btih:b5f1a7e1a06bb59c27e5f9fe02fef8a93a44320c","amp;dn":"WINner+Tweak+3+Pro+3.8.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f1a7e1a06bb59c27e5f9fe02fef8a93a44320c","infoHashBuffer":{"type":"Buffer","data":[181,241,167,225,160,107,181,156,39,229,249,254,2,254,248,169,58,68,50,12]},"announce":[],"urlList":[]}}