{"title":"GetSmile v1.3030 Incl Keymaker and Extras","uid":3549270,"size":6011195,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b639c2fc04ff5f6e9d0d76e940762c462df57996&amp;dn=GetSmile+v1.3030+Incl+Keymaker+and+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PropAgenda","files":1,"time":1162352308,"description":"GetSmile.v1.3030.Incl.Keymaker.and.Extras.rar (5.73 MB)\n\n\nYour e-mails look too ordinary? Your postings are just plain boring? Bring fun to your life! Delight yourself and people around you with a smile! You need just one program - GetSmile.\nThis program lets you insert the most beautiful smilies in your messages. Just one mouse click stands between you and them!\nGetSmile helps you insert smilies in every message board that can accept new smilies.\nGetSmile fully supports the following e-mail clients:\nAOL 6.0, 7.0, 8.0, 9.0,\nBecky! Internet Mail 2.0 +/-,\nCompuServe 2000 v6.0,\nCourier Email 3.0 +/-,\nEudora 5.0, 6.0,\nIncrediMail,\nLotus Notes 5+,\nMozilla Mail 0.9 +,\nMozilla Thunderbird,\nNetscape Communicator Mail 4.72 +/-,\nNetscape Mail 6.0 +,\nOutlook 97, 98, 2000, XP,\nOutlook Express 4.0 +,\nPegasus Mail 4.02 +/-,\nThe Bat! 2.0 +,\nWal-Mart Connect 6.0\n(+ or - means that GetSmile may work respectively with some future or previous version of the product)\nGetSmile works with the most popular free online e-mail services like Hotmail and Yahoo! Mail.\nGetSmile can insert smilies even in MS Word.\n\n\nYou think drag&amp;drop is the easiest way to insert smilies in your messages? GetSmile makes it even simpler. You need just one mouse click to insert a smilie! Of course, drag&amp;drop and cut&amp;paste are available too.\nWith GetSmile you can capture almost every smilie from the Internet and add it to your collection.\nWe distribute with GetSmile a free sample ready to use smilie collection containing more than 800 smilies!\nYou can create and distribute your own smilie collections.\nGetSmile code is specially optimized to simultaneously output hundreds of animated smilies. Even the most popular browsers cannot do that (well, they are not designed to be powerful smilie managers though ;)!\nThe entire concept of the program&amp;#039;s interface has one purpose - to make smilie management as easy as possible.\nSmilies can be automatically sorted.\nGetSmile supports statistics for every single smile.\nGetSmile has internal multi-clipboard. Several types of Paste command are available.\nGetSmile has a convenient adjustable smilie preview mode.\n\nYou can set up different tags for separate smilie groups and even for single smilies.\nGetSmile has a smilie checking system to let you keep your smilies up to date with the Internet ones.\nYou can create and store various text records.\nThe program has native support of transparency (available under WinXP/2K)..\nGetSmile fully supports context help for almost all of its interface elements.\n\n\ntorrent contents;\nGetSmile.Halloween.2006.Collection.v1.0.Retail-ARN.rar\nGetSmile.v1.3030.Incl.Keymaker-ACME.rar\nGetSmile.v1.930.Update.Only.Retail-ARN.rar\n\n","torrent":{"xt":"urn:btih:b639c2fc04ff5f6e9d0d76e940762c462df57996","amp;dn":"GetSmile+v1.3030+Incl+Keymaker+and+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b639c2fc04ff5f6e9d0d76e940762c462df57996","infoHashBuffer":{"type":"Buffer","data":[182,57,194,252,4,255,95,110,157,13,118,233,64,118,44,70,45,245,121,150]},"announce":[],"urlList":[]}}