{"title":"Atomix Virtual DJ Professional v5.0.0.2-YAG","uid":3811387,"size":11672599,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b8bdc1c475b1ed834d570a3c4a731ab985286e87&amp;dn=Atomix+Virtual+DJ+Professional+v5.0.0.2-YAG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1190160489,"description":"YAG have released the latest version of Atomix Virtual DJ for you all to enjoy. VDJ is a mixing program for all the home DJ?s out there, it has a nice interface, and is actually quite simple to use. So if your looking for something different to what your already using, or want to try some DJing, this is a very good place to start.\n\nVirtualDJ is the hottest MP3 mixing software, targeting every DJ from bedroom DJs to professional superstars like Carl Cox. With its breakthrough BeatLock engine, your songs will always stay in the beat, and you can work your mixes incredibly faster than any other DJ could.\n\nThe automatic seamless loop engine and the brand new synchronised sampler will let you perform astounding remixes live, with no preparation at all. The visual representation and the cues allow you to clearly see the song?s structure, and never be surprised by a break anymore. The vinyl controls will let you scratch like on a real turntable, except that with the beatlock engine your scratches will never end out of the beat.\n\nProgram Features:\n\n    * One-click beat matching and synchronisation (new FAME algorithm)\n    * BeatLock engine: your songs will always stay in time, and you can work your mixes incredibly faster than any other DJ could\n    * Automatic beat-matched crossfading\n    * On-the-fly automatic BPM calculation\n    * Automatic pitch matching\n","torrent":{"xt":"urn:btih:b8bdc1c475b1ed834d570a3c4a731ab985286e87","amp;dn":"Atomix+Virtual+DJ+Professional+v5.0.0.2-YAG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8bdc1c475b1ed834d570a3c4a731ab985286e87","infoHashBuffer":{"type":"Buffer","data":[184,189,193,196,117,177,237,131,77,87,10,60,74,115,26,185,133,40,110,135]},"announce":[],"urlList":[]}}