{"title":"ProgressQuest 6.2","uid":3800891,"size":325791,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8f974ee301e9cc32fb27480ace7ff9e13b78c19&amp;dn=ProgressQuest+6.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KlillerP","files":1,"time":1189331930,"description":"!!!The Best non-graphics RPG game!!!\n\n\nBack story\nSince time before time the Vorlak had held the Crosshutch at Thraeskamp. The ancient reckoning held that the\nFive Skrelkampi (and their Truebine) would return when the great Trond-feast could be held anew and the\nBelnap reunited. But this legend became lost to all but the Papperboxen at Horbug. One of their own was Yallow\nthe Speldrig, who found an unlikely pupil in Torbole Understeady, the discarded illigitimate waif of Wainthane\nTopknox, whom Yallow renamed Grumdrig and began to school as a boar-pulmet\\'s apprentice. ...And, as it was said\nby some, in aberdoxy.\n\nAs our story opens young Grumdrig has returned to Horbug following a trying stint in Spilwaer Spond where his\nlaconic disposition and fertile mind bred a series of misadventures which had landed him outside the good graces\nof the Jordref there, Welham, who had secretly begun a long term course of slow but disaccomodating illpeel in the\nlad\\'s morning fanwael. Meanwhile, though scarce a tuft of mansefur had yet made its appearance on the boy\\'s manssach,\na number of visiting Roilwachhs have begun to exhibit a discreet and seemingly inexplicable interest in the boy. Strange\nindeed, as he would not reach his krouchensterm for another harvest or more. And when Grumdrig\\'s resiliant compatriot\nPaedri appears at Grumdrig\\'s lochnotat with a Scrolstamp from the old Speldrig, a woozy foreboding feeling rises from\nhis young gut...\n\n\nIntroduction\nProgress Quest is a next generation computer role-playing game. Gamers who have played modern online role-playing\ngames, or almost any computer role-playing game, or who have at any time installed or upgraded their operating system,\nwill find themselves incredibly comfortable with Progress Quest\\'s very familiar gameplay. Progress Quest follows\nreverently in the footsteps of recent smash hit online worlds, but is careful to streamline the more tedious aspects\nof those offerings. Players will still have the satisfaction of building their character from a ninety-pound level\n1 teenager, to an incredibly puissant, magically imbued warrior, well able to snuff out the lives of a barnload of\nbugbears without need of so much as a lunch break. Yet, gone are the tedious micromanagement and other frustrations\ncommon to that older generation of RPG\\'s.\n\n\nUser manual\nEven inexperienced gamers will find Progress Quest remarkably intutive and simple to play. Start the program and\nclick the New Game (Single Player) button, or click New Game (Multiplayer) and select a Realm to compete against\nplayers from all over the world. You will then be presented with the character creation screen. Select a name, race\nand class for the new character. Then, use the Roll button until you are statisfied with the stats for your character.\nTip: You can use the Unroll button (a feature exclusive to Progress Quest) to go back to any previous roll if you find\nthat you\\'ve clicked too hastily.\n\nIf you choose to play an online game, your character will share adventures with other Progress Quest characters\nin an online virtual world. Online play requires internet connectivity, though sophisiticated algorithms keep the\nbandwidth usage to a minimum. You can compare your character against the top Progress Quest players by visiting\nhttp://progressquest.com/realms.php (or hit Ctrl-B from within the game).\n\nFinally, hit the Sold! button to begin the game. The game will start immediately and you can safely familiarize\nyourself with the game\\'s single interface screen as the game progresses on its own. Soon your avatar will will be\nseeking and destroying an exotic panopoly of beasts while you gaze proudly on. Missing, you will notice, is the tedious\nmarch from town, the bewildering maze of cookie cutter streets hiding some specific merchant or NPC, and the\nrepetetive hunt for just the right beast to execute. Progress Quest supplies your character with an endless series\nof victims, as well as exciting quests which keep your quest log full to the brim at all times.\n\n\nTREASURE: Each slain creature yields a trophy, which can be sold in any town. When the encumbrance bar reaches maximum,\nyour character automatically returns to the nearest town to sell your loot. If sufficiently liquid, he may then purchase\nan upgrade in equpiment (weapon or armor). That being done, the interpid adventurer then returns to the frontier to\nspill more blood. Tip: The amount your character can carry before his encumbrance bar fills up increases as his STR\nstat improves.\n\n\nQUESTS: When a quest is complete, your character is rewarded with one of: a) a special, valuable, treasure item,\nb) an improved weapon or piece of armor, c) a boost in stats, or d) a new spell for his spellbook. The character\nis then assigned a follow-up quest, which he immediately begins to make progress on.\n\n\nEXPERIENCE AND LEVELING UP: Experience represents your character\\'s knowledge about the world around him, as well as\nhis battle prowess and ability to channel the forces of magical power. Your character gains experience by killing\nmonsters and sentient beings, over and over again. Once the experience bar is full, your character levels up, and\nis given an automatic boost in several of his stats and a new spell for his spellbook.\n\n\nDYING: Be warned that your character can be slain by monsters which are tougher than he can handle. However, this\nconcept has been abstracted out of the game and takes effect simply by somewhat reducing the experience accumulated\nfor each successful murder.\n\n\nSAVING YOUR PROGRESS: Your game is saved whenever you quit, as well as each time your character levels up or\ncompletes a quest. You can pick up where you left off by restarting Progress Quest and clicking the Load Game\nbutton. Progress Quest makes a backup of your existing save file each time it saves anew, so if your save file\nbecomes corrupted, load the backup, and lament the progress that must now be regained.\n\n\nGame controls\nProgress Quest belongs to a new breed of \\&quot;fire and forget\\&quot; RPG\\'s. There is no need to interact with Progress Quest\nat all; it will make progress with you or without you.\n\nYou can quit Progress Quest by using the window close box, or by hitting Alt-F4 (hold down the Alt key while hitting F4), but there is really little need to ever do so. Please note that your character will not make any progress\nexcept when Progress Quest is running. Your character will make no progress once you quit the program, until you start\nProgress Quest again.","torrent":{"xt":"urn:btih:b8f974ee301e9cc32fb27480ace7ff9e13b78c19","amp;dn":"ProgressQuest+6.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f974ee301e9cc32fb27480ace7ff9e13b78c19","infoHashBuffer":{"type":"Buffer","data":[184,249,116,238,48,30,156,195,47,178,116,128,172,231,255,158,19,183,140,25]},"announce":[],"urlList":[]}}