{"title":"Fifa 08 English","uid":3864238,"size":2753060949,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b9944f38a22ea4247797cfe457e7e11963531f34&amp;dn=Fifa+08+English+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erikottie","files":58,"time":1193688231,"description":"Product Description\nFIFA Soccer 08 challenges players to master the skills required to play professional soccer. The FIFA Soccer 08 next-gen gameplay engine delivers animations and ball control that is so responsive you feel like you are actually on the pitch. Players are now aware of their surroundings, reacting authentically to threats and opportunities to make intelligent decisions. The FIFA Soccer 08 shooting system allows even more control and precision in front of the goal to become a true marksman. You can combine tricks and skill moves together to recreate signature moves from the real-world superstars or define your own style of play. You can even capture video of your best moves and goals in-game and upload to the FIFA 08 website to show off your style and celebrate your glory with friends across the globe. Brand new to FIFA Soccer &amp;#039;08 is a play mode called Be A Pro, which locks you in the role of a single player and challenges you to master the same disciplines as a real professional player, from positioning and tackling to reading the field and passing. Tired of playing alone? You&amp;#039;ve got the award-winning Interactive Leagues. Represent your club online against your rivals throughout the season in the F.A. Premier League, Bundesliga, French League or Mexican 1st Division. When they play, you play. Plus, create and organize your own multiplayer Friends Leagues and tournaments with all the tools in-game. FIFA Soccer 08 brings all the drama of pro soccer right to you, made even more real with the inclusion of 620 licensed teams, 30 official leagues, and more than 15,000 players! 620 licensed teams, 30 official leagues, and 15,000+ players Tournament Mode - Play 60 tournaments, including 35 licensed ones, or create your own ESRB Rated E for Everyone","torrent":{"xt":"urn:btih:b9944f38a22ea4247797cfe457e7e11963531f34","amp;dn":"Fifa+08+English+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9944f38a22ea4247797cfe457e7e11963531f34","infoHashBuffer":{"type":"Buffer","data":[185,148,79,56,162,46,164,36,119,151,207,228,87,231,225,25,99,83,31,52]},"announce":[],"urlList":[]}}