{"title":"Who killed the electric car - Please seed 2+ copies - XVID - 320","uid":3811620,"size":252649222,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b9a472bbc34962f32604f8cf00f3ee88bade1c1f&amp;dn=Who+killed+the+electric+car+-+Please+seed+2%2B+copies+-+XVID+-+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tuberok","files":1,"time":1190185786,"description":"An EXCELLENT documentary that poses questions as to why GM discontinued the all-electric car in California.  Presented in 320x240, perfect for portable dvd players, pda&amp;#039;s, smartphones, etc. that support the xvid format.  I welcome your feedback &amp; a discussion of your thoughts on this film. Please seed AT LEAST 2 copies &amp; enjoy! :)\n\nTuberok\n\n\n\n\n\n\n\nWho Killed the Electric Car? (2006)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 7.7/10 (2,908 votes) \nmore Photos (see all 65 photos)  \n      \n\n--------------------------------------------------------------------------------\n\nOverview\nDirector:Chris Paine\n\nWriter:Chris Paine \n\nRelease Date:4 August 2006 (UK) more view trailer \nGenre:Documentary more \nTagline:In 1996, electric cars began to appear on roads all over California. They were quiet and fast, produced no exhaust and ran without gasoline...........Ten years later, these cars were destroyed. more \nPlot Outline:A documentary that investigates the birth and death of the electric car, as well as the role of renewable energy and sustainable living in the future. more \nPlot Synopsis:This plot synopsis is empty. Add a synopsis \nPlot Keywords:Oil Industry / Engineering / Protest / California / Auto Industry more \nAwards:2 nominations more \nUser Comments:A very good documentary that put its biases up front more \n\n--------------------------------------------------------------------------------\n\nCast (Cast overview, first billed only)\n\n Martin Sheen ...  Narrator (voice) \n Reverend Gadget ...  Himself (as Greg &amp;#039;Gadget&amp;#039; Abbott) \n Dave Barthmuss ...  Himself \n\n Ed Begley Jr. ...  Himself \n Jim Boyd ...  Himself \n Alan Cocconi ...  Himself \n John R. Dabels ...  Himself \n Phyllis Diller ...  Herself \n\n Colette Divine ...  Herself \n Tom Everhart ...  Himself \n David Freeman ...  Himself (as S. David Freeman) \n Frank Gaffney ...  Himself (as Frank J. Gaffney Jr.) \n\n Marc Geller ...  Himself \n\n Mel Gibson ...  Himself \n Greg Hanssen ...  Himself \nmore\n\n--------------------------------------------------------------------------------\n\nAdditional Details\nMPAA:Rated PG for brief mild language. \nParents Guide:Add content advisory for parents \nRuntime:92 min \nCountry:USA \nLanguage:English \nColor:Color \nAspect Ratio:1.75 : 1 more \nSound Mix:Dolby Digital \nCertification:USA:PG / UK:U (uncut) / Singapore:PG / Australia:PG / UK:U \nFilming Locations:Willow Springs International Motorsports Park, Rosamond, California, USA \nMOVIEmeter:  21% since last week why? \nCompany:Plinyminor more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:The boxy, small EV shown being crushed in the movie was the Honda EV-Plus. They, like the sleek GM EV-1, were only available for lease; several returned to Honda, and were converted into fuel cell demonstration vehicles. For a while, you were able to lease them through EV Rentals (at several Budget Rent a Car locations). more \nQuotes:Mel Gibson: Who writes the history? Um, well... The guy with the biggest club. more \nMovie Connections:Featured in Jump-Starting the Future (2006) (V) more \nSoundtrack:Carried Away more \n\n--------------------------------------------------------------------------------\n\nFAQ\nThis FAQ is empty. Add the first question. \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n5 out of 6 people found the following comment useful:- \nA very good documentary that put its biases up front, 15 June 2007\n\n\nAuthor: salorkent from Seattle, Wa. \n\nI&amp;#039;m neither a liberal or a conservative (yes, there are other options!)and while I expected to read the usual &amp;#039;party lines&amp;#039; concerning the politics of this movie ... I was AMAZED at how many people missed the point of the movie. This wasn&amp;#039;t, at its heart, a movie about the politics of energy. Rather, it was a human story about people who found, and even fell in love, with a preferred form of transportation, only to have it taken away from them against their will. ***CAUTION --- POSSIBLE SPOILERS AHEAD*** I don&amp;#039;t think what I&amp;#039;m about to say will spoil the movie experience, but I decided to play it safe. The most amazing part of the story, to me, concerns the quiet battle between General Motors and the EV1 lessees who wanted desperately to keep their vehicles. Why did GM take such a hard core approach? It seemed to me a more conciliatory approach would have done the embattled auto-maker a world of good. To me, that was the question that drove the story. Yes, most of the people who apparently leased one of GM&amp;#039;s electric cars were celebrities and/or people of some measure of wealth. So what? Anyone who likes electronic gadgetry has heard the expression &quot;early adopter,&quot; referring to those with money who purchase state-of-the-art equipment at high prices, thereby fueling the development and investment that pushes products to consumer-level pricing. GM&amp;#039;s inability to realize this is what makes the whole story fascinating. I encourage anyone who would, to watch the movie closely, and see If this doesn&amp;#039;t ring true. Now, having said my piece about the movie, let me throw some comments about energy policy into the fray. 1) We absolutely, positively need gas to reach a price of $5 a gallon or more. Why? Supply and demand. Only when it HURTS to drive a gas guzzler, will most of us finally get off that doomed bandwagon. 2) We had a solution to coal produced electricity in our laps twenty years ago, and a piece of Hollywood drivel (&quot;The China Syndrome&quot;)turned us into weenies. Yes, folks, I mean nuclear power. It CAN and IS producing power safely, and environmentally soundly. Just not here in the U.S., by and large. Finally, 3) Supporting the development of electric-only cars is a viable choice. With the improvements being made in solar panel technology, I suspect a working battery-solar hybrid may be a very real option in the NEAR future. If we avoid the stupidity this movie helps us to understand. \n\n","torrent":{"xt":"urn:btih:b9a472bbc34962f32604f8cf00f3ee88bade1c1f","amp;dn":"Who+killed+the+electric+car+-+Please+seed+2%2B+copies+-+XVID+-+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9a472bbc34962f32604f8cf00f3ee88bade1c1f","infoHashBuffer":{"type":"Buffer","data":[185,164,114,187,195,73,98,243,38,4,248,207,0,243,238,136,186,222,28,31]},"announce":[],"urlList":[]}}