{"title":"ViceVersaPro_2.0.2014_with_Keygen","uid":3796042,"size":3349635,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ba23221c1ca69fc4a95f16f8c5068217a09da352&amp;dn=ViceVersaPro_2.0.2014_with_Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dogengo","files":1,"time":1188982835,"description":"Nice utiliy and works really good.\nNo viruses of course!!!\n\nDESCRIPTION:\n\nViceVersa is the Award-Winning Windows XP, 2003, 2000, Vista software designed for File Synchronization, File Replication, File Backup and File Comparison\n\nViceVersa lets you synchronize files, replicate folders, perform backups and do file and folder comparisons like never before: innovative, fast and time-saving.\n\nViceVersa works between computers, e.g. Laptop, Desktop, Workstation, Server, over network LAN, WAN, VPN, USB, and with any type of storage media including external Hard Disk, Zip disk, USB flash drive, CD-RW, DVD, NAS Network Attached Storage.\n\nViceVersa unique side-by-side view quickly shows you the latest status of your files and gives you complete control over your data.\n\nYou get easy file backup software with flexible file archiving, bi-directional file sync software, automatic file and folder replication (=file mirroring), CRC file comparison and file verification to make sure your replica is still the same.\n\t\nViceVersa can copy open files without closing the program you are working on. This includes Outlook PST files, Outlook Express, QuickBooks databases, Word and Excel documents, SQL databases.\n\t\nWith compression and encryption, time synchronization, file archiving, file revision and versioning, ViceVersa delivers the flexibility you need to keep your data safe and protected.\n\t\nNo matter whether you manage a large server with hundreds of gigabytes or want a tool to secure data stored on workstations: ViceVersa is the solution you have been looking for.\n\nPlz Comment how it worked for you","torrent":{"xt":"urn:btih:ba23221c1ca69fc4a95f16f8c5068217a09da352","amp;dn":"ViceVersaPro_2.0.2014_with_Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba23221c1ca69fc4a95f16f8c5068217a09da352","infoHashBuffer":{"type":"Buffer","data":[186,35,34,28,28,166,159,196,169,95,22,248,197,6,130,23,160,157,163,82]},"announce":[],"urlList":[]}}