{"title":"K-Lite Mega Codec Pack 2.1.5 (Jun 4 2007)","uid":3705802,"size":28844016,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ba6f96455c123ee6fb886b161f36f5d20b4ccf63&amp;dn=K-Lite+Mega+Codec+Pack+2.1.5+%28Jun+4+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spookydude","files":1,"time":1180998136,"description":"Changelog 2.1.0 -&gt; 2.1.5 | (2007-06-04)\n\n    * Updated ffdshow to revision 1240\n    * Updated DivX decoder to version 6.6.1.4\n    * Updated DivX encoder to version 6.6.1.4\n    * Updated Haali Media Splitter to version 1.7.189.11\n    * Updated AC3Filter to version 1.40b\n    * Updated AC3File to version 0.5b\n    * Updated unrar.dll\n    * Added functionality to Codec Tweak Tool for importing/exporting settings\n\n---------------------\n\nAbout the K-Lite Mega Codec Pack\n\nK-Lite Codec Pack is a collection of VFW/ACM codecs, DirectShow filters and tools. Codecs and DirectShow filters are needed for encoding and decoding (playing) audio and video formats. The K-Lite Codec Pack is designed as a user-friendly solution for playing all your movie files. With the K-Lite Codec Pack you should be able to play all the popular audio and video formats and even several less common formats.\n\n\nThe K-Lite Codec Pack has a couple of major advantages compared to other codec packs:\n\n    *\n      It it always very up-to-date with the newest and/or best components.\n    *\n      All components have been carefully selected. It is not just a random bunch of stuff thrown together.\n    *\n      It is very user-friendly and easy to use.\n    *\n      The installation is fully customizable, meaning that you are able to only install those components that you really want.\n    *\n      For some formats a choice can be made during installation between different filters. This allows you to tweak the pack to your own specific needs and preferences.\n    *\n      Uninstallation removes everything that was installed by the pack. Including all registry keys.\n    *\n      It is extremely easy to make a fully customized unattended installation with the integrated wizard.\n    *\n      It has been very well tested. The pack doesn&amp;#039;t contain any conflicting or buggy codecs.\n    *\n      It tries to avoid potential conflicts with other codecs already installed on your computer.\n    *\n      The pack is able to detect broken codecs and filters on your system, and helps you to removes them.\n    *\n      It is a very complete package, containing everything you need to play your movies.\n    *\n      This pack has a huge user base. This means that problems are found and resolved quickly.\n    *\n      Suitable for both novice and expert users.\n\nThe K-Lite Mega Codec Pack combines the contents of three packs:\n\n    * K-Lite Codec Pack Full\n    * QuickTime Alternative\n    * Real Alternative\n\n\nThe K-Lite Codec Pack works on Windows 2000/XP/2003/XP64/Vista.","torrent":{"xt":"urn:btih:ba6f96455c123ee6fb886b161f36f5d20b4ccf63","amp;dn":"K-Lite+Mega+Codec+Pack+2.1.5+%28Jun+4+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba6f96455c123ee6fb886b161f36f5d20b4ccf63","infoHashBuffer":{"type":"Buffer","data":[186,111,150,69,92,18,62,230,251,136,107,22,31,54,245,210,11,76,207,99]},"announce":[],"urlList":[]}}