{"title":"(Little mp4 version) Secretz of Da SistahHood - Vampire Grlz","uid":3848022,"size":197242715,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:baa7b32b39bf2c9181aada0d196bf829bdcf8168&amp;dn=+%28Little+mp4+version%29+Secretz+of+Da+SistahHood+-+Vampire+Grlz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"friendofthedevil2","files":2,"time":1192763928,"description":"Except for the giant &quot;dream&quot; balling section in the middle of the film and the killer blow jobs, this should probably be listed as horror, without actually being scary. \n\nHere goes:\nso again, \nSecretz of Da SistahHood ...the mp4 \n\nProving that mega-cheesy Grindhouse Films can never die....even if they should. \n\n\n?Secrets of the Sisterhood? is a modern day horror about a group of female vampires who use a strip club as a front for luring unsuspecting male victims into their lair. Through a series of mysterious disappearances of men, three police, Mike Tully, Christine Spade and Elvis Johnson, uncover the deadly secret of the Sisterhood. The story opens up with an investigation of an abandoned vehicle, a pool of blood in the woods, and no body. A day later, two college men disappear after visiting a local strip club and leaving with a couple of the strippers. Unbeknown to them, men leave the club with the girls and wind up in a desolate area where the vampires dwell. The men are used for sex then fed upon for their blood. A mutated vampire, ?Price,? is used as a slave by the vampires. He devours the remains of the carnage. \nIn an attempt to get closer to the mystery, Christine goes under cover as a dancer at the strip club. It is here she meets Velvet and Lita, the seductive vampires. Velvet becomes immediately attracted to Christine luring her into the vampire clan. Christine is torn between not only her duties as a cop, but her uncontrollable desire for eternal life. \nLiz, the girlfriend of a vampire victim, begins a mission to find her missing boyfriend, leading her deeper into the vampire?s lair. Thus begins a blood bath between mortals and immortals. The classic battle of good vs. evil revolves around exploding vampires, blood and gore. \nThis movie is a perfect blend of exhibiting the classic beauty and sensuality of the vampire along with the portrayal of the bloodthirsty predators that lies beneath. \n\nType.................: Movie \n\nYear.................: 2002 \nDuration.............: 1 hr 31 mins 35 sec \n\nAudio Format.........: Dolby Digital \nChannels.............: 2 \n\nVideo Format.........: AVI \nVideo Bitrate........: 910 \nResolution...........: 640 x 480 \nFPS..................: 23.98 \nSource...............: DVD 16x9 \nOriginal Format......: NTSC \nGenre................: Horror \n","torrent":{"xt":"urn:btih:baa7b32b39bf2c9181aada0d196bf829bdcf8168","amp;dn":"+%28Little+mp4+version%29+Secretz+of+Da+SistahHood+-+Vampire+Grlz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baa7b32b39bf2c9181aada0d196bf829bdcf8168","infoHashBuffer":{"type":"Buffer","data":[186,167,179,43,57,191,44,145,129,170,218,13,25,107,248,41,189,207,129,104]},"announce":[],"urlList":[]}}