{"title":"Final Fantasy XII - THE MOVIE Episodes 1-3 MPEG-2","uid":3578156,"size":513507903,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bacabe56c674cf3ef0e5f53fcea074a111255127&amp;dn=Final+Fantasy+XII+-+THE+MOVIE+Episodes+1-3+MPEG-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yic17","files":1,"time":1166304242,"description":"Final Fantasy XII THE MOVIE\n\n\n\nIntroduction\n\nFinal Fantasy XII takes place mostly in the kingdom of Dalmasca, a small city in Ivalice. A neutral party in the past wars between its neighboring kingdoms of Archadia and Rozarria, Dalmasca was ultimately conquered by Archadia and reduced to the status of an occupied state under Archadian rule. Vaan, a street urchin living in the Dalmascan capital of Rabanastre, attempts to steal from the royal palace, in an attempt to &quot;take back&quot; Dalmascan treasures from the Archadians. However, resistance forces lead an assault on the royal castle, and Vaan is caught between Archadian troops and Dalmascan insurgents. This leads to a chance encounter with Ashe, the deposed princess of Dalmasca and leader of the resistance.\n\n\n\nVideo Games Heaven is an online theater of self-made videogame movies by Yic17.\n\n\n\nWhat is a videogame movie?\n\nBasically, I played a game (20-100 hours depending on the game), I recorded the whole thing, and then I edited it into a 2 hours long or sometimes longer movie. Personally, I think many videogames have great stories that are better than a lot of movies out there. I really enjoy watching the games as movies without the need to play through all those hours.\n\nI know there are people out there who sell videogame DVDs that include all the cut-scenes. However, those DVDs do not include battle scenes and sometimes cut-scenes are just not enough to allow the story to make sense. That&amp;#039;s why in my videogame movies, they include all the cut-scenes, story or boss battles, and any dialogue that allows the story to make sense. Also, I include anything that is COOL from the games. For example, in Final Fantasy XII, I include all the espers (summoned beasts) in there so people who don&amp;#039;t have the game will not only be able to watch the cut-scenes, but also watch all the esper animation scenes.\n\n\n\nWatch the rest episodes of Final Fantasy XII THE MOVIE on VG Heaven!!\n &lt;a href=&quot;\nhttp://videogamesheaven.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://videogamesheaven.net&lt;/a&gt;","torrent":{"xt":"urn:btih:bacabe56c674cf3ef0e5f53fcea074a111255127","amp;dn":"Final+Fantasy+XII+-+THE+MOVIE+Episodes+1-3+MPEG-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bacabe56c674cf3ef0e5f53fcea074a111255127","infoHashBuffer":{"type":"Buffer","data":[186,202,190,86,198,116,207,62,240,229,245,63,206,160,116,161,17,37,81,39]},"announce":[],"urlList":[]}}