{"title":"Gore.Ultimate.Soldier-Razor1911","uid":3834431,"size":395125352,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bbf247965808ab5f663dbbd19593df473e88f772&amp;dn=Gore.Ultimate.Soldier-Razor1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"starshiponthenet","files":3,"time":1191866237,"description":"\n         ??????\n     ???? ???  ???????\n    ? ??????????????? ???????                   ??????    ???\n    ??? ????? ????????? ????????????????????????? ?? ????? ? ??????\n       ? ???    ??????? ??????? ?? ???????????  ????? ? ?????????? ??\n       ? ???  ??????? ?? ???????   ???   ???? ??? ?????  ???   ????? ?\n       ? ???????  ????? ??? ? ??? ???  ???? ???? ?? ????????  ????? ??\n       ? ?????????  ?? ????    ??? ? ????   ?????? ? ??? ???????  ??\n       ? ???  ??????  ???? ??????????????????? ???????   ???  ???? ???\n     ?? ????? ? ???????????? ? ??????????????  ? ??? ?? ????? ? ????  ??????\n    ?? ??????? ?? ???????? ????????  ??? ??????? ? ?????????????? ??????  ? ??\n  ??????????????????????????????   ??? ???     ??????            ????? ??? ??\n                  ?????? ??????????? ???                              ?????\n                      ???????????????                  Â·  1Â·9Â·1Â·1  Â·      &lt;JeD&gt;\n\n ??????????????????????????????????????????????????????????????????????????????\n ?                           GORE   (c)  DreamCatcher                         ?\n ??????????????????????????????????????????????????????????????????????????????\n ?      Date:  June 4 2002            ?   Game Type:  Shoot-em-up             ?\n ?  Supplier:  Team Razor             ?        Size:  27 x15mB                ?\n ?   Cracker:  Team Razor          ?  Protection:  Safedisc 2              ?\n ??????????????????????????????????????????????????????????????????????????????\n\n  GAME NOTES:\n  ~~~~~~~~~~    \n\n  In the mid-21st century, massive overpopulation and consumption caused irreversible \n  resource shortages over most of the planet. All supplies of fossil fuels were \n  completely decimated by 2031. The agro-mosaic virus outbreak of 2042 triggered the \n  global food riots of 2043 by causing the extinction of all agricultural plant species. \n  Five billion humans, almost half of the earths population, died of starvation.\n\n  With most cities falling into ruin in a perpetual night of low fuel and no power, street \n  gangs grew into terror patrols, controlling neighborhoods and sometimes entire cities. \n  These terror patrols grew larger and larger, falling under the control of ever more \n  powerful dictators.\n\n  All government officials became targets for assassination, the global system of \n  government was getting weaker by the day. As the governments began to fall and chaos \n  began to be a way of life, all governments united and focused on the continuing search \n  for a new energy source.\n\n  Finally, in 2079, government scientists discovered a new energy source, created from anti \n  matter chemical reactions between the grinding forces of the planets tectonic plates, a \n  new energy source was mined, called ORE. ORE, though not energy producing itself, was able \n  to catalyze nearly any chemical reaction and also amplify any electrical power fed into it. \n  Because of the density of the ORE found, when energy passed through the ORE atoms were sped \n  up to a speed never seen before, increasing energy passed through the ORE as well as creating \n  distortion in time and the known field.\n\n  After the ORE became common knowledge, the fighting factions used all means to gain \n  access to the ORE&amp;#039;s power. Using the ORE&amp;#039;s power to bend time and fold space the MOB \n  left earth in search of more ORE, in the process creating a war between worlds as well \n  as on its own. Deep in the bowels of UMC research and development, secret experiments \n  have led to the creation of the advanced massively parallel bio-computational neural network, \n  with the ability to emulate higher-level thought processes and simulate the nonlinear \n  processing of computations and complex algorithms. This advanced bio-computational neural \n  network has created a perfect artificial environment, this new system avoids failures from \n  the past and jerkiness caused by computational spasming in older non bio based artificial \n  environments.\n\n  One of the first practical uses of this new technology was the development of an advanced \n  combat training emulator. This emulator is a virtual reality where the UMC weeds out the \n  mentally weak and trains the best of the best to be even better. It is so realistic several \n  level 5 marines who first tested it died of cardiac arrest.\n\n  The &quot;Meat Machine&quot; termed by the first wave of Marines tested on the neural network, takes \n  the Marine where they have never been, shows them enemies they have never faced, and trains \n  them with existing UMC weaponry, plus weaponry that are yet to be made in the real world.\n \n\n  Features:\n\n  Game Play Modes:  Death Match, CTF, Fortress style, plus exciting new single and teams modes.\n\n\n  Installation notes\n  ~~~~~~~~~~~~~~~~~~\n  1) Unrar\n  2) Edit the .cue to &quot;rzr-gore.bin&quot; (it says gore.bin), or if you are too lazy (or stupid :p) \n     use the one in the .zip included\n  3) Burn with your favorite software.\n  4) Install, Copy over crack &amp; Play\n\n  When asked for a CD-KEY, enter 5a67-8eaf-8863-e05e\n\n  Remember that you probably will not be able to play Online with this, You&amp;#039;ll need to buy the \n  game for that.\n\n  Check out the cool intro included (both on the cd and in a .zip) !!!\n  \n  Enjoy, and watch out for more from your friends at the Blade!\n\n\n  GROUP GREETS:\n  ~~~~~~~~~~~~\n  To all!\n\n  \n                                      /\n                        Razor 1911   /__   Since 1985\n                                    /  /\n                                   /__/__\n\n              SUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE!\n     IF YOU ENJOYED THIS PRODUCT, BUY IT!  SOFTWARE AUTHORS DESERVE SUPPORT!!\n\n","torrent":{"xt":"urn:btih:bbf247965808ab5f663dbbd19593df473e88f772","amp;dn":"Gore.Ultimate.Soldier-Razor1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf247965808ab5f663dbbd19593df473e88f772","infoHashBuffer":{"type":"Buffer","data":[187,242,71,150,88,8,171,95,102,61,187,209,149,147,223,71,62,136,247,114]},"announce":[],"urlList":[]}}