{"title":"Blaze Media Pro","uid":3961415,"size":16162603,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bda150aebbe8ed36eacea5d5ff4fdafe7f89552c&amp;dn=Blaze+Media+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ozflik","files":1,"time":1199473148,"description":" Audio/Video Editing, Converter\n\nPowerhouse all-in-one converter, burner, audio and video editing software for all popular audio and video formats...and much more! Some of the formats supported by the software&amp;#039;s audio editing and video editing include MP3, WMA, WAV, OGG, AVI, MPEG-1, MPEG-2, WMV, and more.\n\nBlaze Media Pro includes an audio and video converter, audio editing and video editing, video capture, audio recorder, data CD/DVD burner, audio CD burner, Video CD (VCD/SVCD) burner, audio CD copy, effects, media management, playlist, full-screen video support\n\n\n\nAudio Converter  (Including MP3 Encoder  and Decoder) Supported File Types:\n    *  MP3 to WAV\n    * MP3 to WMA\n    * MP3 to OGG\n    * WAV to MP3\n    * WAV to WMA\n    * WAV to OGG\n    * WMA to WAV\n    * WMA to MP3\n    * WMA to OGG\n    * OGG to MP3\n    * OGG to WAV\n    * OGG to WMA\n    * CD to WAV\n    * CD to MP3\n    * CD to WMA\n    * CD to OGG\n    * MIDI to WAV\n    * MIDI to MP3\n    * MIDI to WMA\n    * MIDI to OGG\n    * DVD Audio to WAV\n    * DVD Audio to MP3\n    * DVD Audio to WMA\n    * DVD Audio to OGG\n    * Compress MP3 and WAV Files\n\n\n\n\n# Audio Capabilities\n\n    * Audio editing, converter (MP3, WMA, WAV, OGG, etc.), CD ripper, and merging\n    * Extensive list of supported conversions\n    * Convert bitrate and compression for audio formats, such as converting a MP3 from 128 kbps to 64 kbps. The software can adjust to lower as well as higher bitrates.\n    * Provides a solution to convert DRM protected WMA files, convert protected AAC and M4P files, and convert OMA to MP3, WAV, WMA, OGG\n    * Advanced audio CD burning from WAV, MP3, WMA, and OGG formats. Powerful, yet easy to use feature to burn CDs\n    * Extract and save audio content of video files to sound files\n    * Apply sound effects to audio files\n    * Use the software&amp;#039;s audio editing feature to record MIDI files, providing a solution to convert MIDI to MP3, WAV, WMA, OGG, etc. The same can be used to convert DVD audio to MP3, WAV, WMA, or OGG.\n    * Copy music CDs (copy audio CDs)\n    * Record from line-in (cassette, LP, etc.), streaming audio, or any other source available on your system\n    * All-in-one MP3 software solution (MP3 converter, MP3 encoder, MP3 decoder, MP3 ripper, CD burner, MP3 editor, MP3 recorder, MP3 player, and more).\n    * MusicID audio recognition\n    * Music Lyrics Search\n    * Audio tag editing (ID3 tag editing and other meta data), and FreeDB support\n    * Highly customizable, configurable, and user-friendly interface\n\n# Video Capabilities\n\n    * Batch Video Converter for AVI, MPG, WMV, MOV, and more\n    * Convert AVI, MPG, and WMV video to Flash\n    * Video CD (VCD/SVCD) burner\n    * Video DVD Burner\n    * Powerful digital video editing software for all popular video formats and an extensive list of video editing filters, effects, and video editing operations. The software&amp;#039;s movie/video editing feature supports AVI, MPG (MPEG-1 and MPEG-2), WMV, and more\n    * Compress video files, including AVI, MPEG, and WMV\n    * Video creator (make a video from a sequence of image and audio files)\n    * Video combining, and extraction\n    * Video joiner for AVI, MPEG, WMV\n    * All-in-one MPEG software solution (MPEG encoder, MPEG decoder, MPEG editor, MPEG VCD Burner, MPEG Converter, and more)\n    * Batch video processing\n    * Video capture feature that can capture from most TV tuners, web cams, and other video capture devices. This feature can be used in combination with a TV tuner or video capture card to capture video from DVD and save to AVI or WMV, for example.\n    * Media management\n    * Extract video frames to image files in batch mode. Supported formats include BMP, EMF, GIF, J2K, JPG, PCX, PNG, RAS, TGA, TIF, and WMF\n    * Insert images into existing video files or create new videos from a collection of image files\n    * Create video files from still frame images and other videos\n    * Add audio to video files, replace existing audio in video files, delete audio from video files\n    * Convert between PAL and NTSC video standards using the software&amp;#039;s video converter feature\n    * Add over 30 effects and color adjustment operations to your video for powerful enhancement and alternation\n    * Video editing is available for AVI (uncompressed), AVI (compressed using any available codec), MPEG-1, MPEG-2, WMV, and ASF\n    * You can use a comprehensive set of video editing operations: crop, delete frame, delete selection (video and/or audio), resize, rotate, mirror, flip, trim, adjust audio volume, and much more\n    * Click supported conversions to see even more possibilities\n\n# Combination Audio and Video Capabilities\n\n    * Blaze Media Pro&amp;#039;s unique Media Manager makes it easy to work with all your audio and video creations - playback at your fingertips. Even rename, copy, move, or tag files instantly.\n    * Burn data CD/DVDs to safekeep your multimedia creations (or any other files)\n    * ISO burner feature included with the Data CD/DVD burner\n    * Create ISO files from CD/DVD layout\n    * Insert audio files, such as WAV, WMA, and MP3, into video files\n    * Extract audio from video files using the video editing feature or Extract Audio Content feature\n    * Work with specific tracks, frames, or even a range of seconds\n    * Audio and video editing for a complete all-in-one multimedia editing solution.\n\n# Supported Conversions\n\n    * CD to WAV, CD to MP3, CD to WMA, and CD to OGG\n    * WAV, WMA, OGG, AIFF, VOX, MP2, MPC/+, G.72x, AU, and RAW to MP3\n    * MP3, WMA, OGG, AIFF, VOX, MP2, MPC/+, G.72x, AU, and RAW to WAV\n    * MP3, OGG, WAV, AIFF, VOX, MP2, MPC/+, G.72x, AU, and RAW to WMA\n    * MP3, WMA, OGG, AIFF, VOX, MP2, MPC/+, G.72x, AU, and RAW to OGG\n    * WAV/MP3/WMA/OGG to audio CD burning\n    * WAV/MP3 Compression\n    * Two-way video conversions among MPEG-1, MPEG-2, AVI, WMV, ASF, MOV, Multi-Page TIFF, and FLIC\n    * MPEG conversion options available for VCD, SVCD, and DVD compliant output\n\n\n","torrent":{"xt":"urn:btih:bda150aebbe8ed36eacea5d5ff4fdafe7f89552c","amp;dn":"Blaze+Media+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda150aebbe8ed36eacea5d5ff4fdafe7f89552c","infoHashBuffer":{"type":"Buffer","data":[189,161,80,174,187,232,237,54,234,206,165,213,255,79,218,254,127,137,85,44]},"announce":[],"urlList":[]}}