{"title":"The Twilight Zone Episode 7- The Lonely","uid":3842439,"size":386334276,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be355fd49f5fd0b0ce0a94a0bb8c19552e976ab3&amp;dn=The+Twilight+Zone+Episode+7-+The+Lonely&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"antil0ck","files":1,"time":1192412594,"description":"In 2046, an inmate sentenced to solitary confinement on the desert planet Ceres-XIV is visited by a spacecraft that regularly brings him supplies and news from the Earth. Captain Allenby has been trying to make Corry&amp;#039;s stay humanely tolerable by bringing him things to take his mind off the loneliness. On this trip, however, Allenby tells Corry to open a certain crate that has just been delivered until after the transport crew leaves. Upon opening the special container, Corry discovers that Allenby has left him with a a feminine robot, named Alicia, to keep him company. At first, Corry detests her, rejecting Alicia as a mere machine; synthetic skin and wires inside. However, when Corry sees that Alicia is in fact capable of crying, he begins to fall in love with her (and presumably, she with him).\n\nWhen the ship returns, Captain Allenby brings news that Corry has been pardoned after a review of past murder cases. Corry, it seems, can return home to earth immediately. Corry is delighted, until he learns that there is only room for 15 pounds of luggage, far too little for his robot companion. He frantically tries to find some way to take Alicia with him, arguing that she is not a robot, but a woman, and insisting that Allenby simply does not know her as he does. At that point, just as the rest of the transport crew is surprised at the sight of Alicia, Allenby suddenly draws his gun and shoots the robot in the face. He then takes Corry back to the ship, assuring him he will only be leaving behind loneliness.\n\n\nMP4 Format for your IPOD\n\nPLEASE SEED! \n\nEnjoy! \n\nAntil0ck\n\n\n_______       ______________________      ______  \n___    |________  /___(_)__  /_  __ \\________  /__\n__  /| |_  __ \\  __/_  /__  /_  / / /  ___/_  //_/\n_  ___ |  / / / /_ _  / _  / / /_/ // /__ _  ,&lt;   \n/_/  |_/_/ /_/\\__/ /_/  /_/  \\____/ \\___/ /_/|_| \n","torrent":{"xt":"urn:btih:be355fd49f5fd0b0ce0a94a0bb8c19552e976ab3","amp;dn":"The+Twilight+Zone+Episode+7-+The+Lonely","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be355fd49f5fd0b0ce0a94a0bb8c19552e976ab3","infoHashBuffer":{"type":"Buffer","data":[190,53,95,212,159,95,208,176,206,10,148,160,187,140,25,85,46,151,106,179]},"announce":[],"urlList":[]}}