{"title":"PidGin Application -LegalTorrents","uid":3813042,"size":11971040,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bec3c8d7649f96cda21f9f82de944b12f542bfb1&amp;dn=PidGin+Application+-LegalTorrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LegalTorrents","files":4,"time":1190299239,"description":"Pidgin is a multi-protocol instant messaging client for Linux, BSD, MacOS X, and Windows. It is compatible with AIM (Oscar and TOC protocols), ICQ, MSN Messenger, Yahoo, IRC, Jabber, Gadu-Gadu, and Zephyr networks.\n\nPidgin users can log in to multiple accounts on multiple IM networks simultaneously. This means that you can be chatting with friends on AOL Instant Messenger, talking to a friend on Yahoo Messenger, and sitting in an IRC channel all at the same time.\nPidgin supports many features of the various networks, such as file transfer (coming soon), away messages, typing notification, and MSN window closing notification. It also goes beyond that and provides many unique features. A few popular features are Buddy Pounces, which give the ability to notify you, send a message, play a sound, or run a program when a specific buddy goes away, signs online, or returns from idle; and plugins, consisting of text replacement, a buddy ticker, extended message notification, iconify on away, and more.\n\n\n\n-LEGAL TORRENTS\n\nPurpose:\n\ncreate a balance, share the already free stuff,\npublic domain works, freeware, free music,\nfree ebooks, articles, manifestos, movie trailers, and more.\n\nshow the copyright owners that torrent\nwebsites shouldn&amp;#039;t bear the responsibility\nof what their users upload, torrent websites\nare very much similar to google..\n\nusers upload what they want to upload,\ndownload what they want to download,\nand search for what they want to search..\n\nby creating this balance and sharing the already free\nstuff, we hope to take the pressure of torrent websites..\n\n","torrent":{"xt":"urn:btih:bec3c8d7649f96cda21f9f82de944b12f542bfb1","amp;dn":"PidGin+Application+-LegalTorrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bec3c8d7649f96cda21f9f82de944b12f542bfb1","infoHashBuffer":{"type":"Buffer","data":[190,195,200,215,100,159,150,205,162,31,159,130,222,148,75,18,245,66,191,177]},"announce":[],"urlList":[]}}