{"title":"Ramsays.Kitchen.Nightmares.S04E01.WS.PDTV.XviD-REM","uid":3572343,"size":364697600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bef203554361e74de9b1d0823cd9a1003953fb64&amp;dn=Ramsays.Kitchen.Nightmares.S04E01.WS.PDTV.XviD-REM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sotis","files":1,"time":1165485563,"description":"In the first show of the new series, Gordon takes on a nightmare restaurant abroad. La Parra de Burriana is an ex-pat restaurant in Nerja on the Spanish Costa del Sol. Nestling among the cafes lining the seafront offering all-day English breakfast and chips, La Parra is the brainchild of 26-year-old, ex-nightclub manager Laurence. He set himself up in business 18 months ago with a loan from his dad and, although he&amp;#039;s not an experienced chef, mans the kitchen on his own, determined to offer something better than chips to his largely British clientele.\n\nLaurence&amp;#039;s menu boasts 72 options including his unforgettable signature dish, prawns in garlic with chocolate sauce. Running front-of-house is Laurence&amp;#039;s mate, Alex and sous-chef, Norman, is on the barbecue serving up a haphazard combination of kebabs and steaks cooked by torchlight. The Mediterranean menu has a twist - no-one wants to eat it. The kebabs are raw. Alex has over-booked the place - and failed to clear up the dog mess that litters the dining room - and the punters that are still turning up face an interminable wait for their food.\n\nUnsurprisingly Laurence lost Â£22k last year but still resists Gordon&amp;#039;s attempts to introduce a simple menu that will bring customers back. Will Laurence survive the summer and Gordon&amp;#039;s efforts to get him to learn bullfighting? Can La Parra be saved, or will the sun set forever on Laurence&amp;#039;s Spanish dream.","torrent":{"xt":"urn:btih:bef203554361e74de9b1d0823cd9a1003953fb64","amp;dn":"Ramsays.Kitchen.Nightmares.S04E01.WS.PDTV.XviD-REM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef203554361e74de9b1d0823cd9a1003953fb64","infoHashBuffer":{"type":"Buffer","data":[190,242,3,85,67,97,231,77,233,177,208,130,60,217,161,0,57,83,251,100]},"announce":[],"urlList":[]}}