{"title":"The Twilight Zone Episode 32- A passage for trumpet","uid":3852366,"size":245135536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c08812c975b9f946e44f1c872ba875d7ac458890&amp;dn=The+Twilight+Zone+Episode+32-+A+passage+for+trumpet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"antil0ck","files":1,"time":1192998874,"description":"Waiting at the back door of a night club is Joey Crown, a down and out trumpet player. He hopes to see a former boss, Baron, to beg for a chance to work again. When Baron finds out Joey still drinks, he turns him away with some money &quot;For old times.&quot; Baron asks Joey why he let himself fall into his present state. &quot;Because I&amp;#039;m sad, because I&amp;#039;m nothing, because I&amp;#039;ll live and die in a crummy one-roomer with dirty walls and cracked pipes.&quot; Joey replies. He confesses his horn is half his language, &quot;I&amp;#039;m Gabriel with a golden horn. It comes out beauty.&quot; But only when he is drunk. Convinced he is washed up, Joey sells his &quot;Baby&quot; (his beloved trumpet) to Nate, a pawn shop owner, for $8.00; but when Nate puts it in the window, it has a $25.00 tag on it. From the other side of the window, Joey tries to object. Nate tells him, &quot;Guys like you don&amp;#039;t understand. What kind of responsibilities do you have? Nothin&amp;#039;, nothin&amp;#039; at all.&quot; Joey repeats the thought, &quot;No responsibilities... No nothin&amp;#039;!&quot; He decides he is tired of hanging around. Seeing a speeding truck barreling down the street, he steps off the curb and is hit.\n\nIt seems to be night. Joey finds himself on the sidewalk next to the street. He tries to explain what happened to a policeman, who completely ignores him. He walks down the street, asking a passerby for a light?nothing, no response. He tries to strike up a conversation with a woman at a ticket booth?again, nothing. He realizes that people can&amp;#039;t see or hear him, and discovers he has no reflection in a mirror. He is dead; just plain old deceased. &quot;For the first time in the very short career of Joey Crown, he was successful at something!&quot;\n\nAt the back of the night club. There in the shadows, he hears the sound of a trumpet playing and moves through the scaffolds to find where the music is coming from. He says, &quot;Don&amp;#039;t stop. It&amp;#039;s coming out beautiful.&quot; The trumpet player thanks Joey, who he knows by name, and tells him he plays a mean trumpet too. &quot;I know, I&amp;#039;m an expert on trumpets.&quot; Joey tells the man he tangled with a truck and now he is dead. The man tells Joey he is not dead. But what about the people on the streets, why they couldn&amp;#039;t see him. &quot;They are dead. They&amp;#039;re ghosts, Joey. They just don&amp;#039;t know it, that&amp;#039;s all.&quot; He goes on to explain: &quot;Right now you&amp;#039;re in a kind of limbo, Joey. You&amp;#039;re neither here nor there. You&amp;#039;re in the middle, between the two: the real and the shadow.&quot; The way to go is up to him, &quot;Which do you prefer? You&amp;#039;ve got a choice, you know. There&amp;#039;s still time.&quot; Somewhere he forgot all the good things. &quot;Well, if I&amp;#039;ve got a choice, I wanna go back!&quot; Joey says. The man advises Joey, &quot;You take what you get and live with it. Sometimes it&amp;#039;s sweet frosting, nice gravy. Sometimes it&amp;#039;s sour, goes down hard, but you live with it.&quot;\n\nThe man begins to leave but says, &quot;It&amp;#039;s a nice talent you got?to make music, an exceptional talent. Don&amp;#039;t waste it.&quot; As the man walks off under the scaffold lights, Joey asks his name. &quot;My name? It&amp;#039;s Gabe, short for &amp;#039;Gabriel.&amp;#039;&quot; As he says this, a round lamp just above his head offers an image of an angelic halo.\n\nJoey returns to the pawn shop window and, seeing the reflection of himself on the sidewalk, finds himself back in the street after the truck has &quot;hit&quot; him, but he is alive and well. The truck driver, not wanting his driving record tarnished, pushes some money into Joey&amp;#039;s hand. Joey buys the trumpet back from Nate. That night on the rooftop, while playing to himself, a girl approaches and tells him the music is beautiful. He tells her he&amp;#039;ll play anything she wants to hear, for as long as she wants. She tells him she is new in town, her name is Nan; and asks if he could show her the town. He tells her he knows all the sights and excitedly begins pointing them out from the rooftop.\n\n\nMP4 format for your IPOD\n\nPLEASE SEED! \n\nEnjoy! \n\n_______       ______________________      ______  \n___    |________  /___(_)__  /_  __ ________  /__\n__  /| |_  __   __/_  /__  /_  / / /  ___/_  //_/\n_  ___ |  / / / /_ _  / _  / / /_/ // /__ _  ,&lt;   \n/_/  |_/_/ /_/__/ /_/  /_/  ____/ ___/ /_/|_| ","torrent":{"xt":"urn:btih:c08812c975b9f946e44f1c872ba875d7ac458890","amp;dn":"The+Twilight+Zone+Episode+32-+A+passage+for+trumpet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c08812c975b9f946e44f1c872ba875d7ac458890","infoHashBuffer":{"type":"Buffer","data":[192,136,18,201,117,185,249,70,228,79,28,135,43,168,117,215,172,69,136,144]},"announce":[],"urlList":[]}}