{"title":"SAM2 Broadcaster","uid":3802562,"size":25310691,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c08fa79b341f51c6bfbf871d74b965ea02a7f568&amp;dn=SAM2+Broadcaster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mackelajt","files":1,"time":1189473200,"description":"Overview\nSAM2 Broadcaster is a professional DJ system with the ability to stream audio over the internet to listeners across the world.\nActually SAM2 is much more than just a &quot;DJ system&quot; - it is a COMPLETE radio automation solution - a &quot;radio station in a box&quot;.\n\nLeading the way for over 5 years!\nSAM2 was specifically designed with the needs of online broadcasters in mind. We listened to our loyal users over the last 5 years - and SAM2 Broadcaster was the result. SAM2 is UNBEATABLE in price, features and power!\nNo wonder the TOP online radio stations rely on our technology to broadcast their stations 24/7...\n\n    * SAM2 delivers professional sound with crossfading, gap killer, beat matching, volume normalization and compressor/limiter.\n    * Smartly handles LARGE media libraries - sorting them into easy-to-manage categories.\n    * Advanced playlist rotation logic and scheduling will make your station sound professional - even if you are not in front of your computer!\n    * The most advanced streaming encoders - able to encode MP3, mp3PRO, WM9 and Ogg!\n    * Support for all major streaming servers, including SHOUTcast, Live365, IceCast, Windows Media and P2P Streamer.\n    * View statistics in real-time: Know how many listeners are connected at any given moment.\n    * Interfaces directly with your website to allow automated song requests and improve the experience of your listeners by providing them with Artist, Title, Album, Cover art and other information on songs being played.\n    * Generate additional revenue with Buy CD links\n    * And MUCH more....\n\n ","torrent":{"xt":"urn:btih:c08fa79b341f51c6bfbf871d74b965ea02a7f568","amp;dn":"SAM2+Broadcaster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c08fa79b341f51c6bfbf871d74b965ea02a7f568","infoHashBuffer":{"type":"Buffer","data":[192,143,167,155,52,31,81,198,191,191,135,29,116,185,101,234,2,167,245,104]},"announce":[],"urlList":[]}}