{"title":"F-SECURE INTERNET SECURITY V2008-MAGNiTUDE","uid":3829627,"size":237663872,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c156e212a342468b9791d8bea72adb404db5646a&amp;dn=F-SECURE+INTERNET+SECURITY+V2008-MAGNiTUDE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":16,"time":1191510906,"description":"Once again, security software has been released by a cracking group. This time it?s the latest version of F-Secure Internet Security, and comes packed with only a text file containing a serial. Not much else to say about this one?\n\nF-SecureÂ® Internet Security 2008 provides a complete and easy-to-use protection against all Internet threats, whether they are known or previously unidentified. It includes an award-winning antivirus, an easy-to-use personal firewall, antispyware and F-Secure DeepGuard? technology that constantly monitors the very heart of your computer, ensuring that no malicious programs can take over your computer even if you do not have all the latest updates. In addition, the product filters unwanted spam and so-called phishing attempts from your e mail, and with the parental control, you can block access to websites with questionable content.\n\nProgram Features:\n\n    * Protects your computer against viruses, worms and unknown attacks\n      With daily automatically updated virus protection from the world-renowned F-Secure Data Security Laboratory and F-Secure DeepGuard TM technology that protects you against zero-day attacks and other future threats, you can safely use your computer, now and tomorrow.\n    * Detects and removes spyware from your computer\n      F-Secure Internet Security detects and removes secretly installed software from your computer better than ever before, ensuring that your system is running smoothly and clean of spyware.\n    * Protects your computer against hackers\n      You can keep your private data to yourself with the personal firewall that stops hackers from breaking into your computer.\n    * Helps you stay free from spam e-mail and phishing attempts\n      F-Secure Internet Security filters unwanted spam and e-mail schemes designed to steal your private information.\n    * Protects your children against unwanted Internet content\n      F-Secure Internet Security ensures that your children or teenagers do not enter objectionable sites or surf the Internet when you are not around.\n\nSystem Requirements:\n\n    * Windows Vista (32-bit editions)\n    * Windows XP Home Edition\n    * Windows XP Professional\n    * Windows XP Media Center Edition\n    * Windows 2000 (Workstation only)\n\nRelease Name: F-SECURE.INTERNET.SECURITY.V2008-MAGNiTUDE\nSize: 226.66 MB (237,671,298 bytes), m-fs2008","torrent":{"xt":"urn:btih:c156e212a342468b9791d8bea72adb404db5646a","amp;dn":"F-SECURE+INTERNET+SECURITY+V2008-MAGNiTUDE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c156e212a342468b9791d8bea72adb404db5646a","infoHashBuffer":{"type":"Buffer","data":[193,86,226,18,163,66,70,139,151,145,216,190,167,42,219,64,77,181,100,106]},"announce":[],"urlList":[]}}