{"title":"New.Applications.Software.of.the.Day.September.16.07-LegalTorren","uid":3807993,"size":20740485,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c2c14fc1d6dc33af0225e32f8c5676b2cf53ea29&amp;dn=New.Applications.Software.of.the.Day.September.16.07-LegalTorren&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LegalTorrents","files":11,"time":1189887340,"description":"Pack Includes 8 Different Apps...\nTake Your Pick\n\n[b]Add/Remove Pro 2.10[/b]\n\nAdd/Remove Pro displays the entries in the Add/Remove Programs list of Windows Registry, checks if each is valid, and uninstalls the selected program or removes the entry from the list.\n\n[b]Disk Heal v1.37[/b]\n\nDisk Heal is a useful tool that performs many useful functions including tweaks, fixes disk problems and more! Visit the Ã‚Â´featuresÃ‚Â´ page on the home page for an extensive description of all its features.\n\n[b]IPaddress 2.0.5[/b]\n\nWant a quick view of your IP Address? Then get IPaddress. ItÃ‚Â´s a tiny utility that checks your IP Address and lets you copy it to the computerÃ‚Â´s clipboard. Easily paste it from there into whatever application or document that requires it.\n\n[b]Microsoft Process Explorer 11.02[/b]\n\nProcess Explorer shows you information about which handles and DLLs processes have opened or loaded.\nThe Process Explorer display consists of two sub-windows. The top window always shows a list of the currently active processes, including the names of their owning accounts, whereas the information displayed in the bottom window depends on the mode that Process Explorer is in: if it is in handle mode you&amp;#039;ll see the handles that the process selected in the top window has opened; if Process Explorer is in DLL mode you&amp;#039;ll see the DLLs and memory-mapped files that the process has loaded. Process Explorer also has a powerful search capability that will quickly show you which processes have particular handles opened or DLLs loaded.\n\nThe unique capabilities of Process Explorer make it useful for tracking down DLL-version problems or handle leaks, and provide insight into the way Windows and applications work.\n\nWhat&amp;#039;s new in Version 11.0:\n\n    * New treelist control for better UI responsiveness\n    * Asynchronous thread symbol resolution on threads tab of process properties\n    * More flags on groups in security tab and SID display\n    * Thread IDs on threads tab\n    * On-line search uses default web browser and search engine\n    * Vista ASLR column for processes and DLLs\n    * Vista Process and thread I/O and memory priorities in process and thread properties\n    * Vista Process and thread I/O and memory columns\n    * PROCESS_QUERY_LIMITED_INFORMATION support on process permissions on Vista\n    * Run as limited user runs with low IL on Vista\n    * Reports information for all object types on Vista\n    * Show details for all processes elevation menu item on Vista\n    * Supports replacement of task manager on Vista\n    * /e to launch elevated\n    * /s switch to select a process at startup\n    * Compiled w/ASLR, DEP\n    * Faster startup\n    * Miscellaneous bug fixes and minor improvements \n\n[b]PIXresizer 2.0.2[/b]\n\nPIXresizer is a tool for quickly generating screen-friendly versions of your images with dramatically reduced file sizes. It is a photo resizing program that enables you to quickly resize one file or a selection of image files for use on the web and in e-mail. The reduced files are saved in a different directory, so your original pictures are not changed.\n\nThe program offers several different resizing methods to choose from and can automatically recognize image sizes to calculate the best fit. PIXresizer includes a built-in image viewer and you can also convert between graphics formats: it opens and saves in .bmp, .gif, .jpg, .png, and .tif formats. A great companion for webmasters and digital photographers.\n\n[b]Belarc Advisor 7.2.20.8[/b]\n\nBelarc Advisor shows all the hardware and software installed on your PC right in your Web browser. You will see personalized advice on how well software and hardware products will work with your computer, along with a detailed description of your computer profile. All of your profile information is kept in privacy on your PC and is not sent to a Web server. The program also keeps your software serial numbers.\n\n[b]Pidgin (Formerly Gaim) 2.2.0[/b]\n\nPidgin is a multi-protocol instant messaging client for Linux, BSD, MacOS X, and Windows. It is compatible with AIM (Oscar and TOC protocols), ICQ, MSN Messenger, Yahoo, IRC, Jabber, Gadu-Gadu, and Zephyr networks.\n\nPidgin users can log in to multiple accounts on multiple IM networks simultaneously. This means that you can be chatting with friends on AOL Instant Messenger, talking to a friend on Yahoo Messenger, and sitting in an IRC channel all at the same time.\nPidgin supports many features of the various networks, such as file transfer (coming soon), away messages, typing notification, and MSN window closing notification. It also goes beyond that and provides many unique features. A few popular features are Buddy Pounces, which give the ability to notify you, send a message, play a sound, or run a program when a specific buddy goes away, signs online, or returns from idle; and plugins, consisting of text replacement, a buddy ticker, extended message notification, iconify on away, and more.\n\n[b]Baku 3.0[/b]\n\nBaku allows you to search for system registry errors and unneeded files that can be safely removed.\n\nFeatures:\n\n    * Deletes empty folders, Ã‚Â´HistoryÃ‚Â´ folder contents, Ã‚Â´Recent documentsÃ‚Â´ folder contents, Ã‚Â´TempÃ‚Â´ folder contents, temporary internet files, cookies.\n    * Searches Windows log files, shortcuts to missing files and folders and user specified file types.\n    * Registry scan removes unused and obsolete keys, including ActiveX/COM, Application Paths, Fonts, Help files, Icon files, Sound files, Uninstall Programs and Windows Installer.\n    * The registry is automatically backed up before any changes are made. \n\n\n\n-LEGAL TORRENTS\n\nPurpose:\n\ncreate a balance, share the already free stuff,\npublic domain works, freeware, free music,\nfree ebooks, articles, manifestos, movie trailers, and more.\n\nshow the copyright owners that torrent\nwebsites shouldn&amp;#039;t bear the responsibility\nof what their users upload, torrent websites\nare very much similar to google..\n\nusers upload what they want to upload,\ndownload what they want to download,\nand search for what they want to search..\n\nby creating this balance and sharing the already free\nstuff, we hope to take the pressure of torrent websites..\n","torrent":{"xt":"urn:btih:c2c14fc1d6dc33af0225e32f8c5676b2cf53ea29","amp;dn":"New.Applications.Software.of.the.Day.September.16.07-LegalTorren","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2c14fc1d6dc33af0225e32f8c5676b2cf53ea29","infoHashBuffer":{"type":"Buffer","data":[194,193,79,193,214,220,51,175,2,37,227,47,140,86,118,178,207,83,234,41]},"announce":[],"urlList":[]}}