{"title":"Ashampoo Music Studio 3 ver.3.10","uid":3579111,"size":11901016,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c40f894062115cdd3cd0400f664283a1d5c374b0&amp;dn=Ashampoo+Music+Studio+3+ver.3.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LionDance","files":3,"time":1166430230,"description":"The complete digital music solution: Rip, edit, convert, record, repair and burn. Do you like music? Do you use a computer? Then you need Ashampoo Music Studio 3. This program always been a favorite of digital music fans and the latest version now includes everything you need to create, edit and manage your digital music collection. And using it is nearly as simple as operating a CD player. Ashampoo Music Studio 3 can rip CDs, import CD data, create playlists, burn, edit, record, repair. Version 3.1 features multi-format CD ripping, audio recording, file organization, Audio file editing, CD, DVD and Blu-ray burning, extended playlist import support, improved damaged file repair features.\n\nAshampoo Music Studio 3 at a glance:\nRip CDs: You can rip (copy) tracks from audio CDs directly to the format of your choice (WMA, MP3, Ogg, FLAC and WAV).\nImport CD data: Automatically import album, title and track details for your audio CDs from an online database.\nPlaylists: Import external playlists in M3U, PLS, ASX, P4U and WPL formats.\nBurn: Burn your playlists to regular audio CDs or Data CDs, DVDs or Blu-ray discs containing digital audio tracks in single or mixed formats.\nEdit: Edit your audio tracks. Change the title, artist etc. Convert your tracks to other formats. Cut, mix and modify your tracks. Fade in, fade out, mix, crossfade, change volume, insert silence etc. Normalize volume levels.\nRecord: Record directly from all your sound card inputs (microphone, line in etc.) and store the tracks directly as WMA, MP3, Ogg, FLAC or WAV files.\nRepair: Find, move and repair damaged digital audio files.\nWhat?s new and cool:","torrent":{"xt":"urn:btih:c40f894062115cdd3cd0400f664283a1d5c374b0","amp;dn":"Ashampoo+Music+Studio+3+ver.3.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c40f894062115cdd3cd0400f664283a1d5c374b0","infoHashBuffer":{"type":"Buffer","data":[196,15,137,64,98,17,92,221,60,208,64,15,102,66,131,161,213,195,116,176]},"announce":[],"urlList":[]}}