{"title":"Flock of Dodos","uid":3822742,"size":4681820160,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c4c3dd7b526dfc2b0ec7efd9b2abce24b37206d6&amp;dn=Flock+of+Dodos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brokenglass","files":1,"time":1191006442,"description":"Flock of Dodos is a documentary film by American evolutionary biologist and filmmaker Randy Olson. It highlights the debate between proponents of the concept of intelligent design and the scientific establishment that supports evolution.\n\nFlock of Dodos examines the disagreements that proponents of intelligent design have with the overwhelming scientific consensus position of evolution. The evolutionarily famous dodo is a now-extinct bird that lived on the Island of Mauritius, which is approximately 500 miles east of Madagascar. When Portuguese sailors arrived on the island, the possible combination of over-hunting and introduction of new predators (i.e. pigs, macaques) seems to have led to its extinction by approximately 1700. Due to its lack of fear of humans and inability to fly, the dodo was easy prey, and thus became known for its apparent stupidity. It failed to change with an evolving environment, which ultimately led to the birds\\&amp;#039; demise.\n\nThe film attempts to determine who the real \\&quot;dodos\\&quot; are in a constantly evolving world: the scientists who are failing to promote evolution as a scientifically accepted fact, the intelligent design advocates, or the American public who get fooled by the salesmanship of the Discovery Institute. While Randy Olson ultimately sides with the scientists who accept evolution, he gives equal air time to both sides of the argument, including intelligent design proponent Michael Behe and several of his colleagues.\n\nThe film begins by going over the history of intelligent design thought from Plato and Paley to the present day incarnation promoted by the Discovery Institute. Olson mixes in humorous cartoons of squawking dodos with commentary from his mother and interviews with proponents on both sides of the intelligent design evolution debate.\n\nOn the intelligent design side Olson interviews Mike Behe, John Calvart (founder of the ARN Network) and a member of the Kansas school board. Olson also unsuccessfully tries to interview Kansas school board member Connie Morris and members of the Discovery Institute.","torrent":{"xt":"urn:btih:c4c3dd7b526dfc2b0ec7efd9b2abce24b37206d6","amp;dn":"Flock+of+Dodos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c3dd7b526dfc2b0ec7efd9b2abce24b37206d6","infoHashBuffer":{"type":"Buffer","data":[196,195,221,123,82,109,252,43,14,199,239,217,178,171,206,36,179,114,6,214]},"announce":[],"urlList":[]}}