{"title":"The Stonewalkers UNABRIDGED by Vivien Alcock Read by Carole Haym","uid":3561379,"size":56361925,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c4c43f18943bdcfc7563444feebd3a3924476580&amp;dn=The+Stonewalkers+UNABRIDGED+by+Vivien+Alcock+Read+by+Carole+Haym&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JohnstonDJ","files":19,"time":1164061959,"description":"The Stonewalkers\nUNABRIDGED\nBy Vivien Alcock\n\nRead By Carole Hayman\n\n\nEveryone is so tired of Poppy Brown&amp;#039;s stories that Poppy has begun talking to garden statues. When her favorite statue, Belladonna, is struck by lightning and comes to life, Poppy must find a human who will listen! Poppy&amp;#039;s classmate Emma is skeptical, but curious enough to help Poppy investigate the living statues, which are disappearing from gardens all over town and assembling somewhere on the moors. What seemed fascinating at first soon becomes terrifying as the two girls are captured by the creatures they had observed - creatures who are at once beautiful, spiteful, and as unfeeling as the stone they&amp;#039;re made of.\n\nVivien Alcock is best described as the Alfred Hitchcock of children&amp;#039;s literature. Don&amp;#039;t laugh, cause I mean it sincerely. She is a master of suspense in juvenile fiction. Her books, when they are realistic, are all about crazy mind games and deceit (as in her &quot;Vertigo&quot;-like, &quot;The Sylvia Game&quot;). Alfred Hitchcock was often ready to dip in surrealistic horror as in &quot;The Birds&quot;, and to that extent, &quot;The Stonewalkers&quot; is Alcock&amp;#039;s undeniable equivalent. Hitchcock made us nervous of the avian menace perched just above our heads. Alcock makes us nervous of our stone neighbors hanging out on our streets, sidewalks, and walkways. The statues can no longer be trusted.\n\nOgg Format -q -1\nFrom an old three cassette set of mine.....best quality of the tapes I have ripped recently.\n\nPlease Seed &amp; Comment.....thank you","torrent":{"xt":"urn:btih:c4c43f18943bdcfc7563444feebd3a3924476580","amp;dn":"The+Stonewalkers+UNABRIDGED+by+Vivien+Alcock+Read+by+Carole+Haym","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c43f18943bdcfc7563444feebd3a3924476580","infoHashBuffer":{"type":"Buffer","data":[196,196,63,24,148,59,220,252,117,99,68,79,238,189,58,57,36,71,101,128]},"announce":[],"urlList":[]}}