{"title":"OSX10.4.10 Vmware Appliance","uid":3953960,"size":1229872903,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c72fb0a00bb0e42784939357831c3d8c3f376532&amp;dn=OSX10.4.10+Vmware+Appliance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KoreanHongKildong","files":2,"time":1199035671,"description":"This is SynthetiX`S nice work.\n\n--------------\n[SynthetiX]\n\nThis is a vmware virtual machine (appliance) with the lastest and Greatest Mac OS 10.4.10 preinstalled.  This Virtual Machine works in Vmware for Windows, Linux, and VMware FUSION for OS X.  Full networking Support!!!  This VM is MUCH faster than the old 10.4.3 vmware image (deadmoo image) that is still circulating around the torrent networks.\n\nAs long as your system is SSE3, it should work fine.  Enjoy.  \n\n---------------- \n[good4man]\n\n( Hello, nooby question here but what exactly is this? Does it allow you to run OSX 10.4 in a windows enviroment? )\nThis is VMware Image(vmx file).\n- Installing VMware in xp or VMware Fusion in leopard =&gt;  Double-clicking FreeBSD.vmx in OSX folder in OSX.rar =&gt; Running 10.4.10 in VMware or VMware Fusion\n\n( since you say sse3 i guess this was installed from a uphuck intel version rather than amd? )\nI don`t know if it works or not on ADM System.\nI tried it on my PC ( Intel-sse3) and installed VMware 6 on XPSP2, and it works fine on VMware6. ( Sound and Internet as well )\n\n----------------\n[enclosed]\n\nThis does work in an AMD enviroment, and if you upgrade the VMware workstation from 4 to 6 you can add a second processor if you have a dual processor machine like i do. Also you can network this to the host machine and it can read and write to NTFS, so you can add files onto the mac hd(good for adding apps like iLife). Another thing you can do is change the screen resolution by editing a file to add the resolution you want, if you search on google there are some good how-to&amp;#039;s about setting up OSx86 in vm. Thanks for the upload. ","torrent":{"xt":"urn:btih:c72fb0a00bb0e42784939357831c3d8c3f376532","amp;dn":"OSX10.4.10+Vmware+Appliance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c72fb0a00bb0e42784939357831c3d8c3f376532","infoHashBuffer":{"type":"Buffer","data":[199,47,176,160,11,176,228,39,132,147,147,87,131,28,61,140,63,55,101,50]},"announce":[],"urlList":[]}}