{"title":"Bill Witers Live at Carnagie Hall(rar)","uid":3785849,"size":110837315,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c781576e056a3d579ef6ac43637f9b6101ac5217&amp;dn=Bill+Witers+Live+at+Carnagie+Hall%28rar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"crazytoyboy","files":1,"time":1188221226,"description":"        1. Use Me \t\t\n\t2. Friend Of Mine \t\t\n\t3. Ain&amp;#039;t No Sunshine \t\t\n\t4. Grandma&amp;#039;s Hands \t\t\n\t5. World Keeps Going Around \t\t\n\t6. Let Me In Your Life \t\t\n\t7. Better Off Dead \t\t\n\t8. For My Friend \t\t\n\t9. I Can&amp;#039;t Write Left-Handed \t\t\n\t10. Lean On Me \t\t\n\t11. Lonely Town, Lonely St... \t\t\n\t12. Hope She&amp;#039;ll Be Happier \t\t\n\t13. Let Us Love \t\t\n\t14. Harlem\nBiography\nWest Virginia native Bill Withers joined the L.A. music scene in the late 60s after a stint in the Navy.  In 1970 he was signed to the Sussex music label and hit the ground running with his first album, Just As I Am, and its instantly classic acoustic ballad, &quot;Ain&amp;#039;t No Sunshine.&quot;  Withers&amp;#039; understated, rootsy style was a perfect contrast to where popular music was going at the time, from pre-disco dance music to glam rock.  His second release, 1972&amp;#039;s Still Bill, became a career disc, with top hits &quot;Use Me&quot; and &quot;Lean On Me,&quot; arguably one of the greatest songs of the past half century.\n\nWithers was fairly prolific over the next half decade, releasing +Justments, Making Music, Naked and Warm, Menagerie and &amp;#039;Bout Love.  And while those discs were of somewhat uneven quality, each contained enough jaw-dropping material to make the album work overall.  It was these select, wonderfully melodic cuts, from &quot;Lovely Day&quot; to &quot;Hello Like Before,&quot; that would make Withers&amp;#039; music continue to resonate nearly 30 years later through dozens of remakes by other acts.\n\nAfter seven years of consistent recording and touring, Withers went quiet, maddening record executives -- and some fans -- who had grown accustomed to his annual output.  Disagreements with his record label and, according to Withers, the refusal of the label to allow him to record, kept him from releasing an album for seven years.  In the meantime, he appeared as a guest vocalist on Grover Washington&amp;#039;s #1 hit, &quot;Just the Two of Us&quot; and Ralph McDonald&amp;#039;s &quot;In the Name of Love.&quot;  His silence was finally broken with 1985&amp;#039;s Watching You Watching Me, an unfortunately overlooked album that was one of the best of his career and showed a great artist maturing wonderfully. Featuring the uptempo &quot;Oh Yeah&quot; and a number of beautiful ballads, it is worth seeking out.\n\nFrustrated with the music industry, Withers then stopped actively recording, although much of his rich catalog has been regularly covered by other artists.  He toured intermittently into the 90s, but then generally ceased performing publicly.\n\nOver the past half decade his recordings have received renewed interest and are represented in repackaged, remastered discs.\n\nIn 2004, Withers recorded a nice duet with singer Jimmy Buffett, &quot;Playin the Loser Again,&quot; which appeared on Buffett&amp;#039;s License to Chill.  Then in June 2005, around the time of his 67th birthday, Withers was selected for induction into the Songwriters Hall of Fame. \n\nBy Chris Rizik","torrent":{"xt":"urn:btih:c781576e056a3d579ef6ac43637f9b6101ac5217","amp;dn":"Bill+Witers+Live+at+Carnagie+Hall%28rar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c781576e056a3d579ef6ac43637f9b6101ac5217","infoHashBuffer":{"type":"Buffer","data":[199,129,87,110,5,106,61,87,158,246,172,67,99,127,155,97,1,172,82,23]},"announce":[],"urlList":[]}}