{"title":"michael lee firkins - 1996 - Cactus Cruz mp3 @ 256","uid":3694315,"size":96542890,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c887fd86e94bdb66a511d5d57b3a8162bb3537a7&amp;dn=michael+lee+firkins+-+1996+-+Cactus+Cruz+mp3+%40+256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zaftra","files":16,"time":1179840998,"description":"1. Freeway Lines \n2. Grandma Dynomite\n3. Saturday Night\n4. Kick Ass Bill\n5. Dollar Blues \n6. Midnight Surf \t\n7. Where Am I? \t\n8. San Lucas \t\n9. I Witness \t\n10. Sanford &amp; Son Theme (The Streetbeater) \t\n11. Reprise\n\nichael Lee Firkins was born in Omaha, Nebraska in 1967. Born to musician parents, his father was a lap steel guitarist and his mother a pianist, he started playing acoustic guitar at the young age of eight. Mostly self taught, he also took lessons at a local Omaha music store. Learning the songs of the times, Michael was heavily into Lynyrd Skynyrd, Led Zeppelin, AC/DC, and Black Sabbath.\n\nBy 1979 Michael had a Gibson SG and a Fender Princeton Reverb. Electrified, he soon played in local bands and in church from the age of 12 until 18. In 1985 Michael started touring the country in cover tune bands. Frustrated with cover tunes, he eventually went back to Omaha and began teaching guitar.\n\nFor the next few years, Michael&amp;#039;s musical influences were expanding. Jerry Reed, Chet Atkins, Albert Lee, and Danny Gatton were among the list of new favorites. As Michael continued to grow musically, he recorded a 5 song demo of instrumental guitar tunes that showcased his guitar playing. The 5 song demo was sent to Shrapnel Records who signed Firkins immediately. A release of his first album was soon to follow.\n\nIn 1990, Michael released his self titled debut album on Shrapnel Records . This release showcased Michael&amp;#039;s signature sound of rock blended with country, blues and jazz. With the strength of this album, and the help of an international advertising campaign from YAMAHA GUITARS , Michael&amp;#039;s first release sold more than 100,000 copies. This well received album also landed Michael the winner of the ?BEST NEW TALENT? reader&amp;#039;s poll in Guitar Player magazine and Guitar for the Practicing Musician. .. He was also hailed as ?ONE OF THE MOST INFLUENTIAL PLAYERS OF THE NEXT TEN YEARS? by Guitar for the Practicing Musician. As Michael&amp;#039;s music was also popular in Europe, Firkins won the Edison Award, which is Holland&amp;#039;s version of a Grammy.\n\nMichael went on to release 3 more records for the Shrapnel label. The second album, The Howling Iguanas in 1994, (Blues Bureau International) was a blues rock record echoing past influences. The third, Chapter Eleven, followed in 1995. This record had even more diverse music styles including a cover of Duke Ellington&amp;#039;s ?The Mooche?. Cactus Cruz was the last recording for Shrapnel in 1996. It&amp;#039;s a blues rock explosion of guitar where Firkins plays the theme from Sanfred and Son!\n\nIn 1997, Firkins recorded Decomposition. An album of mostly covers, Firkins continues to retrace his footsteps searching for the reasons behind his influences. Decomposition features Sonny Reese with guest spots on lead vocals, recreating the original blues rock sound of Lynyrd Skynyrd&amp;#039;s ?I Know A Little? and Johnny Winter&amp;#039;s ?Still Alive and Well?. Firkins&amp;#039; renditions of Henry Mancini&amp;#039;s ?Pink Panther? and Jimi Hendrix&amp;#039;s ?Manic Depression? make this album a worthy tribute.\n\nThe next release for Firkins is an all star tribute to Sly And The Family Stone featuring Firkins on guitar as well as Stanton Moore from the band Galactic on drums, Charlie Hitchcock, guitarist of Particle, Chuck Prada of the Black Eyed Peas on percussion, and Eric Levy, Kai Eckhardt,and Fareed Hague of Garajmahall, due out in May 2004 on MAGNATUDE. Look out for Michael&amp;#039;s next release in 2004 featuring him on lead vocals, slide guitar, lap steel, ala jamband thank you maam..","torrent":{"xt":"urn:btih:c887fd86e94bdb66a511d5d57b3a8162bb3537a7","amp;dn":"michael+lee+firkins+-+1996+-+Cactus+Cruz+mp3+%40+256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c887fd86e94bdb66a511d5d57b3a8162bb3537a7","infoHashBuffer":{"type":"Buffer","data":[200,135,253,134,233,75,219,102,165,17,213,213,123,58,129,98,187,53,55,167]},"announce":[],"urlList":[]}}