{"title":"[Kung Fu] Cinema Of Vengeance (Jackie Chan, Sammo Hung, Bruce Le","uid":3806841,"size":337881282,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c889b62332078ad44477e2d061ad0ba2413805f4&amp;dn=%5BKung+Fu%5D+Cinema+Of+Vengeance+%28Jackie+Chan%2C+Sammo+Hung%2C+Bruce+Le&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"JamesKees","files":6,"time":1189809284,"description":"Cinema Of Vengeance (Jackie Chan, Sammo Hung, Bruce Lee, 1994)\n\n\nPlot:\t&quot;Cinema Of Vengeance&quot; is the essential history of martial arts and the movies, covering fifty hears of Chinese action cinema from the late forties through to today&amp;#039;s high-tech, bullet-ridden blockbusters from John Woo.\n\nOverview:\t&quot;Cinema Of Vengeance&quot; is the essential history of martial arts and the movies, covering fifty hears of Chinese action cinema from the late forties through to today&amp;#039;s high-tech, bullet-ridden blockbusters from John Woo.\n\nThe man who brought martial arts movies the most recognition was the legendary Bruce Lee, who introduced kung fu to western audiences. There is still no comparison to his lightning quick abilities and screen charisma, however, his untimely death in July 1973 left the martial arts film community in despair fostering countless imitators.\n\nOther Hong Kong filmmakers had different plans and visions, and produced films based on the Shaolin Temple, the ninja, and the kickboxing genres. As audiences thirsted for more and more action, a &quot;new wave&quot; of filmmakers brought new standards and fresh ideas. Today&amp;#039;s maestro of artistic violence, John Woo, now directs blockbuster movies in Hollywood, including &quot;Face/Off&quot; and &quot;Broken Arrow&quot;.\n\n&quot;Cinema Of Vengeance&quot; features previously unseen footage and an exclusive interview with Bruce Lee, as well as profile of John Woo, Jackie Chan, Cynthia Rothrock, Chow Yun Fat, Sammo Hung, Jimmy Wang Yu, and many others.\n\nOne thing remains, supported by generation upon generation, these films will always have an audience.\n\nCast: \tBruce Lee  ||  Jackie Chan (Sing Lung)  ||  Chow Yun Fat  ||  Jean-Claude Van Damme  ||  Sammo Hung (Kam Bo)  ||  John Woo  ||  Cynthia Rothrock  ||  Jimmy Wang Yu \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.3145/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.3145/qx/details.htm&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:c889b62332078ad44477e2d061ad0ba2413805f4","amp;dn":"%5BKung+Fu%5D+Cinema+Of+Vengeance+%28Jackie+Chan%2C+Sammo+Hung%2C+Bruce+Le","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c889b62332078ad44477e2d061ad0ba2413805f4","infoHashBuffer":{"type":"Buffer","data":[200,137,182,35,50,7,138,212,68,119,226,208,97,173,11,162,65,56,5,244]},"announce":[],"urlList":[]}}