{"title":"[eknt] Principles of Computerized Tomographic Imaging","uid":3565055,"size":28911128,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc9f44bb5b125359ca3b1909e2a9c5db40e2203f&amp;dn=%5Beknt%5D+Principles+of+Computerized+Tomographic+Imaging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eknt","files":1,"time":1164519464,"description":"Book Description\nPrinciples of Computerized Tomographic Imaging provides a comprehensive, tutorial-style introduction to the algorithms for reconstructing cross-sectional images from projection data and contains a complete overview of the engineering and signal processing algorithms necessary for tomographic imaging. In addition to the purely mathematical and algorithmic aspects of these algorithms, the book also discusses the artifacts caused by the nature of the various forms of energy sources that can be used for generating the projection data. Kak and Slaney go beyond theory, emphasizing real-world applications and detailing the steps necessary for building a tomographic system. \n\nSince the fundamental aspects of tomographic reconstruction algorithms have remained virtually the same since this book was originally published, it is just as useful today as it was in 1987. It explains, among other things, what happens when there is excessive noise in the projection data; when images are formed from insufficient projection data; and when refracting or diffracting energy sources are used for imaging. Anyone interested in these explanations will find a wealth of useful information in this book. \n\nAudience \nBeginning graduate students or practitioners wishing to see the development of the algorithm from the ground up, as well as anyone interested in cross-sectional imaging for a wide variety of applications, will find this book extremely useful.\n\nPaperback: 327 pages\nPublisher: Society for Industrial &amp; Applied Mathematics; New Ed edition (July 1, 2001)\nLanguage: English\nISBN: 089871494X\n\n\nwww.amazon.com/Principles-Computerized-Tomographic-Classics-Mathematics/dp/089871494X\t\n\n\nMD5SUM: f26db49c7ea0a04f7f1835cc27891299","torrent":{"xt":"urn:btih:cc9f44bb5b125359ca3b1909e2a9c5db40e2203f","amp;dn":"%5Beknt%5D+Principles+of+Computerized+Tomographic+Imaging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc9f44bb5b125359ca3b1909e2a9c5db40e2203f","infoHashBuffer":{"type":"Buffer","data":[204,159,68,187,91,18,83,89,202,59,25,9,226,169,197,219,64,226,32,63]},"announce":[],"urlList":[]}}