{"title":"911.Press.for.Truth.DVDRip.XviD-STT.avi","uid":3576503,"size":733638656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cdfbf263433d44c35d43bcd99db3b8547f19121e&amp;dn=911.Press.for.Truth.DVDRip.XviD-STT.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tuzmor","files":1,"time":1166094512,"description":"Following the attacks of September 11th, a small group of grieving families waged a tenacious battle against those who sought to bury the truth about the event?including, to their amazement, President Bush. In ?9/11 PRESS FOR TRUTH?, six of them, including three of the famous ?Jersey Girls?, tell for the first time the powerful story of how they took on the greatest powers in Washington?and won!?compelling an investigation, only to subsequently watch the 9/11 Commission fail in answering most of their questions.\n\nAdapting Paul Thompson?s definitive Complete 9/11 Timeline (published by HarperCollins as ?The Terror Timeline?), the filmmakers collaborate with documentary veterans Globalvision (?WMD: Weapons of Mass Deception?, ?Beyond JFK?) to stitch together rare overlooked news clips, buried stories, and government press conferences, revealing a pattern of official lies, deception and spin. As a result, a very different picture of 9/11 emerges, one that raises new and more pressing questions.\n\nWhat actions were taken by top government officials who received dozens of specific warnings before the attack? Was Osama Bin Laden and his top al Qaeda leadership allowed to escape U.S. forces in Afghanistan? And what has been the reason for the deliberate obscuring of evidence for state sponsorship? Perhaps the most important one of all: Why, five years later, are so many of the families? questions still unanswered?","torrent":{"xt":"urn:btih:cdfbf263433d44c35d43bcd99db3b8547f19121e","amp;dn":"911.Press.for.Truth.DVDRip.XviD-STT.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdfbf263433d44c35d43bcd99db3b8547f19121e","infoHashBuffer":{"type":"Buffer","data":[205,251,242,99,67,61,68,195,93,67,188,217,157,179,184,84,127,25,18,30]},"announce":[],"urlList":[]}}