{"title":"[Kung_Fu]_Drunken Monkey (Jason Wu Jing, 2003) CN - DVD/Rmvb","uid":3859932,"size":446556185,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cef6be4dfc8b6ef19c063c6f2773a1e4c997ce13&amp;dn=%5BKung_Fu%5D_Drunken+Monkey+%28Jason+Wu+Jing%2C+2003%29+CN+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":8,"time":1193421948,"description":"Drunken Monkey (Jason Wu Jing, 2003) CN - Rmvb\n\nAvg. Rating:  3.7 / 5 (based on 12 ratings).\n\nPlot: &quot;Drunken Monkey&quot; is the first real martial arts movie of the new millennium. True martial arts legend Lau Kar Leung directs martial arts prodigy Wu Jing (a younger classmate of Jet Li) and newcomer Shannon Yao in martial arts action set in 1930s China. \n \nOverview: Celestial Pictures is proud to announce the release of Shaw Brothers new martial-arts movie, &quot;Drunken Monkey&quot; directed by the legendary director and martial arts choreographer Lau Kar Leung. The film stars Lau himself, Gordon Liu Chia-hui, stunning new action actress Shannon Yao and young martial-arts star Wu Jing Jason. \nThe story of Drunken Monkey takes place in China during the early 1930s, and tells a tale of martial-arts mastery and intrigue. The story begins as martial-arts master Wen Biao uncovers the fact that his brother has been using their security company for illegal activities. A confrontation between the brothers leaves Wen Biao missing and presumed dead. \n\nMeanwhile the easygoing lives of two young men are permanently changed when they grow bored of their quiet life and head for the big city in search of adventure, excitement and inspiration. They find all of this and more upon arrival in the city, when a chance encounter with a beautiful martial artist sparks love at first sight. The two heroes follow her, hoping to learn more about her, only to be chased away by her eccentric martial-arts master who happens to be Master Wen Biao. \n\nDrowning their sorrows in the city, the two heroes cross paths with an old friend of Wen Biao&amp;#039;s and unfortunately for everybody, his arch-enemy. Old friends are reunited briefly, until tragedy strikes at the reunion of the brothers. Final battle lines are drawn and our heroes have no other choice but to fight one last time. \n\nLau Kar Leung, a true martial-arts master whose kung-fu lineage can be traced to the real-life Chinese hero Wong Fei-hung, is the director of such Shaw Brothers classics as &quot;The 36th Chamber of Shaolin&quot; (a.k.a. &quot;Master Killer&quot;), &quot;Legendary Weapons of Kung-fu&quot; as well as Jet Li&amp;#039;s &quot;Martial Arts of Shaolin&quot; and Jackie Chan&amp;#039;s &quot;Drunken Master 2&quot;. Lau&amp;#039;s adopted brother Gordon Liu is of course best known for his roles as the shaven-headed hero of such films as &quot;The 36th Chamber of Shaolin&quot; and &quot;Legendary Weapons of Kung-fu&quot;, and will soon be seen in a dual role in Quentin Tarantino&amp;#039;s upcoming &quot;Kill Bill&quot;. &quot;Drunken Monkey&quot; also stars the next generation of action stars, including the graceful and alluring Shannon Yao, and Jet Li&amp;#039;s younger classmate and martial-arts prodigy Wu Jing who starred in Yuen Wo-ping&amp;#039;s &quot;Tai Chi Master 2&quot;. \n\nFeaturing bone-crunching, breathtaking martial-arts action performed by real martial-arts masters, &quot;Drunken Monkey&quot; marks the return of Shaw Brothers to film and underscores its close relationship with Celestial Pictures. \n\nCast: Liu Chia Liang (Lau Kar Leung)  ||  Jason Wu Jing  ||  Shannon Yao Yao (Shannon Yoh)  ||  Chik Kun Kwan  ||  Chiang Chun Wan  ||  Lau Wing Kin  ||  Gordon Liu Chia-Hui  ||  Li Hai Tao  \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.529027/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.529027/qx/details.htm&lt;/a&gt;\n\nP.S.\nSubtitles file for &quot;New Crouching Tiger, Hidden Dragon&quot; available at:\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:cef6be4dfc8b6ef19c063c6f2773a1e4c997ce13","amp;dn":"%5BKung_Fu%5D_Drunken+Monkey+%28Jason+Wu+Jing%2C+2003%29+CN+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef6be4dfc8b6ef19c063c6f2773a1e4c997ce13","infoHashBuffer":{"type":"Buffer","data":[206,246,190,77,252,139,110,241,156,6,60,111,39,115,161,228,201,151,206,19]},"announce":[],"urlList":[]}}