{"title":"[Kung Fu] The Kung Fu Master (Jet Li - 1993) - DVD/Rmvb","uid":3697226,"size":473016869,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf00a108425a0312b8e6a3de1b219024a62a6cc6&amp;dn=%5BKung+Fu%5D+The+Kung+Fu+Master+%28Jet+Li+-+1993%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":7,"time":1180125851,"description":"The Kung Fu Master aka Lord Of The Wu Tang (Jet Li - 1993)\n\nAvg. Rating:  \t\n  3.9 / 5 (based on 8 ratings).\n\nPlot:\tThe Yee Tien Sword and Toh Long Knife are two rare masterpieogs orafted out of gold and symbolises supremacy in the world of martial arts. As such, every one is eager to gain posssession of them, even to the extent of being ruthless.\n\nOverview:\tJet Li stars in The Kung Fu Cult Master, a sword clashing, people flying, kung fu fighting, grandiose epic that will leave you in a bewildered daze. You won&amp;#039;t be able to figure out all the characters, much less follow the plot of this truly over-the-top film. Roughly speaking, the movie centers around the conflict for posession of two magical swords which will give their controller supreme power - or at least that&amp;#039;s how it begins. A young Chang Mo-Kei (Jet Li) sees his parents forced to commit suicide by the various warring factions, and is himself infected with the &quot;Jinx&amp;#039;s Palm&quot; which makes him sickly and weak. This all changes when Mo-Kei learns the invincible solar stance, which gives him invincible martial arts powers. Accompanied by his companion Siu Chiu (Chingmy Yau) he sets off to stop the fighting among the very clans upon whom he&amp;#039;s sworn vengeance. However, he can only halt the fighting temporarily, and then a new round of treachery, double-crossing, and deception begins as the various factions seem to turn on each other. This leads Mo-Kei to cross paths with the princess Chao-Min (Cheung Man, who also plays Mo-Kei&amp;#039;s mother), who seems to be at the center of it all. Confused yet? Mind you, this is only the barest bones of the story, and it doesn&amp;#039;t even begin to describe what this film is really all about.\n\nCast: \tJet Li Lian-Jie  ||  Chingmy Yau Suk-Ching  ||  Cheung Man  ||  Sammo Hung (Kam Bo)  ||  Tsui Kam-Kong  ||  Francis Ng Chun-Yu  ||  Ngai Sing  ||  Richard Ng Yil-Hon  ||  Leung Kar Yan  ||  Gigi Lai Chi\n\n_________________\nIf this torrent link is dead or not well seeded, PM me for a re-seed\n","torrent":{"xt":"urn:btih:cf00a108425a0312b8e6a3de1b219024a62a6cc6","amp;dn":"%5BKung+Fu%5D+The+Kung+Fu+Master+%28Jet+Li+-+1993%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf00a108425a0312b8e6a3de1b219024a62a6cc6","infoHashBuffer":{"type":"Buffer","data":[207,0,161,8,66,90,3,18,184,230,163,222,27,33,144,36,166,42,108,198]},"announce":[],"urlList":[]}}