{"title":"THE CORPORATION Filmmakers' Official Download Edition - DIVX","uid":3561580,"size":1890828401,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf5c48fcf31924b5d23ac44712ad673806909a53&amp;dn=THE+CORPORATION+Filmmakers%5C%27+Official+Download+Edition+-+DIVX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thecorporation","files":5,"time":1164093115,"description":"THE CORPORATION is a witty, disturbing portrait of the dominant institution of our time. Taking its legal status as a &quot;person&quot; to its logical conclusion, the film puts the corporation on the psychiatrist&amp;#039;s couch to ask: &quot;What kind of person is it?&quot; THE CORPORATION exposes the consequences?for human beings, democracy, and our environment?of granting immense power to a structurally amoral institution whose legal mandate is to prioritize profit above all else. THE CORPORATION includes 40 interviews with corporate insiders and critics, plus case studies, true confessions, and strategies for change. \n\nIF YOU SUPPORT THE FILM, SUPPORT THE FILMMAKERS  \n\nFilmmaker Mark Achbar explains: &quot;As a filmmaker and activist, one of my goals is to reach the largest possible audience. Over 500,000 people have downloaded The Corporation, so from that perspective, it&amp;#039;s an astounding success. But I also organized the financing of the film and have ongoing obligations to those who supported it.&quot;\n\n&quot;Over 200 people worked on making the film and getting it seen. Our outreach efforts continue. If you value the work, please consider using the &quot;contribute&quot; button on www.thecorporation.com or send a cheque or money order, large or small, to:  Big Picture Media Corporation*, 2676 Eton St., Vancouver, BC, Canada, V5K 1K1. Thanks!&quot;\n\n* Yes, it&amp;#039;s ironic. I formed a small corporation to qualify for public funding in Canada.","torrent":{"xt":"urn:btih:cf5c48fcf31924b5d23ac44712ad673806909a53","amp;dn":"THE+CORPORATION+Filmmakers%5C%27+Official+Download+Edition+-+DIVX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf5c48fcf31924b5d23ac44712ad673806909a53","infoHashBuffer":{"type":"Buffer","data":[207,92,72,252,243,25,36,181,210,58,196,71,18,173,103,56,6,144,154,83]},"announce":[],"urlList":[]}}