{"title":"Spyware Terminator 1.9.2.141 (with Web Security Guard).rar","uid":3708548,"size":10334104,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cfa71841a351d2d57fd5007847ee65423ac4dd27&amp;dn=Spyware+Terminator+1.9.2.141+%28with+Web+Security+Guard%29.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boorstar","files":1,"time":1181324098,"description":"Spyware Terminator is a FREE, easy-to-use and effective spyware remover providing real-time protection against spyware, adware, keyloggers, trojan horses, browser hijackers and other malware threats. Spyware Terminator protects your computer through powerful real-time protection shield, advanced system scanning and keeping found spyware in the safe quarantine.\n\nProgram Highlights:\n- Effectively Protects Your Computer from Spyware\n- Safely Store Quarantine Detected Spyware\n- Easy to Use, Easy to Setup\n- Manual &amp; Scheduled Scans Keep Your Computer Spyware-Free\n- Automatically Download Updates that Keep Spyware Terminator Current\n\nBasic Program Features:\n* Free 100% Real-Time Protection is included in Spyware Terminator basic version ? an essential function most other applications charge you extra for. Effectively remove spyware, adware, trojans, keyloggers, home page hijackers and other malware threats.\n* Safe Quarantine. Suspect files found during the scan are moved into Quarantine. Spyware Terminator prevents them from functioning and causing further damage to your computer. You can review and choose to permanently remove suspect files or safely store essential files.\n* Easy to Use. Spyware Terminator lets people of all skill levels detect and eliminate spyware. If you remove a program by mistake, you can easily put it back.\n* Manual &amp; Scheduled Scan. Scan your computer manually or schedule an in-depth scan to be performed on a regular basis. The scan process runs in the background so that you will not be disrupted while working on other tasks.\n* Automatic Update Downloads. Spyware Terminator can be set to automatically download updates, ensuring the most effective protection for your computer.\n\nNote: Spyware Terminator is intended for personal use only","torrent":{"xt":"urn:btih:cfa71841a351d2d57fd5007847ee65423ac4dd27","amp;dn":"Spyware+Terminator+1.9.2.141+%28with+Web+Security+Guard%29.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfa71841a351d2d57fd5007847ee65423ac4dd27","infoHashBuffer":{"type":"Buffer","data":[207,167,24,65,163,81,210,213,127,213,0,120,71,238,101,66,58,196,221,39]},"announce":[],"urlList":[]}}