{"title":"CNN God's Warriors Part 1 - God's Jewish Warriors [-nu]","uid":3799995,"size":388233305,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1640ec72f38aef43f9aa9acdb88e762fcb09edc&amp;dn=CNN+God%5C%27s+Warriors+Part+1+-+God%5C%27s+Jewish+Warriors+%5B-nu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kenadamsmith","files":1,"time":1189272374,"description":"CNN God&amp;#039;s Warriors Part 1 - God&amp;#039;s Jewish Warriors [.wmv][TVrip][-nu]\n=====================================================================\n\nTitle: God?s Jewish Warriors (CNN, USA)\nFirst Aired: August 21, 2007\nFormat: *.wmv (Windows Media Player, VLC Player)\nQuality: Good\nDuration: 1:53:56\n\nVideo\n-----\nData Rate: 386 kbps\nVideo Sample Size: 24 bit\nResolution: 320x240 pixels\n\nAudio\n-----\nBit Rate: 459 kbps\nAudio Sample Size: 16 bit\nChannels: 2(Stereo)\nAudio Sample Rate: 44 kHz\n\nSummary\n-------\nReporter Christiane Amanpour traveled all over the world for nearly a year examining the impact of religious zealotry on politics and culture. She starts with &quot;God&amp;#039;s Jewish Warriors&quot;.\n\nGod&amp;#039;s Jewish Warriors describes the Jews who have forcefully pushed settlements into Israeli-occupied Palestine and the fund-raising in the United States that supports them.\n\nGod?s Jewish warriors draw inspiration from the Book of Ezekiel: ?Ye shall dwell in the land that I gave to your fathers.? When God promised the land of Israel (the entire ancient land, including parts of present-day Jordan, Egypt, Syria, and Lebanon), to the Jewish people (to Abraham&amp;#039;s son Jacob, also called Israel), they lived there for thousands of years until forcefully evicted by the Romans. For a period of approximately 1000 years, the land was sparsely populated until the Jews finally came back to their homeland at the turn of the century. After WWI, the Ottoman Empire fell apart, and Israel had been occupied by the Ottoman Turks. The Balfour Declaration of 1917 was drafted to return the land back to the Jewish people. In 1967, when Israel attacked four Arab countries , their surprise victory in the Six-Day War meant the fulfillment of prophecy.\n\nBefore the war, Israel only consisted of less than 40% of its ancient land. By winning the war of 1967, they gained back some of that land, including the West Bank and Gaza Strip. Following the war, Jewish settlements in the captured territory have become the central uncompromising principle of right wing Jewish settlers. Amanpour tells the personal stories of those who are willing to die for their freedom, their cause, and their homeland.\n\nAs the two-hour program goes behind-the-scenes of historical events, Amanpour also reports on a Jewish group that planned to blow up the Dome of the Rock in Jerusalem, in order to sabotage Israeli-Egyptian peace talks. All members of the group were arrested by the Israeli government and put into Israeli prison for 15 years. A Jewish extremist, Yigal Amir, assassinated Israeli Prime Minister Yitzak Rabin, because he was angry that Israel had once again exchanged land for peace. The entire country of Israel mourned Rabin&amp;#039;s death, because they saw him as a hope for peace with the Palestinians.\n\n?The tragedy besides our personal tragedy is that he was stopped in the middle of the way,? says Noa Rothman when asked by Amanpour about the assassination of her grandfather, Israeli Prime Minister Rabin. ?And we can never know how the end of the path would have been.?\n\nGod?s Jewish Warriors reports how Christian Zionists in America are raising money to support the activities of the settlers and how the pro-Israel lobby?s clout in Washington has helped religious settlers remain in the West Bank. Christian Zionists, who outnumber Jewish Zionists 3:1, believe that once all the Jews of the world are gathered in the ancient land of Israel (which is larger than present-day Israel, due to Israel frequently giving land to its neighbors), the lord Jesus Christ will return from heaven. All Christ&amp;#039;s followers will then ascend to heaven, while all enemies of Christ will be sent to hell.\n\nGod?s Jewish Warriors was filmed in the West Bank, Israel, the United Kingdom and the United States.\n-(wikipedia)\n\n\n============\nPlease SEED. This is a multi-tracker torrent. [-nu]\n============","torrent":{"xt":"urn:btih:d1640ec72f38aef43f9aa9acdb88e762fcb09edc","amp;dn":"CNN+God%5C%27s+Warriors+Part+1+-+God%5C%27s+Jewish+Warriors+%5B-nu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1640ec72f38aef43f9aa9acdb88e762fcb09edc","infoHashBuffer":{"type":"Buffer","data":[209,100,14,199,47,56,174,244,63,154,169,172,219,136,231,98,252,176,158,220]},"announce":[],"urlList":[]}}