{"title":"Oceans.Thirteen.2007.Cam","uid":3709406,"size":1269797295,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d184a161a6bd78edb778d2e92351e6bb79651d8a&amp;dn=Oceans.Thirteen.2007.Cam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tropper44","files":86,"time":1181412752,"description":"What are the odds of getting even? Danny Ocean and the gang would have only one reason to pull off their most ambitious and riskiest casino heist--to defend one of their own. But they?re going to need more than luck on their side to break The Bank.Ruthless casino owner Willy Bank never imagined that the odds were against him when he double-crossed Danny Ocean?s friend and mentor Reuben Tishkoff, putting the distraught Reuben in a hospital bed in critical condition. But Bank miscalculated--badly. He may have taken down one of the original Ocean?s eleven, but he left the others standing and, worse for him, gave them a shared purpose: to take Bank down on the night of what should be his greatest triumph--the grand opening of his new casino, appropriately named The Bank. Their strategy is twofold. First they will ruin him financially by turning the tables on the precept that the house always wins. But that?s just money. The knockout punch will be to Bank?s personal pride and joy: his reputation as the only hotelier who has earned the Royal Review Board?s Five Diamond Award on every single one of his hotels. The plan is elaborate, dangerous and damn near impossible--but there are no limits when it comes to one of their own.\nAlso Known As: \t\nOcean&amp;#039;s Thirteen\nProduction Status: \tIn Production/Awaiting Release\nGenres: \tAction/Adventure, Thriller, Crime/Gangster and Sequel\nRunning Time: \t2 hrs. 2 min.\nRelease Date: \tJune 8th, 2007 (wide)","torrent":{"xt":"urn:btih:d184a161a6bd78edb778d2e92351e6bb79651d8a","amp;dn":"Oceans.Thirteen.2007.Cam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d184a161a6bd78edb778d2e92351e6bb79651d8a","infoHashBuffer":{"type":"Buffer","data":[209,132,161,97,166,189,120,237,183,120,210,233,35,81,230,187,121,101,29,138]},"announce":[],"urlList":[]}}