{"title":"Delta Farce.WS.XviD.HHI","uid":3951777,"size":734082688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2270f0175eb3bd745f394a7e6a741dccf1c49bf&amp;dn=Delta+Farce.WS.XviD.HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"raidy","files":3,"time":1198903914,"description":"Delta Farce.WS.XviD.HHI\n\nAn HHI release.. WideScreen 2007\n\nThe film opens with an army general (Glenn Morshower) addressing a bunch of assembled troops and stating that real heroes are hard to find these days.\n\nMeanwhile, diner waiter Larry (Larry the Cable Guy) is serving sandwiches at a local diner. His girlfriend Karen (Christina Moore) comes up to him and quickly tells him she&amp;#039;s pregnant, and before she can stop him, he&amp;#039;s pulling her over to the PA system and announcing that she&amp;#039;s pregnant and asking her to marry him. Nervously, she bends over and says to him that it&amp;#039;s not his.\n\nMeanwhile, Bill Little (Bill Engvall) is talking about marriage with his neighbor (Michael Papajohn). The neighbor points out that most marriages end in divorce, and Bill says that it takes a lot to make a marriage work, such as incriminating photos of him with a girl who was just a good listener and eager to please at the local nightclub.\n\nElsewhere, a man opens up a storage shed to see the leotard-and-leopard-skirt (with a porn-star mustache) clad Everett (DJ Qualls) watching TV. He reprimands Everett for living here when he just works here and berates him for having been a cop for only four days.\n","torrent":{"xt":"urn:btih:d2270f0175eb3bd745f394a7e6a741dccf1c49bf","amp;dn":"Delta+Farce.WS.XviD.HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2270f0175eb3bd745f394a7e6a741dccf1c49bf","infoHashBuffer":{"type":"Buffer","data":[210,39,15,1,117,235,59,215,69,243,148,167,230,167,65,220,207,28,73,191]},"announce":[],"urlList":[]}}