{"title":"Magic Utilities 5.20 For Windows","uid":3706321,"size":1768080,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d2d4a2a46ced66d495ef71c365ac0147b23ae3ff&amp;dn=Magic+Utilities+5.20+For+Windows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boorstar","files":7,"time":1181063337,"description":"Magic Utilities is a cute program designed to make your computer clean and more stable. These utilities include Uninstaller Plus, StartUp Organizer, Process Killer and Disk Cleaner.\nMagic Utilities enables you to easily and safely uninstall programs, inspect and manage the programs that automatically start when your turn on or logon to your computer, lists and controls all currently running processes (system and hidden processes are also shown), and quickly clean up temp files and unnecessary files on your computer. With a cool and user-friendly interface, Magic Utilities makes it easy for anyone.\n\nFeature highlights include:\n- More user-friendly interface to list and uninstall programs that have been installed on your computer.\n- Support drag and drop. Automatically analyse your operation when you drop a file on Magic Utilities 2007 icon on the desktop.\n- Automatically detect the bad entries left behind in registry by misbehaved uninstallers.\n- Automatically detect the files lefted after a program has been uninstalled.\n- Automatically detect the new programs have been installed on your computer or added to your startup configuration.\n- Full control all program&amp;#039;s unistall info.\n- View, Edit, Delete and Add entries to your startup configuration.\n- Display a list of all running programs and allows you to force-quit frozen applications.\n- Includes skin and multi-language support.\n- Rate all your startup programs to list potential harmful program.\n- Display details of an certain running program so you can find harmful background processes like spyware, viruses and worms infect 90% of computers with an internet connection.\n- Export uninstall programs,startup programs and current running programs list to file.\n. . . . . .\n\nMagic Utilities works on Windows Vista/2003/XP/2000/Me/98.\n\nHomepage - http://www.magictweak.com/magicut.htm\n\nDONT FORGET TO BLOCK THE PROGRAM IN YOUR FIREWALL","torrent":{"xt":"urn:btih:d2d4a2a46ced66d495ef71c365ac0147b23ae3ff","amp;dn":"Magic+Utilities+5.20+For+Windows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d4a2a46ced66d495ef71c365ac0147b23ae3ff","infoHashBuffer":{"type":"Buffer","data":[210,212,162,164,108,237,102,212,149,239,113,195,101,172,1,71,178,58,227,255]},"announce":[],"urlList":[]}}