{"title":"Amazon DVD Shrink 2.6.2","uid":3699596,"size":1739388,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d30921e5063e41aa652a336533e3c32ebf17d234&amp;dn=Amazon+DVD+Shrink+2.6.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"prm_68","files":4,"time":1180383216,"description":"Applications : Windows : English\nAmazon DVD Shrinker is a high quality and extremely fast DVD copy &amp; shrink software. It is an easy-to-use DVD shrink ing software to get perfect duplicates of your favorite movies on DVD or Hard Drive with just a few clicks. The shrinking engine can fit any DVD video (up to 9.4GB) on to your DVD disc (4.7GB/Single Layer or 8.5GB/Dual Layer) with no loss of content or quality. The copy speed is very fast (Copy a 4.7G DVD disc in about 20 minutes in Full DVD Copy mode). It preserves all existing DVD contents including original menus, trailers, language tracks, subtitles, and etc. You can freely adjust the target sizes of your DVD backup. \nAmazon DVD Shrinker also includes a built in Video DVD burner, so you can really make any copy of discs for your favorite DVD Movies. \n- Transfer Video DVD to any size you selected. You can shrink and copy the video dvd to DVD5, DVD9 or customized size image and get full control of all dvd contents like menus, language, subtitles and etc. Everything you need to do is to follow the A, B, and C steps. \n- Build in Video DVD Burner. Built-in video dvd burner enable you make full backup of your Movie DVD. You just need to shrink one time, then burn multiple copies of DVD disc any time later. Safe mode burning protects your dvd disc when writting data. Support almost all brand of dvd writer device. \n\nKey Features: \n- Make high quality video output. \n- Convert DVD from e.g. 9 GB to 4.7 GB blanks. \n- Convert DVD from e.g. 9 GB to 8.4 GB double layer blanks. \n- Automatically analyzes DVDs: You just simply click one button,the program will open and analyze the DVD contents including menus, trailers, language tracks, subtitles, etc automatically. \n- Full DVD Copy: Copy you DVD movies to your hard disc (No resize) and burn to aother DVD disc.The copy duration is only about 20 minutes. \n- Customize target size: You can customize target size from 2.5GB to 9GB according to your settings. \n- Support both of hard drive folder and DVD disc as target. \n- Independent burning function: Burn your DVD files from hard disk independently. \n- DeCSS enabled. \n- Preview Function: Preview the output DVD movies when the shrink is processing. \n- Authorize of DVD in Drive. \n- Auto-Error Correction Mode. \n- Fast Copy to Hard drive. \n\nChanges in version 2.6.2 (03/30/2007): \n+ New version Fixed some minor bugs. \n\nHomepage - http://www.all4label.net ","torrent":{"xt":"urn:btih:d30921e5063e41aa652a336533e3c32ebf17d234","amp;dn":"Amazon+DVD+Shrink+2.6.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d30921e5063e41aa652a336533e3c32ebf17d234","infoHashBuffer":{"type":"Buffer","data":[211,9,33,229,6,62,65,170,101,42,51,101,51,227,195,46,191,23,210,52]},"announce":[],"urlList":[]}}