{"title":"Sharpes.Challenge.2006.ENGSUB.DVDRiP.XViD.CD2 -Lindoff.avi","uid":3801323,"size":837883904,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3e438cd7fcfb5b5e4d2f195c5b4ed82eb1cc2be&amp;dn=Sharpes.Challenge.2006.ENGSUB.DVDRiP.XViD.CD2+-Lindoff.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Lindoff41","files":1,"time":1189366057,"description":"In 2004, as part of ITV&amp;#039;s new set of drama, ITV announced that it intended to produce new episodes of Sharpe, in co-production with BBC America, loosely based on his time in India, with Sean Bean continuing his role as Sharpe. Sharpe&amp;#039;s Challenge is a two-part adventure; part 1 premiered on ITV on April 23, 2006, with part 2 being shown the following night. More gory than earlier episodes, the show was broadcast by BBC America in September 2006.\n\n Sean Bean is back as the swashbuckling hero in SHARPEs CHALLENGE. A year after Wellington crushes Napoleon at Waterloo, Wellington sends Sharpe to investigate what turns out to be his most dangerous mission to date. The fate of an Empire and the life of a General&amp;#039;s daughter lie in one man&amp;#039;s hands ...\n\nAfter five seasons of action-packed adventure films, averaging an audience of 47 percent, the award-winning Sharpe returns as two feature length episodes written by Russell Lewis.\n\nSean Bean returns to the role of Richard Sharpe for the first time in eight years, joined by Daragh OMalley as Sharpes best friend Sgt Patrick Harper, in this bloody enterprise filmed entirely in India. Toby Stephens is Colonel Dodd, the villainous renegade officer. Padma Lakshmi is Madhuvanthi, favourite consort, now ruling as Regent. Also starring Lucy Brown as Celia Burrows, the generals daughter held against her will, Michael Cochrane as the pompous General Simmerson, and Peter Hugo-Daly as the treacherous Sgt Shadrach Bickerstaff.\n\nWatch every Sharpe film ever made again on BBC America\n\n  &lt;a href=&quot;\nhttp://www.sharpefilm.com/home/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sharpefilm.com/home/&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:d3e438cd7fcfb5b5e4d2f195c5b4ed82eb1cc2be","amp;dn":"Sharpes.Challenge.2006.ENGSUB.DVDRiP.XViD.CD2+-Lindoff.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3e438cd7fcfb5b5e4d2f195c5b4ed82eb1cc2be","infoHashBuffer":{"type":"Buffer","data":[211,228,56,205,127,207,181,181,228,210,241,149,197,180,237,130,235,28,194,190]},"announce":[],"urlList":[]}}