{"title":"Planet Earth Disc 3-OnlyMe1","uid":3957589,"size":4694838124,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3ea02a694553b10f9b074a7937b3d6b82447629&amp;dn=Planet+Earth+Disc+3-OnlyMe1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"abqwerty","files":18,"time":1199251731,"description":"Planet Earth BBC Series With David Attenborough\n\nReady to Burn to DVD\n\n3 Episodes\n\nEpisode 7: Great Plains\n\nAfter filming for three years, Planet Earth finally captures the shy Mongolian gazelle. Only a handful of people have witnessed its annual migration. Don&amp;#039;t miss the bizarre-looking Tibetan fox, captured on film for the first time.\n\nOver six weeks the team follow a pride of 30 lions as they attempt to hunt elephants. Using the latest night vision equipment, the crew film the chaotic battles that ensue at close quarters. \n\nEpisode 8: Jungles\n\nJungles cover roughly three per cent of our planet yet contain 50 per cent of the world&amp;#039;s species. High-definition cameras enable unprecedented views of animals living on the dark jungle floor.\n\nIn the Ngogo forest the largest chimpanzee group in the world defends its territory from neighbouring groups. Other jungle specialists include parasitic fungi which infiltrate an insect host, feed on it, and then burst out of its body.\n\nEpisode 9: Shallow Seas\n\nA humpback whale mother and calf embark on an epic journey from tropical coral paradises to storm ravaged polar seas.\n\nNewly discovered coral reefs in Indonesia reveal head-butting pygmy seahorses, flashing &amp;#039;electric&amp;#039; clams and bands of sea kraits, 30-strong, which hunt in packs. Elsewhere plagues of sea urchins fell forests of giant kelp. Huge bull fur seals attack king penguins, who despite their weight disadvantage, put up a spirited defence.","torrent":{"xt":"urn:btih:d3ea02a694553b10f9b074a7937b3d6b82447629","amp;dn":"Planet+Earth+Disc+3-OnlyMe1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3ea02a694553b10f9b074a7937b3d6b82447629","infoHashBuffer":{"type":"Buffer","data":[211,234,2,166,148,85,59,16,249,176,116,167,147,123,61,107,130,68,118,41]},"announce":[],"urlList":[]}}