{"title":"The IT Crowd","uid":3548639,"size":650556034,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d418762fa2d743d10a46ec723b5ce40887e1a1a4&amp;dn=The+IT+Crowd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RamJack","files":6,"time":1162254348,"description":"The IT crowd centres around the lives of an IT support staff working away in the forgotten dingy basement of a large company, Reynholm Industries. Roy (the slob) and Moss (the geek) lurk in the basement fielding support calls in the tradition of IT department the world over... &quot;the beatings are bi-weekly&quot;. Jen&amp;#039;s been recruited by the big boss Denholm, to manage the department... but her lack of knowledge of anything computer-ey may hinder her career development path... \n\nThe Episodes:\nEpisode 1 - &quot;Yesterday&amp;#039;s Jam&quot; Following a gruelling interview with Denholm, the boss of Reynholm Industries, Jen is appointed as the manager of the IT team. The two techies, Roy and Moss, spend most of their day hiding from users in the basement, and are not keen on the idea of a new dynamic female boss undermining their position. Her first task is to increase the profile of the team.\nFirst broadcast: 03 Feb 2006 \n\nEpisode 2 - &quot;Calamity Jen&quot;  The team face their first test during Reynholm Industries&amp;#039; so-called &amp;#039;war on stress&amp;#039;. The office is on fire, Roy has a sudden attack of kleptomania, and Jen&amp;#039;s new shoes are two sizes too small. Notice the guest appearance by Danny Wallace \nFirst broadcast: 03 Feb 2006 \n\nEpisode 3 - &quot;50/50&quot; Jen has a new admirer, but his romantic gesture goes horribly wrong when Jen&amp;#039;s inability to tell the truth results in a very public humiliation.  Meanwhile, Moss and Roy conduct an experiment with a &amp;#039;lonely hearts&amp;#039; website.\n \nEpisode 4 - &quot;The Red Door&quot; What is behind the mysterious red door in the I.T. department? What has happened to Moss&amp;#039;s new mug? Why is Roy in danger of becoming known as a &amp;#039;desk rabbit&amp;#039;? And what is the secret behind top executive Richmond Avenal&amp;#039;s fall from grace? \n \nEpisode 5 - &quot;The Haunting of Bill Crouse &quot; Moss goes to extraordinary lengths to help Jen escape the unwanted attention of potential suitor Bill Crouse. Meanwhile, Roy is busy trying to escape the attentions of an admirer of his own? \n \nEpisode 6 - &quot;Aunt Irma Visits&quot; Jen explains that she is subject to very powerful mood swings around a certain time every month. When Moss and Roy start to display similar symptoms, it leads to the terrifying conclusion that will have terrible consequences for them and for the I.T. community at large.  \n","torrent":{"xt":"urn:btih:d418762fa2d743d10a46ec723b5ce40887e1a1a4","amp;dn":"The+IT+Crowd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d418762fa2d743d10a46ec723b5ce40887e1a1a4","infoHashBuffer":{"type":"Buffer","data":[212,24,118,47,162,215,67,209,10,70,236,114,59,92,228,8,135,225,161,164]},"announce":[],"urlList":[]}}