{"title":"Doctor-Who_Brain-of-Morbius_59-minute-edit","uid":3852832,"size":3963361280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d45eb3ac7c3131331cbbe09658bedaa4491ccacd&amp;dn=Doctor-Who_Brain-of-Morbius_59-minute-edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Doombear","files":1,"time":1193021328,"description":"Doctor Who: The Brain of Morbius (short edit from Playhouse Video)\n\n59 minutes - Playhouse Video - NTSC\n\n\n(info from back cover. Note: much of it is factually incorrect - but confirmed it is the 59-minute short edit of &quot;The Brain of Morbius&quot;)\n\nDoctor Who uses his head to keep a monster from coming back to life!\n\nBrace yourself for another voyage with Doctor Who, the internationally renowned science fiction hero who&amp;#039;s one of television&amp;#039;s most popular characters. A Time Lord from the world of Gallifrey, the Doctor travels through time and space in his craft, the Tardis, which happens to bear an uncanny resemblance to a police call booth. Capable of taking on a new form when necessary, he has had five different bodies, each portrayed by a different actor.\n\nIn this chapter, Doctor Who (Tom Baker) and Sara (Elisabeth Sladen) land on the barren planet of Karn, where they&amp;#039;re warmly greeted by Professor Solon. Then they discover that Solon has regenerated the body of Morbius, the most sinister criminal in the universe. All that&amp;#039;s lacking is a head, and now Solon decides the Doctor&amp;#039;s will do perfectly!\n\nCan the Doctor defeat Solon and keep the unspeakable evil of Morbius from coming to life, or will this monster once more be unleashed to wreak havoc upon the galaxy?\n\n59 Minutes, Color, 1984\n\nStarring Tom Baker in &quot;The Brain of Morbius&quot; by Robin Bland. Produced by Philip Hinchcliffe. Directed by Christopher Barry.\n","torrent":{"xt":"urn:btih:d45eb3ac7c3131331cbbe09658bedaa4491ccacd","amp;dn":"Doctor-Who_Brain-of-Morbius_59-minute-edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d45eb3ac7c3131331cbbe09658bedaa4491ccacd","infoHashBuffer":{"type":"Buffer","data":[212,94,179,172,124,49,49,51,28,187,224,150,88,190,218,164,73,28,202,205]},"announce":[],"urlList":[]}}