{"title":"VSO Software ConvertXtoDVD v2.2.3.258c-TE","uid":3845613,"size":9023770,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d497fec6266a8291e49fa1c11726affa701825c9&amp;dn=VSO+Software+ConvertXtoDVD+v2.2.3.258c-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Antje14","files":1,"time":1192618244,"description":"TE group came up with new version of this popular software. It?s really helpful if you don?t have a standalone divx-xvid player. It converts almost any video file to DVD-VIDEO format. It?s easy to use, and also fast; for one standard movie it needs less than hour to convert it (tested on my own PC - Dual Core 4400+ AMD Athlon with 2,5GB DDR2 RAM). Of course, if you have a better configuration, converting time will be reduced.\n\nConvertXtoDVD is a video converter software to convert and burn your videos to DVD. With ConvertXtoDVD and a few clicks you can backup your movies to DVD playable on any home DVD player.\n\nConvertXtoDVD supports most popular formats such as AVI to DVD; Mpeg, Mpeg, Mpeg4, MP4, VOB, WMV, DV and stream formats to DVD. It converts your files into a compliant DVD Video set of files and burns it on a DVD media. The ConvertXtoDvd does not need an external AVI codec download. It uses its own AVI codecs.\n\nThe aspect ratio can be automatically selected or forced to a specific format. The program works for NTSC and PAL video formats and creates chapters automatically. Multiple audio tracks are supported. Version 2 uses a completely rewritten interface with subtitles support and a lot of new settings.\n\nFeatures:\n\n    * Supported video formats: Convert AVI, Mpeg, Mpeg4, DivX, Xvid, MOV, WMV, WMV HD, DV, MKV, DVD to DVD and more?\n    * Supported sources: existing files from digital camcorders, TV/Sat, capture cards\n    * Can merge up to 4 hours of material from several movies or episodes\n    * Supported audio formats: AC3, DTS, PCM, OGG, MP3, and more?\n    * Handles subtitles files (.SRT .SUB/IDX .SSA) with color and font selection, and supports tags (italic, bold)\n    * Video format choice: NTSC, PAL, or automatic and PULL-DOWN\n    * Picture output: Widescreen, Fullscreen, or automatic\n    * Create Automatic chapters or edit your own\n    * Fast preview mode to check if the source is loaded correctly\n    * Save the DVD structure on hard drive or burn it to a blank DVD\n    * Reliable burn engine integrated (supports all DVD formats)\n    * Fast and quality encoder (typically less than 1 hour for converting 1 movie)\n    * Variable options and settings for advanced users\n    * Control of the conversion speed vs quality\n    * DVD Menu control (auto-start, loop etc)\n    * DVD Menu edition (background, font, color)\n    * Customizable interface (themes, dockable windows)\n    * Multilingual support (available languages?)\n    * Optimized for Windows 2000 / XP / Vista\n\nRelease Name: VSO.Software.ConvertXtoDVD.v2.2.3.258c-TE\nSize: 8.6MB","torrent":{"xt":"urn:btih:d497fec6266a8291e49fa1c11726affa701825c9","amp;dn":"VSO+Software+ConvertXtoDVD+v2.2.3.258c-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d497fec6266a8291e49fa1c11726affa701825c9","infoHashBuffer":{"type":"Buffer","data":[212,151,254,198,38,106,130,145,228,159,161,193,23,38,175,250,112,24,37,201]},"announce":[],"urlList":[]}}