{"title":"Vso_Convertx_to_DVD__2.2.2.256","uid":3707357,"size":7880483,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d4cc015ab26083c4e95201b603eb4ab98fb535f5&amp;dn=Vso_Convertx_to_DVD__2.2.2.256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Slickinator","files":3,"time":1181174444,"description":"[IMG]http://i71.photobucket.com/albums/i122/Slickinator2006/X2D-box-lights.gif[/IMG]\n\nConvertXtoDVD - 2.2.2 - Released 6th of June 2007\n=====================\n\nComplete rewrite of the AVI demuxer, for improvement such as:\n* accurate determination of audio start time, working with CBR/VBR audio (fixes most audio out of sync issues)\n* fault tolerance improved - very damaged AVI files (truncated, incomplete parts missing, wrong indexes) should be better handled now, and no longer produces out of sync audio.\n* lightning fast preview scroller, will give 99% of the time a perfect image\n* files with &amp;#039;rec &amp;#039; chunks are handled\n* accurate duration determination (fixes bogus or truncated AVI that used to need a parsing to obtain their accurate duration)\n\nsome regression bugfixes also implemented\n- 0000914: [Crash] Click On Audio or Video Stream (Twice) will generates an Access Violation ! (wesson)\n- 0000819: [Information] Adobe Premiere 1.5 file producing audio sync issues (wesson)\n- 0000902: [Information] file to test: no image once converted (wesson)\n- 0000915: [Bug] regression with Photostory wmv file (wesson)\n- 0000916: [Bug] Video framerate problem after encoding (wesson).\n\n\n\nConvertXtoDVD is a video converter software to convert and burn your videos to DVD. With ConvertXtoDVD and a few clicks you can backup your movies to DVD playable on any home DVD player.\n\nConvertXtoDVD supports most popular formats such as AVI to DVD; Mpeg, Mpeg, Mpeg4, MP4, VOB, WMV, DV and stream formats to DVD. It converts your files into a compliant DVD Video set of files and burns it on a DVD media. The ConvertXtoDvd does not need an external AVI codec download. It uses its own AVI codecs.\n\nKey Features:\n\n    * Supported video formats: Convert AVI, Mpeg, Mpeg4, DivX, Xvid, MOV, WMV, WMV HD, DV, MKV, DVD to DVD and more...\n    * Supported sources: existing files from digital camcorders, TV/Sat, capture cards\n    * Can merge up to 4 hours of material from several movies or episodes\n    * Supported audio formats: AC3, DTS, PCM, OGG, MP3, and more...\n    * Handles subtitles files (.SRT .SUB/IDX .SSA) with color and font selection, and supports tags (italic, bold)\n    * Video format choice: NTSC, PAL, or automatic and PULL-DOWN\n    * Picture output: Widescreen, Fullscreen, or automatic\n    * Create Automatic chapters or edit your own\n    * Fast preview mode to check if the source is loaded correctly\n    * Save the DVD structure on hard drive or burn it to a blank DVD\n    * Reliable burn engine integrated (supports all DVD formats)\n    * Fast and quality encoder (typically less than 1 hour for converting 1 movie)\n    * Variable options and settings for advanced users\n    * Control of the conversion speed vs quality\n    * DVD Menu control (auto-start, loop etc)\n    * DVD Menu edition (background, font, color)\n    * Customizable interface (themes, dockable windows)\n    * Multilingual support (available languages...)\n    * Optimized for Windows 2000 / XP / Vista\n\n\n","torrent":{"xt":"urn:btih:d4cc015ab26083c4e95201b603eb4ab98fb535f5","amp;dn":"Vso_Convertx_to_DVD__2.2.2.256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4cc015ab26083c4e95201b603eb4ab98fb535f5","infoHashBuffer":{"type":"Buffer","data":[212,204,1,90,178,96,131,196,233,82,1,182,3,235,74,185,143,181,53,245]},"announce":[],"urlList":[]}}