{"title":"THE.HILLSIDE.STRANGLER[2004]DVDRIP[ENG]-DAHLIA","uid":3566222,"size":734488997,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4da0647baf42237ef6e934c1eb924caebbfea54&amp;dn=THE.HILLSIDE.STRANGLER%5B2004%5DDVDRIP%5BENG%5D-DAHLIA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AlbertD","files":2,"time":1164666935,"description":"Dahlia presents:\n\nThe Hillside Strangler Summary from www.starpulse.com:\n\nA real-life series of killings that held Los Angeles, CA, in the grip of fear during the late &amp;#039;70s provides the inspiration for this tense crime drama. Kenneth Bianchi (C. Thomas Howell) is a nebbish security guard who lives with his mother in Rochester, NY, and dreams of becoming a police officer. After Bianchi&amp;#039;s application to join the Rochester police is turned town, he takes his mother&amp;#039;s advice and moves out to Glendale, CA, where she arranges for him to stay with his cousin, Angelo Buono (Nicholas Turturro), who works in auto repair. When he&amp;#039;s unable to get a position with the Glendale Police Department, Bianchi steps outside the law and, claiming to have a degree in psychology and a license to practice, sets up shop as a counsellor. While Bianchi never had much luck with women in Rochester, Buono gives him some advice and sets him up on a few dates; soon Bianchi has a string of girlfriends, though things become complicated when one of his steady girls, Claire Shelton (Allison Lange), becomes pregnant and moves in with him. As Bianchi becomes increasingly obsessed with sex, he and his cousin join forces to set up a prostitution ring, which quickly earns them the enmity of a group of career criminals. When Bianchi and Buono discover that they have been double crossed by one of the hookers in their stable, the two men rape and murder the woman in the back of a car; Bianchi discovers he enjoys the thrill of killing, and soon he and Buono begin committing a string of sexually tinged murders throughout the Los Angeles area, with the press soon dubbing the culprit &quot;The Hillside Strangler.&quot; \n","torrent":{"xt":"urn:btih:d4da0647baf42237ef6e934c1eb924caebbfea54","amp;dn":"THE.HILLSIDE.STRANGLER%5B2004%5DDVDRIP%5BENG%5D-DAHLIA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4da0647baf42237ef6e934c1eb924caebbfea54","infoHashBuffer":{"type":"Buffer","data":[212,218,6,71,186,244,34,55,239,110,147,76,30,185,36,202,235,191,234,84]},"announce":[],"urlList":[]}}