{"title":"Bonzo Dog (Doo Dah) Band - Talking Pictures mk2 Disc 1","uid":3706466,"size":5282651419,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d50c84de164a9a0a0a3f3583ed6a50ca9c91c3f1&amp;dn=Bonzo+Dog+%28Doo+Dah%29+Band+-+Talking+Pictures+mk2+Disc+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tygerbug","files":214,"time":1181077598,"description":"THE BONZO DOG BAND: TALKING PICTURES\n\nNOT FOR PROFIT\nA free service to the fans with thanks to the people of the official Neil Innes website.\n\n\nThe Bonzo Dog (Doo Dah) Band are legends of British comedy and music from the 60s. Good friends to both Monty Python and the Beatles ... influenced by the latter and an influence on the former, their surreal brand of humor made 1920s jazz hip to a 60s audience.\n\nYou may know them from their appearance in the Beatles&amp;#039; &quot;Magical Mystery Tour,&quot; as Vivian Stanshall performs &quot;Death Cab For Cutie.&quot; You may know Neil Innes from singing &quot;Brave Sir Robin&quot; in Monty Python and the Holy Grail, and &quot;How Sweet to Be an Idiot&quot; and a version of &quot;I&amp;#039;m the Urban Spaceman&quot; in Monty Python Live at the Hollywood Bowl. Or even for his masterful faux-Beatles music in the Rutles film. You may have seen them on Do Not Adjust Your Set (a precursor to Monty Python).\n\nThis is the ultimate collection of Bonzo Dog Band performances. Spread across several DVDs, this will provide hours and hours of entertainment as the Bonzos sing most of your favorites. Edited by Garrett Gilchrist (tygerbug/ocpmovie), the editor who created Star Wars Deleted Magic and The Thief and the Cobbler Recobbled Cut.\n\nTheir hilarious and wildly entertaining musical madness will entertain hipsters of any age.\n\nMany many many other Bonzo Dog, Neil Innes, Rutles and Monty Python related DVDs have been preserved by me, notably the Rutland Weekend Television and Innes Book of Records series.\n\nThis is the second, expanded version of a DVD originally created in 2005. The first Talking Pictures was just one DVD long. This revised set includes much more and better quality material spread across several DVDs.\n\nEven if you&amp;#039;re a major Bonzo fan, you won&amp;#039;t have seen much of this footage before. I have used clever editing to create new music videos for songs which had no video, to reconstruct clips which had bits missing, and to generally create new video based on shards and little bits of things, to give a full and very entertaining experience.\n\nHere is a tracklisting for disc 1 of this epic several disc set. Whenever possible, all or portions of all video and audio have been restored or reconstructed using the best available elements.\n\nDog intro (SHARE)\nDeath Cab For Cutie (Magical Mystery Tour)\nTitles (We Are Normal/Pathe)\nHello from Vivian (Colour Me Pop Soundtrack)\nCanyons of Your Mind (Colour Me Pop)\nUrban Spaceman (Color Me Pop)\nHead Ballet (Pathe Newsreel)\nEquestrian Statue (Pathe Newsreel)\nLove is a Cylindrical Piano (DNAYS)\nMetaphorically Speaking (DNAYS)\n11 Moustachioed Daughters (BiG GRunt/Marty Amok)\nMonster Mash (DNAYS)\nThe Sound of Music (DNAYS)\nHunting Tigers Out in Indiah (DNAYS)\nBig Shot (Jazz Bilzen)\nYou Done My Brain In (Jazz Bilzen)\nHello Mabel (Jazz Bilzen)\nI&amp;#039;m the Urban Spaceman (Jazz Bilzen)\nQuiet Talks and Summer Walks (Jazz Bilzen)\nI&amp;#039;m Forever Blowing Bubbles (Jazz Bilzen)\nCanyons of Your Mind (Jazz Bilzen)\nTrouser Press (Jazz Bilzen)\nBy a Waterfall (DNAYS)\nUrban Spaceman (DNAYS)\nTubas in the Moonlight (DNAYS)\nLook Out, There&amp;#039;s a Monster Coming (DNAYS)\nCanyons of Your Mind (Beat Club)\nMontage: We Were Wrong (&quot;Urban Spaceman&quot; Promo Film)\nMontage: Cool Brittannia (DNAYS)\nBeautiful Zelda (DNAYS)\nJollity Farm (animated cartoon)\nEquestrian Statue (Beat Club)\nIntro/Little Sir Echo (Beat Club)\nUrban Spaceman (Beat Club)\nAnnouncer introducing Urban Spaceman promo\nA Room With a View (The Big Show) with Pathe montage\nSon of Exploding Sausage clip\nIntro/The End of the Show (New Faces)\nEquestrian Statue (New Faces)\nLittle Sir Echo (New Faces)\nPathe Montage: The Bride Stripped Bare by &quot;Bachelors&quot;\nPathe Montage: My Pink Half of the Drainpipe\nViv: The Sea (IBOR)\nMr. Apollo (Colour Me Pop bootleg)\nHello Mabel (DNAYS)\nDNAYS sketch montage\nDNAYS montage: Ready-mades\n\nExtras:\nUp Sunday with Vivian Stanshall: A Garret in the Palace/The Pied Piper\nJazz Bilzen interview with Neil Innes","torrent":{"xt":"urn:btih:d50c84de164a9a0a0a3f3583ed6a50ca9c91c3f1","amp;dn":"Bonzo+Dog+%28Doo+Dah%29+Band+-+Talking+Pictures+mk2+Disc+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d50c84de164a9a0a0a3f3583ed6a50ca9c91c3f1","infoHashBuffer":{"type":"Buffer","data":[213,12,132,222,22,74,154,10,10,63,53,131,237,106,80,202,156,145,195,241]},"announce":[],"urlList":[]}}