{"title":"Pidgin IM client for Windows (Formerly Gaim) Version 2.0.1","uid":3697332,"size":11478403,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d58c3bd834659d2a85fbd5bdab8628d5ce97c6a0&amp;dn=Pidgin+IM+client+for+Windows+%28Formerly+Gaim%29+Version+2.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spookydude","files":1,"time":1180135168,"description":"Pidgin 2.0.1 Released\n\nWe&amp;#039;ve released version 2.0.1 of Pidgin (formally Gaim). This is a bugfix release addressing over 100 bugs reported in 2.0.0. Keep those bugs coming in, and we&amp;#039;ll continue making regular, frequent releases.\n\n----------\n\nNote: This is the Windows version.\n\nWWW.PIDGIN.IM\n\nWhat is Pidgin?\n\nPidgin is an instant messaging program for Windows, Linux, BSD, and other Unixes. You can talk to your friends using AIM, ICQ, Jabber/XMPP, MSN Messenger, Yahoo!, Bonjour, Gadu-Gadu, IRC, Novell GroupWise Messenger, QQ, Lotus Sametime, SILC, SIMPLE, and Zephyr.\n\nPidgin can log in to multiple accounts on multiple IM networks simultaneously. This means that you can be chatting with friends on AIM, talking to a friend on Yahoo Messenger, and sitting in an IRC channel all at the same time.\n\nPidgin supports many features of the various networks, such as file transfer, away messages, and typing notification. It also goes beyond that and provides many unique features. A few popular features are Buddy Pounces, which give the ability to notify you, send a message, play a sound, or run a program when a specific buddy goes away, signs online, or returns from idle; and plugins, consisting of text replacement, a buddy ticker, extended message notification, iconify on away, spell checking, tabbed conversations, and more.\n\nPidgin runs on a number of platforms, including Windows Linux, and other UNIX operating systems. Looking for Pidgin for OS X? Try Adium!\n\nPidgin integrates well with GNOME 2 and KDE 3.1&amp;#039;s system tray, as well as Windows&amp;#039;s own system tray. This allows you to work with Pidgin without requiring the buddy list window to be open at all times.\n\nPidgin is under constant development, and releases are usually frequent. The latest news regarding Pidgin can be found on the news page.\t\t","torrent":{"xt":"urn:btih:d58c3bd834659d2a85fbd5bdab8628d5ce97c6a0","amp;dn":"Pidgin+IM+client+for+Windows+%28Formerly+Gaim%29+Version+2.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d58c3bd834659d2a85fbd5bdab8628d5ce97c6a0","infoHashBuffer":{"type":"Buffer","data":[213,140,59,216,52,101,157,42,133,251,213,189,171,134,40,213,206,151,198,160]},"announce":[],"urlList":[]}}