{"title":"RELENTLESS Updated Edition &amp; OBSESSION Directors Cut","uid":3554630,"size":2195627567,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6f3d6b7f5bce8cf4c1e605474a705bb7a2f6e9f&amp;dn=RELENTLESS+Updated+Edition+%26+OBSESSION+Directors+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ta84","files":9,"time":1163129521,"description":"RELENTLESS - THE STRUGGLE FOR PEACE IN THE MIDDLE EAST (Updated Edition) \n\nRELENTLESS exposes the pain, the mistakes and differing viewpoints, of both the Israeli and Palestinian violence, in a balanced and objective format. In a we-present-the-facts-you-be-the-judge style, RELENTLESS presents the contributing factors to the conflict, in an easy to follow and compelling production. Importantly, RELENTLESS sheds light on these central events unfolding in modern history and confronts the facts and obstacles that need to be overcome in the future. \n\nProduced to incorporate never-seen-before primary source film clips, data and interviews, including film from Palestinian TV, religious sermons and political rallies, the movie reveals a behind-the-scenes look at Middle Eastern politics and culture. RELENTLESS uncovers the hidden agenda that is behind the collapse of the peace process and continued struggle between two peoples. \n\nThe producers honest and open examination of the lengths to which both the Israelis and Palestinians have gone to in order to achieve peace in the region, reveals a side of the Middle East story that most Americans are unaware of due to a lack of exposure by traditional media outlets. RELENTLESS offers a methodical overview from the Oslo Accords until today, of the commitments made by both Israel and the Palestinians, examining how each side has lived up to their promises. \n\n\n\nOBSESSION - RADICAL ISLAMS WAR AGAINST THE WEST (Pre-release) \n\nFrom the creators of RELENTLESS comes its sequel, a new film that will challenge the way you look at the world. \n\nAlmost 70 years ago, Europe found itself at war with one of the most sinister figures in modern history: Adolf Hitler. When the last bullet of World War II was fired, over 50 million people were dead, and countless countries were both physically and economically devastated. Hitlers bloody struggle sought to forge the world anew, in the crucible of Nazi values. How could such a disaster occur? How could the West have overlooked the evil staring it in the face, for so long, before standing forcefully against it? \n\nToday, we find ourselves confronted by a new enemy, also engaged in a violent struggle to transform our world. As we sleep in the comfort of our homes, a new evil rises against us. A new menace is threatening, with all the means at its disposal, to bow Western Civilization under the yoke of its values. That enemy is Radical Islam. \n\nUsing images from Arab TV, rarely seen in the West, OBSESSION reveals an insiders view of the hatred the Radicals are teaching, their incitement of global jihad, and their goal of world domination. With the help of experts, including first-hand accounts from a former PLO terrorist, a Nazi youth commander, and the daughter of a martyred guerilla leader, the film shows, clearly, that the threat is real. \n\nA peaceful religion is being hijacked by a dangerous foe, who seeks to destroy the shared values we stand for. The world should be very concerned.","torrent":{"xt":"urn:btih:d6f3d6b7f5bce8cf4c1e605474a705bb7a2f6e9f","amp;dn":"RELENTLESS+Updated+Edition+%26+OBSESSION+Directors+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f3d6b7f5bce8cf4c1e605474a705bb7a2f6e9f","infoHashBuffer":{"type":"Buffer","data":[214,243,214,183,245,188,232,207,76,30,96,84,116,167,5,187,122,47,110,159]},"announce":[],"urlList":[]}}