{"title":"Paris, J'taime","uid":3859271,"size":1467080704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d7e2064b19a0e3c1bffada393320d0780d9b7e4a&amp;dn=Paris%2C+J%5C%27taime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UBH8N","files":2,"time":1193393690,"description":"Paris, je t&amp;#039;aime is about the plurality of cinema in one mythic location: Paris, the City of Love. Twenty filmmakers will bring their own personal touch, underlining the wide variety of styles, genres, encounters and the various atmospheres and lifestyles that prevail in the neighborhoods of Paris. Each director has been given five minutes of freedom, and we, as producers, carry the responsibility of weaving a single narrative unit out of those twenty moments. The 20 films will not appear in the order of the arrondissements, from one to twenty, but rather, in a pertinent narrative order, initially unknown to the audience. They will be fused together by transitional interstitial sequences, and also via the introduction and epilogue sequences of the feature film. Each transition will begin with the last shot of the previous film and will end with the first shot of the following film, and will have a threefold function: 1) The first is to extend the enchantment and the emotion of the previous segment, 2) The second is to prepare the audience for the surprise of the next segment, and 3) The third is to provide a general, comfortable and cohesive atmosphere to the feature film. The delightful and brief interludes of these transitions will enable the viewer to slide from one world to the next, featuring a recurring and unexpected character. This mysterious character is a witness to the Parisian life and helps create a continuous narration. It appears both in and in-between the films. In addition to the information these transitions will provide about the city and its people, their tone will be intentionally light often referring to famous scenes easily attributed to the history of Paris cinema. Similar specifications will be followed by the composer who will supervise the musical fusion between the films and the transitions as he creates the musical score of Paris, je t&amp;#039;aime. Considering the common theme of Paris and Love, the fusion between the films and the transitions, the fast pace of a fluid and complete storytelling, Paris, je t&amp;#039;aime will not be just another &quot;anthology&quot; picture. It will be a unique collective feature film that will constitute a two-hour cinematographic spectacle whose original structure will make for a dramatically different experience for its global audience.  Written by Emmanuel Benbihy ","torrent":{"xt":"urn:btih:d7e2064b19a0e3c1bffada393320d0780d9b7e4a","amp;dn":"Paris%2C+J%5C%27taime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7e2064b19a0e3c1bffada393320d0780d9b7e4a","infoHashBuffer":{"type":"Buffer","data":[215,226,6,75,25,160,227,193,191,250,218,57,51,32,208,120,13,155,126,74]},"announce":[],"urlList":[]}}