{"title":"NFS Carbon","uid":3557930,"size":4253683938,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d849e9f341a5053cd123855cc3c7d76276e44cfc&amp;dn=NFS+Carbon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"poohlove101","files":2,"time":1163584800,"description":"************CD-Key is on the Disc*****************\n\n\t\tEA GAMES(tm) presents\n\t\tNeed for Speed(tm) Carbon\n\t\tREADME\n \n\n\nWHAT THIS FILE IS\n=================\nThis file contains information that supplements the Manual. If you are \nexperiencing problems not covered in this README, please contact EA \nCustomer Support.\n\nNOTE: Content of Web Links within this document may not be under the \ncontrol of Electronic Arts.\n\n\n************************************************************\n\n\n\t\t\t\tTABLE OF CONTENTS\n\n************************************************************\n\n\n1. INSTALLATION\n2. BASIC KEYBOARD CONTROLS\n3. MANUAL ADDENDUM \n4. ONLINE PLAY\n5. TROUBLESHOOTING\n6. CONTROLLER INFORMATION\n\n************************************************************\n\n\n1.\t\t\t\tINSTALLATION\n\n************************************************************\n\n\nThank you for purchasing Need for Speed Carbon.\n\nMINIMUM SYSTEM REQUIREMENTS\n===========================\nWindows XP Service Pack 2 (32Bit Edition only), Windows 2000 Professional Service Pack 4 operating system\nIntel Pentium 4 (or equivalent) CPU running at 1.7GHz or higher\n64MB DirectX 9.0c compatible video card (NVIDIA Geforce4 Ti/ATI Radeon 8500 or higher) using a \nsupported chipset (see below)\n512MB RAM\nDirectX compatible sound card\n5.3 GB of HD space\n8X or faster DVD Drive\n\nTo play online a network card is required for broadband connectivity\n\nInstallation Instructions:\n\nExit all applications. It is recommended that you do not run unnecessary \nbackground applications when installing the game.\n\nInsert DVD Disc into your computer\\\\\\&amp;#039;s DVD drive.  The Autorun menu will \nappear as soon as your disk drive recognizes the disk.  Select Install to \nInstall the game.  A prompt will appear to enter your install code.  \nEnter the install code and click on the Next button.\n\nYou will then get a menu asking to choose either a default install or \nthe advanced install (which allows you to specify an install \ndirectory).  Select Next and you will be prompted to register the game through \nElectronic Registration.  Select Register Now to register the game, or select\nRegister Later to continue with the installation.\n\n************************************************************\n\n\n2.\t\t\t\tBASIC KEYBOARD CONTROLS\n\n************************************************************\n\n\nThe basic keyboard controls required to play the game are:\n\nIn Game Controls:\t\t\t\n \nSteering\t\tLeft/Right Arrow \t\t\nThrottle\t\tUp Arrow/A\t\nBrake/Reverse\t\tDown Arrow/Z\nE-brake\t\t\tSpacebar\nNitrous\tBoost\t\tRight Shift\nSpeedbreaker\t\tX/G\nLook Back\t\tL\nShift Up\t\tLeft Shift\nShift Down\t\tLeft Ctrl\nCamera Change\t\tC\nReset Car\t\tR\nPause Game\t\tEsc\t\nActivate Crewmember\tRight Ctrl\t\t\nRead SMS\t\tTab\t\nWorld Map\t\tM\nEnter Race/Shop\t\tReturn\t\t\n\n\t\t\n\t\t\n\nMenu Controls\n\nHighlight Menu Items           Up, Down, Left and Right Arrows\nCycle Choices / Move sliders   Up, Down, Left and Right Arrows\nSelect / Go to next Screen     ENTER or left mouse click on selection\nReturn to previous screen      ESC\nTake Screenshot\t\t       F12\n(Screenshots are saved in the installation directory)\n\n************************************************************\n\n3.\t\t\t\tMANUAL ADDENDUM\n\n************************************************************\n\n\nVIDEO CARD SUPPORT\n==================\n\nAlthough Direct3D is supported, this support is only officially \nextended to certain 3D accelerator devices.  The following major D3D \nchipsets are supported.\n\nNVIDIA GeForce4 Ti-4200\nNVIDIA GeForce4 Ti-4400\nNVIDIA GeForce4 Ti-4600\nNVIDIA GeForce4 Ti-4800\nNVIDIA GeForce FX Series\nNVIDIA GeForce 6200\nNVIDIA GeForce 6600\nNVIDIA GeForce 6800\nNVIDIA GeForce 7300\nNVIDIA GeForce 7600\nNVIDIA GeForce 7800\nNVIDIA GeForce 7900\nATI Radeon 8500\nATI Radeon 9000\nATI Radeon 9100\nATI Radeon 9200\nATI Radeon 9500\nATI Radeon 9550\nATI Radeon 9600\nATI Radeon 9700\nATI Radeon 9800\nATI Radeon X300\nATI Radeon X550\nATI Radeon X600\nATI Radeon X700\nATI Radeon X800\nATI Radeon X850\nATI Radeon X1300\nATI Radeon X1600\nATI Radeon X1800\nATI Radeon X1900\n\n***NOTE: Laptop versions of these chipsets may work, but are not officially supported.  NVIDIA GeForce MX series not supported.\n\n\n\nWhile Direct3D supports a wider variety of 3D accelerator devices, the \nbehavior of Need for Speed Carbon cannot be predicted in these \nsituations. In extreme cases, running Need for Speed Carbon with \na Direct3D device that is not officially supported can lead to an \nunstable PC environment.\n\nSOUND CARD SUPPORT\n==================\n\nNeed for Speed Carbon supports DirectSound. If your sound card \ndriver does not support DirectSound you may experience choppy or \nstuttering sound or sound that cuts in and out. If your sound card \ndriver does not support DirectSound, we recommend obtaining updated \ndrivers from your sound card manufacturer.\n\n\nDVD DRIVES\n====================================\nNeed for Speed Carbon requires at minimum an 8x DVD \ndrive. The game Disc must be in the DVD drive when you start the \ngame.  If your system has more than one DVD drive, be sure the game \ndisc is in the same drive from which you installed the game.\n\n\nDEFAULT GRAPHICS SETTINGS\n==============================\nThe first time Need for Speed Carbon is run, a system check is \nperformed and default levels are set for the various graphics \nsettings. These default levels are set to provide the best game play \nexperience possible based on the hardware detected in your system.\n\nThese settings can be adjusted in the Video menu of the Options.\n\nResolution: Use the arrows to increase or decrease the game \nresolution. Increasing the game?s resolution may slow down system \nperformance.\n\nLevel of Detail: Use the arrows beside the Level of Detail bar to \nincrease or decrease global graphics setting. Increasing the Detail\nsetting to high will improve the game?s graphics but may slow down system \nperformance.\n\nAdvanced Display Settings: Tweak individual graphics settings. (See \nbelow.)\n\nDefault Settings: Reset your graphics settings to the default for your \nhardware configuration.\n\nSelecting Advanced Display Settings in the Video menu takes you to \nthe Advanced Display Settings menu. The following individual settings \nare available to tweak to change the game?s graphics output and game \nperformance. Turning all the settings to on may slow down system \nperformance.\n\nFull Screen Anti-Aliasing:  Adjust this setting to increase/decrease pixel smoothing.\n\nMotion Blur: Enable/disable motion blur effect on supported video cards.\n\nParticle System: Enable/disable particle effects in the game. \n\nTexture Filtering:  Adjust this setting to increase/decrease the Quality of the textures.\n\nVsync:  Updates the screen based on the refresh rate of your monitor.\n\nWorld Detail:  Increase the amount of detail visible in world geometry. \nDecreasing world geometry detail may increase overall system performance.\n\nRoad Reflection Detail:  Increase or decrease reflections visible in the road.\n\nCar Detail: Setting this to High increases geometry details \non the car.\n\nCar Reflection Update Rate: Increase or decrease how quickly reflections \nare visible on the car update.\n\nRain Effect:  Rain splatter effect on/off.\n\nVisual Treatment: Increase or decrease the effect of the visual treatment in the game.\n\nNot all graphic details are available for all video cards due to \nhardware limitations.\n\n\nALIAS AND SAVE LOAD\n============================\n\nWhen you start a new Alias, you will not have any of the\nprogress (unlocked cars, parts, or progress through Career Mode)\nthat you had in your old Alias (You can always log back in under\nyour original Alias if you want to go back).\n\nManual Saves: Your game can be manually saved by accessing the Career\nMenu and selecting Save.\n\nNOTE:  \nSaving your Alias saves your game progress. When you make a save game, \nyou are saving your progress in Career Mode, the number of cars, \ncar upgrades, and tracks you have unlocked, and any modifications you \nhave made to your cars.\n\nThe final game save directory is located at:\n\\\\\\\\Documents and Settings\\\\\\\\PC Login ID\\\\\\\\My Documents\\\\\\\\NFS Carbon\n\nSubstitute your actual Login ID for the PC Login ID mentioned above.\n\n\n************************************************************\n\n\n4.\t\t\t       ONLINE PLAY\n\n************************************************************\n\n\nTo avoid poor performance during Internet play, be sure that you close \nany file sharing, streaming audio, or chat programs prior to entering \ngameplay. These applications can monopolize your connection?s bandwidth, \ncausing lag or other undesirable effects.\n\nNeed for Speed Carbon uses the following TCP and UDP port(s) for \nInternet play:\n\n\nTCP:\n\nTCP 18210 \n\nTCP 18215 \n\nTCP 13505\n\n\nUDP:\n\nOutgoing: 18215, 20000 to 22000\n\nIncoming: 3658, 1042\n\n\nPlease consult your router or personal firewall documentation for information\non how to allow game related traffic on these ports.  If you are attempting to \nplay on a corporate Internet connection, contact your network administrator. \n\nNOTE: Need for Speed Carbon supports only broadband connections \nfor online play. When logging in to play Online you are logging into \nthe EA servers. If you already have one, you may use your existing \nEA Online account to play or you can create a new one.\n\nSetting up an account: An EA online account is required for online play. At \nthe account log-in screen choose Create New EA online account. You will be \ntaken to menus where you enter account information and choose your \nonline user name. You can otherwise create an account at EA.com and use that to enter the game.\n\n\nPLAYING ONLINE\n=================\nStarting up an online race is as simple as setting up any Quick Race mode.  When creating a Quick Race set the Game Mode to Online and your race will include online competitors. You will be the leader of the Game Room and have say over the race settings.\n\nChallenge Series includes several challenges that allow for co-operative play.  When selecting these challenges select the \\\\\\&quot;Online\\\\\\&quot; option, you will then enter the Game Setup room where you can invite a friend or allow another player to join you.\n\nQuick Match and Custom Match each allow you to jump into an online race quickly but in different ways.  Quick Match will find you a race, any race, while Custom Match will allow you to choose the type of race and the game settings you like to play.  When matchmaking begins we will find you a race as close to those parameters as possible.\n\nMost race modes are online, even if you do not play against other players online.  In Quick Race, Custom Match or Quick Match, set the Tracking Mode to Ranked. This will ensure that your race records are uploaded to the Leaderboards. View the Leaderboards in the Statistics menu, or view expanded Leaderboards and stats on NeedforSpeed.com.\n\n\nThe Game Room\n=================\n\nThe Game Room is broken into two stages; the Game Setup screen and the Game Room. In Game Setup you are able to invite your friends to enter your race, and control the race settings before other players are added to your race in the Game Room. To prevent other online players from matchmaking into your race set your maximum racers to match the number of friends you have invited.\n\nGame Room Countdown Timers:\n\nBoth Game Setup and Game Room have unstoppable timers.  This is to assure all players that a race is immenent. The Game Setup Timer provides a considerable amount of time for the Race Leader to make adjustments and invite friends.  After proceeding to the Game Room the timer resets to a much shorter time allowing for new players to drop in and choose a car before the race begins.  Shortly before the race starts the timer turns red and the room is locked. At this point no further players may enter or leave the room. Disconnecting from a locked Game Room will increase your disconnect percentage.\n\n\nDownloadable Content\n======================\n\nNeed for Speed Carbon supports downloadable in-game content including new cars, performance parts, vinyls, and even the Collectors Edition upgrade.  Many items are available in convenient bundles, and many are available individually.  Visit NeedforSpeed.com to view whats available today.  When you have purchased an item you may launch the game and the item should then be available in the Career Car Lot, in the Quick Race Car Select, or My Cars, depending on the item.  See the item description for details.\n\n\n\nIn-Game Cheat Detection/Disqualifications\n========================================\n\nDuring Ranked Games the cheat detection will be operational and will monitor \nrace progress. Any attempts to tamper with car data, physics or Nitrous\nwill be detected by the server and those players will be flagged.\n\nPlayers who are convicted of cheating or acting in a manner other than\nracing will receive a disqualification at the end of the race, and or be removed\nfrom the game during the race.\n\nNeed for Speed Carbon features an advanced Post Race Results screen \nwhere all results are validated by the server before becoming official.\n\nIf any players received a disqualification or disconnection during the race the\nfinish order will be adjusted in this screen.\n\nA DNF stands for ?Did Not Finish? and is awarded any time a player does not complete a race for any reason whatsoever.  Racers who quit will receive both a loss, and an increase in Disconnect Percentage.\n\nEA Online will be monitoring players and server results on a regular basis.\nShould any significant cheats be detected we will take action accordingly and ban\nany person\\\\\\&amp;#039;s accounts that are clearly trying to ruin the online experience for others.\n\n\n************************************************************\n\n\n5.\t\t\t       TROUBLESHOOTING\n\n************************************************************\n\n\nDVD AUTOPLAY FEATURE\n===================\nInserting the game DVD into your DVD drive and then immediately \nrunning the game either from the Windows Start menu or by \ndouble-clicking the game\\\\\\&amp;#039;s Desktop icon may cause a conflict with the \nDVD\\\\\\&amp;#039;s AutoPlay feature. The easiest way to avoid this potential \nconflict is to always wait a few moments after inserting the DVD to \nallow the AutoPlay feature to run the game.\n\n\nEJECTING THE GAME DVD\n====================\nNever eject the game DVD when the game is running.  Failure to do so\ncan result in serious problems, including being unable to continue the\ngame.\n\n\nFAST USER SWITCHING\n===================\nYou will not be able to run two versions of the game using two different \nwindows accounts via the fast user switching (windows key + L).\n\n\nDEVICE DRIVERS\n==============\nIt is highly recommended that the latest versions of all device \ndrivers (i.e. video and sound card drivers) be obtained and installed.\nPlease consult your card manufacturer for their newest drivers. Also, \nkeep in mind that video chip manufacturers sometimes provide drivers \nin addition to the card manufacturer.  \n\nIf you are experiencing issues with an unstable PC environment please \nmake sure your Motherboard drivers (AGP, miniport) are up to date. For \nfurther information please contact your Motherboard manufacturer.\n\nVIDEO &amp; GRAPHICS PROBLEMS\n=========================\nIf you are experiencing performance problems on the default graphics \nsettings, try lowering some of the settings or the game resolution.\n\nThis game requires DirectX 9.0c\nIt is available for download by going to:\n\n\t\twww.microsoft.com/windows/directx/\n\nGraphic Cards:  Graphical settings and features available in-game are \ndependant on Graphics Card capabilities. Settings not supported by your \nGraphics Card hardware are disabled in the Options Menu to prevent \nadverse effects on the game and your computer.\n\nNVIDIA Cards:  All supported NVIDIA cards were tested using ForceWare \ndriver version 91.47 (Win2k/XP). It is highly \nrecommended this driver or a more recent version be used when running \nNeed for Speed Carbon.\n\nKnown Issues:  \n\nATI Cards:  All supported ATI cards were tested using Catalyst driver \nversion 6.8 (Win2k/XP). It is highly recommended \nthis driver or a more recent version be used when running \nNeed for Speed Carbon.\n\n\n\n\nBACKGROUND PROGRAMS\n===================\nAvoid running other programs in the background.\n\nPrograms starting up automatically can cause Need for Speed\nCarbon to lose control of the screen and keyboard, possibly \ncausing an unstable PC environment.  We strongly recommend that you \nshut down or suspend applications that start up automatically or \nprograms that automatically run other applications at specified times \nbefore running Need for Speed Carbon.  These include, but are not \nlimited to:\n\t- Windows System Agent\n  \t- Windows Task Scheduler\n\t- Windows \\\\\\&quot;Disk Cleanup\\\\\\&quot; utilities\n\nSimilarly, message boxes and dialog boxes from other programs or from \nWindows itself can also cause Need for Speed Carbon to lose \ncontrol of the screen and keyboard, possibly causing an unstable PC \nenvironment. We strongly recommend that you shut down all other \napplications before running Need for Speed Carbon.  These \ninclude, but are not limited to:\n  \t- Email programs\n\t- Calendar, appointment, or contact applications\n\t- Network or Internet chat programs\n\nAlso, connections to/from non-dedicated servers can be disrupted when \nbackground programs or screen-savers launch.  We recommend that you shut\ndown other applications and run Need for Speed\nCarbon by itself whenever possible.\n\n\nPOWER MANAGEMENT SUSPEND/SLEEP MODES\n============================================\nSystems (i.e. laptops or other portables) that automatically power \ndown into \\\\\\&quot;sleep\\\\\\&quot; or \\\\\\&quot;suspended\\\\\\&quot; modes can cause Need for Speed \nCarbon to lose control of the screen and keyboard, possibly \ncausing an unstable PC environment. We strongly recommend that you \ndisable these features before running Need for Speed Carbon.\n\n\nWINDOWS VIRTUAL MEMORY ISSUES WITH 512 MB RAM \n==================================================\nIf you experience any Virtual Memory issues while running the game, try increasing \nthe page file size on your hard drive.  Please consult the Microsoft Windows help \npages to determine how to tweak your virtual memory settings.\n\nCHOPPY PLAYBACK DURING VIDEO SEQUENCES \n==================================================\nIf you experience choppy playback during video sequences, try increasing \nthe page file size on your hard drive.  Please consult the Microsoft Windows help \npages to determine how to tweak your virtual memory settings.\n\nSAFE MODE\n=========================\nThe safe mode option can be found under the game directory in the Start Menu.  If this\noption does not appear, go to www.microsoft.com/downloads and install the .NET Framework.\nThen re-install the game.\n\n\n\n\n\n\n************************************************************\n\n\n6.\t\t\t       CONTROLLER INFORMATION\n\n************************************************************\n\nCONTROLLER CONFIGURATIONS \n================================\nNeed for Speed Carbon can be played with many popular gamepads \nand controller devices. If your device is not recognized, or if you\\\\\\&amp;#039;d \nlike to modify the configuration the game has pre-assigned to your \ncontroller, enter Controls under Options in the Main Menu. \nThe re-mapping tools in this menu are useful for tweaking your \ncontroller for optimal play.\n\nCONTROLLER PROBLEMS\n=======================\nTo correct these problems, properly configure and calibrate the device \nfrom the Windows Control Panel.  If problems continue to persist, \ndisconnect the device from your computer before playing Need for Speed\nCarbon. Ensure the latest manufacturer drivers are installed for \nyour device.\n\n- The mouse pointer automatically scrolls through the buttons on menu \nscreens.\n- Your car makes erratic movements that are not intended (i.e. \ncontinually turning).\n- Certain movements do not occur when the proper direction is pressed.\n- Sluggish response on slower machines.\n\n\nFORCE FEEDBACK SETTINGS\n=============================\nForce Feedback is not enabled on the Customize Controller screen of \nthe Options menu until proper, device-specific drivers are installed \nfor that controller. The default generic drivers provided by Windows \ndo not provide access to Force Feedback features.\n\n\nKEYBOARD PROBLEMS\n=======================\nTo adjust the feeling\\\\\\\\sensitivity of the steering in gameplay when \nusing the keyboard, enter the Keyboard option in the Windows Control \nPanel (Start - Settings - Control Panel). By adjusting the Repeat \nDelay and Repeat Rate the user can adjust the controls to feel more \nanalog or digital depending on their preference. \n\nSome newer keyboards do not allow certain combinations of more than \ntwo keys to be depressed simultaneously.  For example, if you were \npressing both the up arrow key to accelerate and the left arrow key to \nturn, and you pressed the &lt;C&gt; key to change your view, the view may not \nchange.  Unfortunately, this problem is due to a limitation of the \nhardware.\n\nWhile it is possible to bind game controls to the F12, Print Screen and \nWindows keys, these keys will also retain their original function and can \ninterfere with gameplay.\n\nThe Windows key is not locked out during gameplay and it will bring \nup the start menu during gameplay.  This may interfere with gameplay. \n\n\n(C) 2006 Electronic Arts Inc. All rights reserved.\n\nEND OF Need for Speed Carbon README\n\n\n","torrent":{"xt":"urn:btih:d849e9f341a5053cd123855cc3c7d76276e44cfc","amp;dn":"NFS+Carbon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d849e9f341a5053cd123855cc3c7d76276e44cfc","infoHashBuffer":{"type":"Buffer","data":[216,73,233,243,65,165,5,60,209,35,133,92,195,199,215,98,118,228,76,252]},"announce":[],"urlList":[]}}