{"title":"Undertow.[EnglishOnly][1994] (but in mp4 format)","uid":3954614,"size":601590537,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9356cfaf71c999e6c710ba48c5a0ae1a54af1ee&amp;dn=Undertow.%5BEnglishOnly%5D%5B1994%5D+%28but+in+mp4+format%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DivorcedWithChildren","files":1,"time":1199067391,"description":"Why MP4?  It&amp;#039;s used by a lot of TV over IP companies due to it&amp;#039;s high quality video and efficient compression which results in a much smaller file to download.  This movie is encoded with XVID which most computers will play without problems.  If you do have issues, simply download the free VLC Player from http://www.videolan.org/vlc/ \n\nwhich plays pretty much anything you can throw at it.  No, this is not some iPod rip, it&amp;#039;s a full quality version of the original, just in MP4 format the file is much smaller.\n\nFor those interested, this MP4 began as 2 AVIs (CD1 and CD2) that was about 1500mb in size.  The MP4 converter joined the two AVIs and compressed it to about 1/3 of it&amp;#039;s original size.  You be the judge of the quality and audio.\n\nI&amp;#039;d appreciate comments:  sounds too low, video too dark/too light, etc. so I can make changes when I convert my AVI movies to MPG4 but I think most people will enjoy the shorter downloads, particularly for the older or less popular films that I tend to like to seed.\n\nNow for the movie:  This isn&amp;#039;t the horror movie by the same name, nor the music from the grunge rock band of the same 1994 era, it&amp;#039;s the Jamie Bell followup to &quot;Billy Elliott&quot;.  Set in rural South Carolina, near Savannah, GA, it&amp;#039;s a dark tale of an older poor boy in a dysfunctional family who largely has to care and rear for his younger brother with &quot;issues&quot;.  None of the beautiful South graces this movie.  It&amp;#039;s gritty and largely &quot;ugly&quot; in it&amp;#039;s sets.  Rated R for violence and B- by Yahoo movie viewers, it was largely a box office flop with only $124,000 in US receipts.  The acting doesn&amp;#039;t stretch Jamie Bell&amp;#039;s abilities at all and it&amp;#039;s a very predictable script.  Dysfunctional violent family, kids run away, meet nice people/bad people, etc.  Probably the highlight of the film is seeing Jamie Bell and younger Devon Alan covorting in their tightie whities in the rain and later drying off on the riverbank.  But like all underdog movies, it has it&amp;#039;s fans.\n\nIt won 3 awards:  US National Board of Review for excellence in filmaking and Young Artist Awards for Jamie Bell and Devon Alan.\n\nBlurb from the distributor:  &quot;Set in contemporary South, a dramatic thriller about two brothers, Chris and Tom, who are forced to go on the run in order to guard a secret following the death of their father--and the arrival of their greedy, troubled uncle.&quot;\n\nNow for some tidbids about what you&amp;#039;ll see in the movie:\n\nThe &quot;green paint&quot; tasted by young Tim, Devon Alan, is actually yogurt; the &amp;#039;mud&amp;#039; he eats is brownie mix.\n\nEarly in the film, Jamie Bell&amp;#039;s character is running from the cops and accidentally steps on a nail causing him to limp for a while in the movie.  In real life, Jamie did step on a nail off set causing him to have to use crutches when not in front of the camera.  David Gordon Green, the director, had to fill in for Jamie during some of the running through the woods scenes because Bell was still on crutches and not up to running.\n\nEnjoy.\n\n","torrent":{"xt":"urn:btih:d9356cfaf71c999e6c710ba48c5a0ae1a54af1ee","amp;dn":"Undertow.%5BEnglishOnly%5D%5B1994%5D+%28but+in+mp4+format%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9356cfaf71c999e6c710ba48c5a0ae1a54af1ee","infoHashBuffer":{"type":"Buffer","data":[217,53,108,250,247,28,153,158,108,113,11,164,140,90,10,225,165,74,241,238]},"announce":[],"urlList":[]}}