{"title":"Hardbodies VHSRip By RUBrTOE.avi","uid":3959841,"size":1734371910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d98b508548ab61d47777dec95bb8a04fe77797d9&amp;dn=Hardbodies+VHSRip+By+RUBrTOE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RubberTow","files":1,"time":1199383946,"description":"Full IMDB link: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0087385/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0087385/&lt;/a&gt;\n\nThis is a Divx HD VHS tape rip at 960x720 and it won&amp;#039;t play in non HD-certified Divx players. This movie has never been issued on DVD. The DVD copies being sold are just that, copies of vhs tape. THIS IS the best copy of this movie available via download, on vhs tape or disk. If anybody downloads this and finds another copy that&amp;#039;s better, I want to know about it.\n\nThis is a 1984 flick suposedly made originally for Playboy channel. There is no DVD of it available except ones ripped from VHS that are poor quality. I ripped this from VHS and greatly enhanced it taking out a lot of video noise during the capture with ATI Video Soap software and then I processed it three times with Avery Lee&amp;#039;s free program Virtual Dub and VDub&amp;#039;s embedded filters and other free VDUB filters I found on the internet. The result is greatly enhanced color and sharpness.Even so the audio falls apart in places on most players. The audio is fine in WMP but bad in places in VLC and the ATI player and I do not know why.\nRegarding video quality, this is the best copy oof this movie I have found anywhere. I have downloaded it, bought it on DVD (which turned out to be the same exact digital copy as the one I downloaded and I;&amp;#039;ve purchased the VHS tape. the tape is better than the digital versions somebody made and my rip here is much better than the VHS tape it came from, although it is still very evident that it is from VHS.","torrent":{"xt":"urn:btih:d98b508548ab61d47777dec95bb8a04fe77797d9","amp;dn":"Hardbodies+VHSRip+By+RUBrTOE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d98b508548ab61d47777dec95bb8a04fe77797d9","infoHashBuffer":{"type":"Buffer","data":[217,139,80,133,72,171,97,212,119,119,222,201,91,184,160,79,231,119,151,217]},"announce":[],"urlList":[]}}