{"title":"24c3-2233-en-vx.mp3","uid":3953241,"size":30300669,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:de95f6f79bd0cc7dc35c4fd8622577f3da28fd7f&amp;dn=24c3-2233-en-vx.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"num42","files":1,"time":1198977890,"description":" &lt;a href=&quot; http://events.ccc.de/congress/2007/Fahrplan/events/2233.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://events.ccc.de/congress/2007/Fahrplan/events/2233.en.html&lt;/a&gt;\n\nSpeakers:    \t SkyOut\n\nVX\n\nThe Virus Underground\n\nThe listeners will be introduced in the world of virus coding. They will understand how this can be seen as a way of expressing yourself and why it is a way of hacking. Furthermore they will get to know, which important groups, authors and viruses have been there in the last years and which are still active nowadays. Important technical terms will be explained as well as trends of the last years and the future. And more.\n\nThe aim of the lecture shall be to introduce the listeners to the world of the virus underground. They shall understand how this little community of about fifty people think and act and why they code viruses. The audience may understand coding of viruses as a type of hacking and a way of expressing it as art. Furthermore it is the aim to make them familiar with different words, that are typically used by VXers (Virus Coders), for example Appender, Prepender and Overwriter Virus. Even more different aspects of multiplatform malware and payloads shall be explained. Then the audience shall be introduced to different authors and groups of the scene, that are somehow the idols of many VXers, groups like EOF, DoomRiderz and more. People like Roy G Biv, Virusbuster and Benny and more. Going on, the lecture will describe the relationship between VXers and the AntiVirus companies, even it does not seem so, there is something like a connection between both groups. Then it is planned to show how VXers communicate with each other, typical IRC channels and the so called electronic magazines or short E-Zines. Not to be forgotten also the programming languages of the scene will be described and trends, that can be seen over the last years. In the way, which programming languages are used and in general. Last but not least the problems of the VX Underground will be described.","torrent":{"xt":"urn:btih:de95f6f79bd0cc7dc35c4fd8622577f3da28fd7f","amp;dn":"24c3-2233-en-vx.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de95f6f79bd0cc7dc35c4fd8622577f3da28fd7f","infoHashBuffer":{"type":"Buffer","data":[222,149,246,247,155,208,204,125,195,92,79,216,98,37,119,243,218,40,253,127]},"announce":[],"urlList":[]}}