{"title":"20070525 - Unreported World - Kosovo - State of Denial","uid":3699367,"size":367878144,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e1d54db02a30cf3e66e12b48e4242cc0f762bbf9&amp;dn=20070525+-+Unreported+World+-+Kosovo+-+State+of+Denial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"grimerking","files":1,"time":1180365332,"description":"Kosovo: State of Denial\n\nFriday 25 May 7.30pm\n\nThe United Nations is planning to make Kosovo Europe&amp;#039;s newest state by granting it independence from Serbia. But only eight years after a bloody ethnic conflict between its Serb and Albanian populations, this week&amp;#039;s Unreported World asks whether the two communities can ever forget the past and live together in an independent country.\n\nReporter Sam Kiley and producer Robin Barnwell begin their journey in Krushe Madhe and come across the burial of three men murdered in 1999 by Serb paramilitaries, whose bodies have only recently been found. Seventy-four others are still missing and there are already more than 200 dead in the town&amp;#039;s graveyard.\n\nIt&amp;#039;s clear that the fighting might have stopped but the war isn&amp;#039;t over. Ethnic tensions are high, with 16,000 foreign troops patrolling the streets and countryside to keep the peace. Serbs, blamed for the ethnic cleansing of Albanians which provoked Nato&amp;#039;s intervention, now find themselves in a tiny minority scattered across the province in enclaves, unable to speak the language of the majority, and unwilling to join in the political process.\n\nThe team travels on to North Mitrovica, a Serb-run enclave. Here the Belgrade-appointed local Tsar, Dr Milan Ivanovic, tells Unreported World that that the Serbs will ignore any attempt to establish Kosovo&amp;#039;s administration in his town.\n\nAs they continue to move across Kosovo, it&amp;#039;s obvious that despite the 5.5bn Euros the international community has spent trying to stabilize this part of the Balkans, the infrastructure is in a bizarre mess. There is one postal service, justice system, education system and mobile telephone network for Serbs - and another for the majority Albanian population.\n\nThe UN&amp;#039;s plans guarantee Kosovo&amp;#039;s Serbs will continue to be able to run their own schools and healthcare system. But facing near 80 per cent unemployment, they still rely heavily on subsidy from Belgrade, which is implacably opposed to Kosovo&amp;#039;s independence for a province Serb nationals call their &quot;Jerusalem&quot;.\n\nAnd few of the estimated 200,000 Serbs who fled their burned villages are prepared to go home and risk living alongside their neighbours. Kiley joins Milorad Radivojevic as he visits his reconstructed home in Albanian-dominated south Mitrovica. &quot;Even if we dared to come back here, we couldn&amp;#039;t live in this house. The sewerage hasn&amp;#039;t been plumbed into the mains, the waste backs up. This house is to show the media and the world that we can come home. But the message to us is, you&amp;#039;re not welcome,&quot; says Milorad.\n\nIn another Serb village, Gorazdavac, Kiley asks how many children in the all-Serb school are learning Albanian. The answer - none. He&amp;#039;s told &quot;the Albanians have purged their curriculum of all Serbs and Serbian, they must reach out to us before we learn Albanian&quot;.\n\nAs the team leaves Kosovo, it&amp;#039;s clear that on the one hand the consequences of independence look like being poverty, fear and loathing and a resolute ethnic &quot;apartheid&quot;. But, on the other hand if Kosovo doesn&amp;#039;t get independence Unreported World is told by Albanian extremists: &quot;We are heading down a path to war.&quot;\n\nFile Information\n\nDVBT-T (Freeview) Capture\nConverted using Gordian Knot\nResolution = 640x352\nVideo Codec = XviD\nAudio = 128kbps CBR\n\nPlease keep seeding after you finish downloading. Documentaries are more of a niche item than blockbuster movies. If you want me to keep recording and sharing them, help me out...","torrent":{"xt":"urn:btih:e1d54db02a30cf3e66e12b48e4242cc0f762bbf9","amp;dn":"20070525+-+Unreported+World+-+Kosovo+-+State+of+Denial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d54db02a30cf3e66e12b48e4242cc0f762bbf9","infoHashBuffer":{"type":"Buffer","data":[225,213,77,176,42,48,207,62,102,225,43,72,228,36,44,192,247,98,187,249]},"announce":[],"urlList":[]}}