{"title":"Visitors of the night - eng nosub - VHS-mp4","uid":3609188,"size":676872820,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e41b7a06830120a538254856c8c8eaf85c941cf8&amp;dn=Visitors+of+the+night+-+eng+nosub+-+VHS-mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Trotyl","files":3,"time":1170424540,"description":"A Frightening Look At The Alien Abduction Phenomenon Through The Eyes Of Two Women, 28 May 2000\nAuthor: tony lefcourt from Belleville, Ontario, Canada\n\n\nWhen her daughter mysteriously disappears for a few hours, Judith English(Post) decides to confront her greatest fears and investigate what is happening. She realizes that her daughter is experiencing the same thing that she experienced as a little girl, abduction by aliens.\n\nWhile watching Visitors of the Night, I found myself thinking how the film was like an extension of another film, Intruders. Both films take a serious look at the topic of alien abductions and both films concern a main character who believes she may or may not have been impregnated with an alien/human hybrid.\n\nAlthough, unlike Intruders, the film takes a detour into the implausible near the end when Post&amp;#039;s character begins to suspect that her daughter might not be what she seems. Without giving anything away, the ending doesn&amp;#039;t tend to ruin the whole film.\n\nDirector, Jorge Montesi offers up another creepy outing that ufo enthusiasts will appreciate. Trivia buffs will note that Montesi would follow up this film with another ufo-related film a year later, Night Visitors. \n\n\t\t","torrent":{"xt":"urn:btih:e41b7a06830120a538254856c8c8eaf85c941cf8","amp;dn":"Visitors+of+the+night+-+eng+nosub+-+VHS-mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e41b7a06830120a538254856c8c8eaf85c941cf8","infoHashBuffer":{"type":"Buffer","data":[228,27,122,6,131,1,32,165,56,37,72,86,200,200,234,248,92,148,28,248]},"announce":[],"urlList":[]}}