{"title":"Details for Poppa Sim (Unreleased Underground Rap) (Untitled Alb","uid":3829238,"size":23052572,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e46f1f5313ba4586b8020fc2e98cca0a7989b872&amp;dn=Details+for+Poppa+Sim+%28Unreleased+Underground+Rap%29+%28Untitled+Alb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iZiplok","files":2,"time":1191482205,"description":"Music : Hip-Hop / Rap : MP3/Over 256Kbps\nPOPPA SIM can be found on over 130 MP3 sites. Buy all his MP3s at blastmymusic.com/poppa_sim.\n\nBorn and raised in Brooklyn, NY, POPPA SIM has always had a strong passion for music. SIM began rapping in his mid-teens, and at the age of 16 he began recording with the independent record label Custom Cutts.\n\nAfter a two-year stint with Custom Cutts, he was working and attending school when he was discovered by super producer Jeremy &quot;Yogi&quot; Graham, who paired SIM up with Morock and Freddy Blassy. The three then formed the group THE HOODFELLAZ.\n\nIn 2001, THE HOODFELLAZ were signed to Hip-Hop mogul P. DIDDY&amp;#039;s label, BAD BOY RECORDS who would become most infamous for their diss track on &quot;Da Band&quot; entitled &quot;Taking Da Band (Cheesecake).&quot; This beef would go on to be identified by XXL MAGAZINE as &quot;one of the worst beefs of 2003.&quot;\n\nWhile on the label, SIM was a ghostwriter, writing for several artists including DIDDY, he appeared on CARL THOMAS&amp;#039; &quot;Emotional Remix,&quot; and worked with many artists both within and outside the BAD BOY family.\n\nIn 2005, the trio came to the mutual decision to pursue solo careers.\n\nRecently, POPPA SIM has been working with super producers Sonny Carson, Reefer (of THE GAME&amp;#039;s &quot;One Blood&quot;), and long time friend BangOut (of 50 CENT&amp;#039;s &quot;Disco Inferno&quot;). He is currently working on several projects with the above-mentioned producers and is feverishly working in the studio to finish his debut album as a solo artist.\n\nPOPPA SIM is a franchise all his own, with a musical style reminiscent of the 90&amp;#039;s era when hip-hop was genuine, entertaining and actually had something to say, while artists retained their own personal identity.\n\nGoogle &quot;POPPA SIM&quot; and see for yourself what a beast he is. Listen to and download his hottest tracks at blastmymusic.com/poppa_sim.","torrent":{"xt":"urn:btih:e46f1f5313ba4586b8020fc2e98cca0a7989b872","amp;dn":"Details+for+Poppa+Sim+%28Unreleased+Underground+Rap%29+%28Untitled+Alb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e46f1f5313ba4586b8020fc2e98cca0a7989b872","infoHashBuffer":{"type":"Buffer","data":[228,111,31,83,19,186,69,134,184,2,15,194,233,140,202,10,121,137,184,114]},"announce":[],"urlList":[]}}