{"title":"Hacking.Democracy.WS.PDTV.XviD-SYS.{FIXED}.avi","uid":3605826,"size":727928618,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e486920ef343f082e8b646c59af24142ab268e1f&amp;dn=Hacking.Democracy.WS.PDTV.XviD-SYS.%7BFIXED%7D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asc11","files":1,"time":1170059532,"description":"Electronic voting machines count about 87% of the votes cast in America today.\nBut are they reliable? Are they safe from tampering? From a current \ncongressional hearing to persistent media reports that suggest misuse of data \nand even outright fraud, concerns over the integrity of electronic voting are \ngrowing by the day. And if the voting process is not secure, neither is \nAmerica\\&amp;#039;s democracy. The timely, cautionary documentary HACKING DEMOCRACY \nexposes gaping holes in the security of America\\&amp;#039;s electronic voting system.\n\nIn the 2000 presidential election, an electronic voting machine recorded minus \n16,022 votes for Al Gore in Volusia County, Fla. While fraud was never proven, \nthe faulty tally alerted computer scientists, politicians and everyday \ncitizens to the very real possibility of computer hacking during elections.\n\nIn 2002, Seattle grandmother and writer Bev Harris asked officials in her \ncounty why they had acquired electronic touch screen systems for their \nelections. Unsatisfied with their explanation, she set out to learn about \nelectronic voting machines on her own. In the course of her research, which \nunearthed hundreds of reported incidents of mishandled voting information, \nHarris stumbled across an \\&quot;online library\\&quot; of the Diebold Corporation, \ndiscovering a treasure trove of information about the inner workings of the \ncompany\\&amp;#039;s voting system.\n\nHarris brought this proprietary \\&quot;secret\\&quot; information to computer security \nexpert Dr. Avi Rubin of Johns Hopkins University, who determined that the \nsoftware lacked the necessary security features to prevent tampering. Her \nsubsequent investigation took her from the trash cans of Texas to the \nsecretary of state of California and finally to Florida, where a \n\\&quot;mini-election\\&quot; to test the vulnerability of the memory cards used in \nelectronic voting produced alarming results.\n\nAs the scope of her mission grew, Harris drew on the expertise of other \ncomputer-science experts, politicians and activists, among them: Andy \nStephenson, candidate for secretary of state in Washington state; Susan \nBernecker, Republican candidate in New Orleans; Kathleen Wynne, an activist \nfrom Cleveland; Dr. Herbert Thompson, chief security strategist, Security \nInnovation, Inc.; Ion Sancho, supervisor of elections for Leon County, Fla.; \nand Harri Hursti, a computer-security analyst. Academics, public officials \nand others seen in interview footage include: Deanie Lowe, supervisor of \nelections, Volusia County, Fla.; Mark Radke, marketing director of Diebold; \nDavid Cobb, presidential candidate, Green Party; and Rep. Stephanie \nTubbs-Jones of Ohio.\n\nDiebold software, or other software like it, is installed in thousands of \ncounties across 32 states. David Dill, professor of computer science at \nStanford, says the problem is that there are \\&quot;lots of people involved in \nwriting the software, and lots of people who could have touched the software \nbefore it went into that machine. If one of those people put something \nmalicious in the software and it\\&amp;#039;s distributed to all the machines, then \nthat one person could be responsible for changing tens of thousands of \nvotes, maybe even hundreds of thousands, across the country.\\&quot;\n\nIn Florida, Leon County supervisor of elections Ion Sancho presided over a \ntrial \\&quot;mini-election\\&quot; to see if the vote could be hacked without being \ndetected. Before votes were actually cast, computer analyst Harri Hursti \n\\&quot;stuffed the ballot box\\&quot; by entering votes on the computer\\&amp;#039;s memory card. \nThen, after votes were cast, the results displayed when the same memory \ncard was entered in the central tabulating program indicated that fraud \nwas indeed possible. In other words, by accessing a memory card before an \nelection, someone could change the results -- which Diebold had denied was \npossible.\n\nUltimately, Bev Harris\\&amp;#039; research proved that the top-secret computerized \nsystems counting the votes in America\\&amp;#039;s public elections are not only \nfallible, but also vulnerable to undetectable hacking, from local school \nboard contests to the presidential race. With the electronic voting \nmachines of three companies -- Diebold, ES&amp;S and Sequoia -- collectively \nresponsible for around 80 percent of America\\&amp;#039;s votes today, the stakes \nfor democracy are high.\n\nOne of the executive producers of HACKING DEMOCRACY is Sarah Teale, whose \nprevious HBO credits include \\&quot;Dealing Dogs\\&quot; and \\&quot;Bellevue: Inside Out.\\&quot;\n\nHACKING DEMOCRACY was directed by Simon Ardizzone and Russell Michaels; \nproduced by Simon Ardizzone, Robert Carrillo Cohen and Russell Michaels; \nexecutive producers, Earl Katz, Sarah Teale and Sian Edwards; edited by \nSasha Zik. For HBO: supervising producer, John Hoffman; executive \nproducer, Sheila Nevins.\n","torrent":{"xt":"urn:btih:e486920ef343f082e8b646c59af24142ab268e1f","amp;dn":"Hacking.Democracy.WS.PDTV.XviD-SYS.%7BFIXED%7D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e486920ef343f082e8b646c59af24142ab268e1f","infoHashBuffer":{"type":"Buffer","data":[228,134,146,14,243,67,240,130,232,182,70,197,154,242,65,66,171,38,142,31]},"announce":[],"urlList":[]}}