{"title":"Stereoside - So Long","uid":3854210,"size":54883771,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4cbe81eb61c76e4b8d80103de223e2a15221f5f&amp;dn=Stereoside+-+So+Long&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boondocksaint78","files":1,"time":1193101601,"description":"Stereoside - So Long {Full Album - MP3}\n\n===================================================================================\n\nIn early 2006, STEREOSIDE?S founding members, Chris York (Drums), Ben Foster (Guitar-Vocals) and David Oliver (Bass) added 94.9 WTNT ?Tallahassee Idol? winner, Jeff Shields (Vocals). Instead of pursuing a career in Country music, Jeff rejected many major label offers to become the front man for STEREOSIDE. With Jeff?s unique and powerful vocals, a tight rhythm section, and driving guitars, STEREOSIDE was bound to be a rock powerhouse. \n\nIn March 2007, STEREOSIDE signed with fast-growing, indie label Bieler Bros. Records and without hesitation, entered the Bieler Bros. studio to record their debut album, ?So Long?. ?We made the record we wanted to make. We feel as though the record shines with our tribute to rock influences along with our own style, therefore, creating timeless rock songs.? Quotes STEREOSIDE. \n\nBy June 2007, STEREOSIDE finished production on their album, ?So Long?, and have slated a release on September 25th. The first single from the effort, ?Sinner? impacted active and alternative rock on May 1st and has been receiving overwhelming feedback from program directors across the country who have deemed the track ?a huge hit?. \n\nAs the single was released, there was a great response of support for the band. STEREOSIDE was invited by rock station WJBX to play alongside Buckcherry, Sevendust, and fellow label-mates Nonpoint. They have shared stages with the likes of Southern California Rockers and label-mates, Smile Empty Soul, Socialburn, The Exies, 10 Years, Kittie, 12 Stones, Buckcherry, Hinder, Papa Roach, Revelation Theory, Black Stone Cherry, Alterbridge and Drowning Pool. As a result of their powerful stage presence, STEREOSIDE has created a frenzy of fans nationwide. \n\nThe new single ?Sinner? continues to gain steam on at rock radio stations nationwide and has picked up several radio ads. In support of their debut release ?So Long?, STEREOSIDE has hit the road on tour in the southern part of the US. Check out STEREOSIDE as they begin their path to become the next great band in rock history! \n\n\n ","torrent":{"xt":"urn:btih:e4cbe81eb61c76e4b8d80103de223e2a15221f5f","amp;dn":"Stereoside+-+So+Long","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4cbe81eb61c76e4b8d80103de223e2a15221f5f","infoHashBuffer":{"type":"Buffer","data":[228,203,232,30,182,28,118,228,184,216,1,3,222,34,62,42,21,34,31,95]},"announce":[],"urlList":[]}}