{"title":"Oaxaca - Compromiso Cumplido - True to My Pledge","uid":3800620,"size":239594616,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:e5ae13e62b49db5c8f9f86f30640936217381b1f&amp;dn=Oaxaca+-+Compromiso+Cumplido+-+True+to+My+Pledge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jb15","files":1,"time":1189307949,"description":" &lt;a href=&quot;http://www.maldeojotv.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.maldeojotv.net&lt;/a&gt;\n\n&quot;Compromiso Cumplido&quot; is the first of a two-part documentary about the human rights violations during the current conflict in Oaxaca. The flim documents some of the horrors committed against the civil society of Oaxaca, and shows the strategy of state terrorism employed by the local governor. To date 25 known deaths have been reported, and yet there have been no criminal accusations or investigations for these murders.\n\nEn colaboracion con el ComitÃƒÂ© de Liberacion 25 de noviembre, presentamos : un documental que denuncia las violaciones a los Derechos Humanos cometidas por el gobierno de Ulises Ruiz Ortiz, durante las movilizaciones sociales que estremecieron Oaxaca en 2006, y que dieron como resultado mÃƒÂ¡s de 25 asesinatos registrados por el movimiento popular.\n\nCOMPROMISO CUMPLIDO documenta 6 casos de asesinatos politicos ocurridos en 2006 en Oaxaca. Descubre una estrategia de terrorismo de Estado implementada y la impunidad en que permanecen sus autores.\n\nLos ingresos que genere la venta de este documental seran destinados iÂ­ntegramente para apoyar a las familias de los companeros caiÂ­dos.  Por favor, estele en contacto con Mal de Ojo sobre donaciones.\n\nEsta produccion es un trabajo colectivo que se realiza gracias al apoyo solidario de muchas personas e instituciones. Reconocemos sus esfuerzos, aunque por el momento omitimos sus nombres.\n\n* I am uploading this only to distribute information about the ongoing situation in Oaxaca.  Unlike other videos, which cut into corporate profits, the proceeds of this video go to efforts to free political prisoners.  If you are able to help out, go to the website listed above to get in touch with the necessary people.  Thanks!","torrent":{"xt":"urn:btih:e5ae13e62b49db5c8f9f86f30640936217381b1f","amp;dn":"Oaxaca+-+Compromiso+Cumplido+-+True+to+My+Pledge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ae13e62b49db5c8f9f86f30640936217381b1f","infoHashBuffer":{"type":"Buffer","data":[229,174,19,230,43,73,219,92,143,159,134,243,6,64,147,98,23,56,27,31]},"announce":[],"urlList":[]}}