{"title":"SUPERMAN_RETURNS.ISO","uid":3694513,"size":4681418752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e7cef353e2b8e56c2f0dd0d6023e4b23961e904c&amp;dn=SUPERMAN_RETURNS.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"natasja969","files":1,"time":1179856906,"description":"Copy from retail \n\n\nAfter eliminating General Zod &amp; the other Kryptonian arch-villains, Ursa &amp; Non, Superman leaves Earth to try to find his former home world of Krypton after astronomers have supposedly found it. When he finds nothing but remnants, he returns home to Earth - to find out that Lois Lane is engaged to a relative of his boss, and that Lex Luthor is at it again - after swindling an elderly, terminally ill woman. The psychopathic Luthor, whose plans to destroy California failed because of Superman&amp;#039;s heroics, vows vengeance against the Man of Steel and contrives a new sinister plot - using the crystals of Krypton to build a continent that will wipe out most of North America! Embedded in the continent&amp;#039;s structure is Kryptonite - the lethal substance that is Superman&amp;#039;s only weakness. Upon learning of Luthro&amp;#039;s sinister scheme, Superman must again race against time to stop the psychopathic Luthor before millions - possibly billions - are killed. Written by Derek O&amp;#039;Cain \n\nThe latest installment of the Man of Steel; the story presented as a Christian parable. After leaving Earth for 5 years to visit his home planet, Superman returns to find that Earth has lost hope in him as its savior. We are reminded that Jor-El has sent his only son to Earth because people are basically good. We get to see Superman rekindle his relationship with Lois Lane, who now has a son of questionable paternity; could it be Superman&amp;#039;s son being raised by another man. Superman fights the evil in the form of Lex Luther. Can Superman save humanity? Does humanity have faith in him? Written by anonymous \n\nPlotting against his demise Lex Luthor, once more wants to take over the world by creating his very own, and in the process wiping out the lives of billions. After a five-year absence, looking for remnants of his home planet long gone his return finds Lois as a new mother and a new world that has become unrecognisable, his return could not be better timed. With the world once again at the mercy of a madman, it is up to Superman to once again safe us all. Can he too return the world around and defeat his evil adversary and the peril that hangs over us forever? Written by Cinema_Fan \n\nAfter a long period in the space, looking for the remains of planet Krypton, Superman returns to Earth. He misses Lois Lane, who lives with Richard White and has a son. Meanwhile, Lex Luthor plots an evil plan, using crystals he stole from the Fortress of Solitude, to create a new land and submerge the USA. Written by Claudio Carvalho, Rio de Janeiro, Brazil \n","torrent":{"xt":"urn:btih:e7cef353e2b8e56c2f0dd0d6023e4b23961e904c","amp;dn":"SUPERMAN_RETURNS.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7cef353e2b8e56c2f0dd0d6023e4b23961e904c","infoHashBuffer":{"type":"Buffer","data":[231,206,243,83,226,184,229,108,47,13,208,214,2,62,75,35,150,30,144,76]},"announce":[],"urlList":[]}}