{"title":"Star Trek-the original series-Vol.2-Eps.4-5 (DVDRip.DivX.Wide)","uid":3819262,"size":730743128,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e812252a630c9d39eddb618d703eabb88170a8f8&amp;dn=Star+Trek-the+original+series-Vol.2-Eps.4-5+%28DVDRip.DivX.Wide%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skippytroy","files":5,"time":1190763528,"description":"This second volume of episodes on DVD from the original Star Trek includes the popular and sexy &quot;Mudd&amp;#039;s Women,&quot; which introduces the character of interstellar huckster and fugitive Harry Mudd (Roger C. Carmel, later to return in another classic episode, &quot;I, Mudd&quot;). The Enterprise beams aboard Harry and three beautiful and scantily clad women whom the con man is carrying as cargo. The transport damages the starship, forcing Captain Kirk (William Shatner) to take a detour to a mining world for a supply of dilithium crystals. Harry uses the women as bait to get the miners to help him flee from the authorities--but a revelation about his liberal use of an attraction-enhancement drug adds a twist to things. This clever and novel installment in the series grafted the unlikely element of a petty, colorful crook onto a science fiction show, an obvious forerunner of Deep Space Nine&amp;#039;s inclusion of Quark among its own major characters. \nAlso in this volume is another outstanding episode, &quot;The Enemy Within.&quot; Written by renowned novelist-screenwriter Richard Matheson (The Incredible Shrinking Man), the story proposes a transporter malfunction that results in Captain Kirk being divided into two versions of himself, one aggressive and brutal, the other sensitive and good. Essentially, the personality mix that makes Kirk an effective leader and balanced man is scattered like so many marbles, and the result is one captain running around mauling women and wreaking havoc while the other is frightened and indecisive. The production is very effectively done, and Shatner&amp;#039;s performance is among his most interesting. --Tom Keogh \n\nProduct Description\n&quot;Mudd&amp;#039;s Women&quot; (Ep.4): Conman Harry Mudd brokers the marriage of three beautiful women to a mining colony to escape Kirk. &quot;The Enemy Within&quot; (Ep.5): A transporter malfunction splits Kirk into good and evil entities. \n\n","torrent":{"xt":"urn:btih:e812252a630c9d39eddb618d703eabb88170a8f8","amp;dn":"Star+Trek-the+original+series-Vol.2-Eps.4-5+%28DVDRip.DivX.Wide%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e812252a630c9d39eddb618d703eabb88170a8f8","infoHashBuffer":{"type":"Buffer","data":[232,18,37,42,99,12,157,57,237,219,97,141,112,62,171,184,129,112,168,248]},"announce":[],"urlList":[]}}