{"title":"Uprising.pal.2001.multisubs","uid":3699551,"size":10511915055,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e8a2d31c00141646bfcf0120ba5009701eb7de84&amp;dn=Uprising.pal.2001.multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"=michael=","files":36,"time":1180379241,"description":"Imdb title:    &lt;a href=&quot; http://www.imdb.com/title/tt0250798/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0250798/&lt;/a&gt;\nMoviemeter:    &lt;a href=&quot; http://www.moviemeter.nl/film/5769&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/5769&lt;/a&gt;\n\nEnglish dicription\n\nUsing radically refashioned archival footage of the Warsaw ghetto, this interview with Jon Avnet the director of Uprising talks about Marek Edelman who is an evocative memoir of his role in the rebellion that held back the Nazis for almost a month in 1943. The film begins with the growing list of prohibitions and regulations leading to the virtual imprisonment of about half-a-million Polish Jews in an old slum district of Warsaw with inadequate space and plumbing. An overhead tracking shot shows the number of people assembled in the first months of the relocation. The daily struggle against hunger and disease, especially among the dispossessed arrivals seen in their pitful rags, is aggravated by the German demands for \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;deportations to the east\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; that many begin to suspect are camouflaged mass murders. By the close of 1942, people living in the ghetto realize they are doomed, and the rudiments of resistance are planned by a handful of the young, including Edelman. Following some sporadic, spontaneous fighting at the ghetto railhead, the Umschlagplatz, in January, led by Moredecai Anielewicz, the scene is set for the more famous and prolonged battle that will begin on 19 April 1943. In the intervening time, many of the ghetto residents construct hidden shelters or bunkers in the basements and cellars of the buildings, often with tunnels leading to other buildings. The handful of fighters who have weapons take to these shelters, giving the uprising the advantage of defensive positions. Written by Leonard Rubenstein \n\nNederlandse beschrijving\n\nVerenigde Staten\nDrama / Oorlog\n163 minuten\n\ngeregisseerd door Jon Avnet\nmet Leelee Sobieski, David Schwimmer en Jon Voight\n\n18 Januari, 1943. Nazi-soldaten overrompelen het getto van Warschau voor een opdracht die ze al talloze malen hebben uitgevoerd: joden verzamelen om ze op het transport naar het dodenkamp van Treblinka te zetten. Maar dit keer gaat het niet als gepland. Gewapende mannen en vrouwen van de Jewish Fighting Organization mengen zich tussen de massa gedeporteerden. Als het signaal klinkt, storten ze zich in een laatste wanhoopspoging op hun belagers.\n\nAudio 5.1 dolby digital:\n\nEnglish French Italian\n\nSubtitles:\n\nDutch / Nederlands English French Italian Arabic Spanisch Portugees German Bulgarian Romanian\n\nIt is a full dvd\nDVD is riped by dvd fab platinum\nExtra\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s and menu untouched\n\nDont forget to seed!!!","torrent":{"xt":"urn:btih:e8a2d31c00141646bfcf0120ba5009701eb7de84","amp;dn":"Uprising.pal.2001.multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8a2d31c00141646bfcf0120ba5009701eb7de84","infoHashBuffer":{"type":"Buffer","data":[232,162,211,28,0,20,22,70,191,207,1,32,186,80,9,112,30,183,222,132]},"announce":[],"urlList":[]}}