{"title":"Mcafee Parental Control 2007","uid":3795796,"size":16728047,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e9566c4590d3410f5fc58a3cf11f2abde5f004ed&amp;dn=Mcafee+Parental+Control+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"knoxkiller","files":2,"time":1188952279,"description":"McAfee Parental Controls helps parents protect their children from the unknown dangers of the Internet. It lets parents manage how each child can communicate across the Internet. McAfee Parental Controls includes child-specific settings for web pages, chat filtering, objectionable word filtering, online time limits, and more! \nBenefits \n\n\nIdentity Protection \nMcAfee Parental Controls can secure your personal identification and financial information (name, phone number, address, credit card and bank account numbers), and prevent these and other specified pieces of information about you or your family from being transmitted out over the Internet without your permission, enhancing your privacy and helping to protect your identity. \n\n\nFilters Chat \nMcAfee Parental Controls offers chat filtering protection for both instant messaging and chat rooms. Your child won\\&amp;#039;t be exposed to unsuitable discussion or send personal information inadvertently. \n\n\nBlocks Web Sites \nWith McAfee Parental Controls you are able to control the content you feel is inappropriate. Customize the objectionable word list and web site list to your needs so that you can be the judge of the content that you allow/ disallow. \n\n\nEasy override \nIf a web page gets wrongly blocked, simply put in the master password to allows always or even just one time. This ensures complete customization. \n\n\nAllows Multiple Users \nSet up as many users as you want with McAfee Parental Controls. Each user has his/ her own user id and password for protection. \n\n\nInternet Access Times \nSet Internet time limits with McAfee Parental Controls. Stop users from being on the Internet when they shouldn\\&amp;#039;t be. \n\n\nActivity logs \nEasily track a user\\&amp;#039;s activity with the activity logs. These are only presented to the master user so that no one else is able to tamper with them. \n\n\nSystem Requirements \n\n\nCD-ROM Drive \nMicrosoft Windows Vista, XP Home, XP Pro, 2000 Pro, ME, 98 \nInternet Explorer 4.01, SP 2 \n32 MB RAM \n40 MB Hard Disk Space \nPentium 100 MHz or higher processor \nInternet Access is required for some features \n","torrent":{"xt":"urn:btih:e9566c4590d3410f5fc58a3cf11f2abde5f004ed","amp;dn":"Mcafee+Parental+Control+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9566c4590d3410f5fc58a3cf11f2abde5f004ed","infoHashBuffer":{"type":"Buffer","data":[233,86,108,69,144,211,65,15,95,197,138,60,241,31,42,189,229,240,4,237]},"announce":[],"urlList":[]}}