{"title":"PhotoFiltre Studio 9.1.0","uid":3952436,"size":8542775,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea0e923f9c36f6dcc6a84764ab821b6a92cc38e6&amp;dn=PhotoFiltre+Studio+9.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":4,"time":1198937479,"description":"PhotoFiltre Studio is a complete image retouching program. It allows you to do simple or advanced adjustments to an image and apply a vast range of filters on it. It is simple and intuitive to use, and has an easy learning curve. The toolbar, giving you access to the standard filters with just a few clicks, gives PhotoFiltre a robust look. Its wide range of filters allows novice users to familiarize themselves with the world of graphics. You can find the standard adjustment functions (Brightness, contrast, dyed, saturation, gamma correction) and also artistic filters (watercolor, pastels, Indian ink, pointillism, puzzle effect). There are more than 100 filters to be discovered ! \n\nPhotoFiltre uses two types of vectorial selections. The first type uses automatic shapes (rectangle, ellipse, triangle, rhombus, rounded rectangle). The second type corresponds to the lasso and polygon. They both allow a customized form by drawing a shape by hand or using a series of lines. Every selection can be saved into a seperate file, to be used later on.\n\nCompatibility : Win 98, Win Me, Win NT, Win 2000, Win XP, Vista \n\nChanges in PhotoFiltre Studio 9.0.0:\n- Show EXIF base information for the format Raw (menu File &gt; Image properties) \n- Improvement of the filter Gradient (more directions) \n- Improvement of the Copyright module (vertical center display) \n- New deformation Ellipse \n- All transformations (rotation, distort, ...) use a bicubic interpolation \n- Improvement of the Deformation brush tool (more precise) \n- Deformation tools have a real time preview\n- The functions Offset, Replace color, Replace color range, Indexed colors, Stroke and fill and Custom filter have a direct preview option\n- The Transparent color button is active for layers (contextuel) \n- Supports DNG format \n- Drawin tools can use true size cursors \n- Improvement of the filter Emboss (dialog box) \n- Improvement of the Clone stamp tool (clone from other image or layer) \n- The texture module can load external texture files\n- New Perspective correction module \n- New Horizon correction module \n- Improvement of the filter Radial blur\n- Improvement of the filter Motion blur (dialog box) \n- Improvement of the filter Radial masque (dialog box) \n- New filter Circular blur \n- The drawing tools can draw on transparent area of a layer \n- Improvement of the Erase tool (Invert mode for Alpha channel) \n- Show active layer bounds \n- The functions Progressive contour and Contour 3D auto select the layer\n- Possibility to add layers in RGBA mode (transparent background) \n- Improvement of the image explorer (scan textures and multiline display) \n- Some source code improvment and bugs fixing \n- New logo\n- Perspective and horizon correction modules\n- Display the true size cursor (drawing tools)\n- A lot of new masks, selections and nozzles in the full version Works with Windows Vista !\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:ea0e923f9c36f6dcc6a84764ab821b6a92cc38e6","amp;dn":"PhotoFiltre+Studio+9.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0e923f9c36f6dcc6a84764ab821b6a92cc38e6","infoHashBuffer":{"type":"Buffer","data":[234,14,146,63,156,54,246,220,198,168,71,100,171,130,27,106,146,204,56,230]},"announce":[],"urlList":[]}}