{"title":"This is Techno Body Music","uid":3580567,"size":372150547,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb99413728f804acb136dd408f1c5bb612747829&amp;dn=This+is+Techno+Body+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Elomiem","files":26,"time":1166640010,"description":"?This is TBM: Techno?Body? Music!? Andy LaPlegua of COMBICHRIST blasts at his sweating and happily exhausted audience, which thankfully gives in to his rhythmic attacks. TBM? Yes, correct! It is time to bring together what should have belonged together initially! Based on the same roots ? KRAFTWERK, D.A.F., and the electronic New Wave ? minimal, rhythm-based sound structures evolved in the Eighties, all heeding to one cause: to get the body in motion, to make the blood curdle, to bring the sweat upon your brow! Fitting this agenda, this musical style was soon called ?Electronic Body Music? ? EBM in short. At the end of that decade, some of the involved musicians decided to simplify the basic structure even more and a musical style footing on a reduced four-to-the-floor-beat was born. Being generated by electronic sound devices, the style was simply called Techno. There were no strict borderlines in the old days and the DJ?s would cater to fans of both genres due to fact that the basic goal of both the ravers and the EBM-fans was the same: to dance to electronic music! In the Nineties, the two scenes started to alienate themselves from each other ? although the musical roots and goals still basically remained the same. The artists themselves, though, could not care less about this separation ? most of the old Techno DJ?s had once been active in the EBM-scene and had been dancing in the same clubs. Thus, between the musicians and DJ?s there has always been an active exchange of styles and ideas, albeit passively ? and acts like COMBICHRIST, VNV NATION, and FIXMER/MCCARTHY on the one side and DJ HELL, SVEN VATH, T.RAUMSCHMIERE, and CHRIS LIEBING were wildly mixing the styles and ideas of both musical schools. Thus, TBM ? Techno Body Music ? is actually only a logical consequence. The most creative heads of both worlds join together to unite what belongs together! TBM will break down the walls inside the heads of the people by putting the best of two scenes under one common term. Therefore, this year there can only be one dominating trend in the electronic world. The Electro-scene speaks one language: Techno Body Music! Features tracks by VNV NATION, KIEW, NITZER EBB, COMBICHRIST, TERENCE FIXMER, THE HORRORIST, THE HACKER, THOMAS P. HECKMANN, ALTER EGO, ALEX SMOKE, and others ? 26 tracks on a double CD! On Out of Line.\n\nDISC 1\n\n01. David Guetta - The World Is Mine (Remix by Blackstrobe)\n02. Thomas P. Heckmann - El Hazzared\n03. Zombie Nation - Inside The Speaker\n04. DJ Scandy - Touch It\n05. Anthony Rother - Back Home\n06. T.D.L.L. - Soulhunter (Body Formed)\n07. Mediengruppe Telekommander - Bis Zum Erbrechen Schreien (Tim Wright remix)\n08. VNV Nation - Interceptor (ABM Version)\n09. T-Raumschmiere - Querstromzerspaner (LFO RMX)\n10. Hell &amp; Heil - P.D.D (JH ltd)\n11. Kiew - Zimmer 72 (Rob Acid Remix)\n12. Vitalic - Candy\n13. David CArretta - Kill Your Radio\n\nDISC 2\n\n01. Alter Ego - Satanic Circus\n02. Johannes Heil feat. Marcellus Nealy - Step Into the Light\n03. Beyer &amp; Lenk feat. Tiga - Ananda\n04. Nitzer Ebb - Control I&amp;#039;m Here (the Hacker remix)\n05. Atomizer - Hooked On Radiation (Orange Alert Mix, by Pet Shop Boys)\n06. Analogue Brain - Dead Keen On (Cut One) v2\n07. Terence Fixmer - Danse Avec Les Ombres\n08. Combichrist - This is TBM\n09. The Horrorist - Virus (Northern Lite remix)\n10. Richard Bartz - Tuffguy\n11. Alex Smoke - Sortie\n12. Basteroid - Against Luftwiderstand (Ada + Metope + Jake Fairley RMX)\n13. The Hacker feat. Perspects - Flesh and Bone\n\nGenre: Electro Techno \n\nripped by me in 320 CBR etc etc etc\n","torrent":{"xt":"urn:btih:eb99413728f804acb136dd408f1c5bb612747829","amp;dn":"This+is+Techno+Body+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb99413728f804acb136dd408f1c5bb612747829","infoHashBuffer":{"type":"Buffer","data":[235,153,65,55,40,248,4,172,177,54,221,64,143,28,91,182,18,116,120,41]},"announce":[],"urlList":[]}}