{"title":"Douglas Adams &amp; Terry Jones - Starship Titanic (1997)","uid":3586485,"size":73546306,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ecc6bd0fa6d3507602e297bf455c7e3a225fa54d&amp;dn=Douglas+Adams+%26+Terry+Jones+-+Starship+Titanic+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"made-of-technetium","files":12,"time":1167501070,"description":"Starship Titanic\nDouglas Adams ? Terry Jones\n\n32kbit\n22050Hz Mono\n\nIntroduction\n\nThe idea for Starship Titanic first surfaced in the way that a lot of ideas originate, as a mere couple of sentences out of nowhere. Years ago it was just a little digression in Life, the Universe and Everything. I said that the Starship Titanic had, shortly into its maiden voyage, undergone Spontaneous Massive Existence Failure. It&amp;#039;s just one of those bits that you put in while you are waiting for the plot to develop. You think, &amp;#039;Well, I&amp;#039;ll develop another quick plot while I&amp;#039;m about it.&amp;#039; So it sat there as a couple of sentences in L, U &amp; E and after a while I thought, &amp;#039;Well, I think there is a little bit more to this idea,&amp;#039; and tossed it around for a while. At one point I even considered developing it as a novel in itself and then thought, no, it sounded too much like a good idea, and I&amp;#039;m always wary of those.\nIn the mid eighties I did a text-only computer game version of The Hitch-Hiker&amp;#039;s Guide with a company called Infocom. I had a lot of fun working on it. The player gets caught up in a virtual conversation with the machine. In writing such a thing you are trying to imagine and prepare for the reactions of a virtual audience.\nThere&amp;#039;s a lot you can do with text, as several thousand years of human culture can attest, but it seemed to me that what the computer enabled us to do was to reach back to the days before printing and recreate the old art of interactive storytelling. They didn&amp;#039;t call it interactive in those days, of course. They didn&amp;#039;t know of anything that wasn&amp;#039;t interactive, so they didn&amp;#039;t need a special name for it. When someone stood up and recounted a story, the audience responded. And the storyteller responded right back at them. It was the coming of print that took away the interactive element, and locked stories into rigid forms. It seemed to me that interactive computer-mediated storytelling might be able to combine some of the best of both forms. However, while the medium was still in its infancy, along came computer graphics and killed it off. Text may be a very rich medium, but it looks boring on the screen. It doesn&amp;#039;t flash and hop about and so it had to give way to things that did.\nEarly computer graphics, of course, were slow, crude and ugly. As a medium it didn&amp;#039;t interest me, so I thought I&amp;#039;d sit things out and wait till the graphics got good.\nTen years later they were good. But interaction had largely been reduced to pointing at things and clicking. I missed the conversations that text games used to engage you in. Maybe, I thought, it would be possible to combine both...\nAt about this time, I was involved with a group of friends in the setting up of a new digital media company, The Digital Village (&lt;http://www.tdv.com&gt;). I began to cast around for a good subject for our first big project, a CD-ROM adventure game that would combine state-of-the-art graphics with a natural language parser which would enable the player to engage the characters in conversation. Suddenly, Starship Titanic stood out from the pack.\nAs we embarked on what grew into a huge project, the subject of novelization came up. Now, writing novels is what I normally do, and here was a peach because, in an amazing departure from my normal practice, I had developed a story which not only had a beginning but also a middle and (phenomenally enough) a recognizable end. However, the publishers insisted that the novel would have to come out at the same time as the game to enable them to sell it. (This struck me as odd since they had managed previously to sell books of mine without any attendant CD-ROM game at all, but this is publisher logic, and publishers are, as we all know, from the planet Zog.) I couldn&amp;#039;t do both simultaneously. I had to accept that I couldn&amp;#039;t do the novel except at the cost of not doing what I had set out to do in the first place, which was the game. So who could possibly write the novel?\nAbout this time, Terry Jones came into the production office. One of the characters in the game is a semi-deranged workman&amp;#039;s parrot which had been left on board the ship, and Terry had agreed to play the voice part. In fact it was clearly the part he had been born to play. When Terry saw all the graphics and character animations we had been creating over the previous months he became very excited about the whole project and uttered the fateful words,\n&amp;#039;Is there anything else you need doing?&amp;#039; I said,\n &amp;#039;You wanna write a novel?&amp;#039; and Terry said,\n&amp;#039;Yeah, all right. Provided,&amp;#039; he added, &amp;#039;I can write it in the nude.&amp;#039;\nTerry is one of the most famous people in the known universe, and his bottom is only slightly less well known than his face. It has, of course, only been displayed when strictly necessary on artistic grounds, but such is the nature of his art that this has turned out to be extraordinarily often. From NakedMan Playing Organ and Man in Bed with Carol Cleveland from the Monty Python TV show, to Naked Hermit in Pit in Monty Python&amp;#039;s Life of Brian (a movie that he directed naked, while the rest of the cast remained largely clothed), the creative life has been one long nudist romp for Mr Jones. He is also renowned as a film and TV director, scriptwriter, medieval scholar, author of children&amp;#039;s books, including the award-winning The Saga of Erik the Viking, but none of these activities provide quite enough sheer kit removal opportunities for him. Hence his stipulation that he would write Starship Titanic in the nude. In comes all the freshness, lightness, and lyrical vulnerability of a man sitting at his word processor butt-naked.\nI&amp;#039;ve always wanted to collaborate on something with Terry ever since I first met him almost twenty-five years ago, wearing a pretty floral dress and heaving a small tactical nuclear device on to the back of a cart in a leafy suburban street in Exeter. As you are about to discover, he has written an altogether sillier, naughtier and more wonderful novel than I would have done and in doing so has earned himself an altogether unique credit - \nParrot and Novel by Terry Jones\n","torrent":{"xt":"urn:btih:ecc6bd0fa6d3507602e297bf455c7e3a225fa54d","amp;dn":"Douglas+Adams+%26+Terry+Jones+-+Starship+Titanic+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc6bd0fa6d3507602e297bf455c7e3a225fa54d","infoHashBuffer":{"type":"Buffer","data":[236,198,189,15,166,211,80,118,2,226,151,191,69,92,126,58,34,95,165,77]},"announce":[],"urlList":[]}}