{"title":"DJ MENTZIK - MIXAMIX_20040323","uid":3547797,"size":101018271,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ecc8dd372f64bc64d9cea412c4393ca3a63f3617&amp;dn=DJ+MENTZIK+-+MIXAMIX_20040323&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mentzik","files":21,"time":1162138166,"description":"DEAR MUSIC LOVERS,\n\nThis mixed music cd is one of my MIXAMIX series.\nThis cds are made mainly as road music but some of them can be easily used for parties.\nI make this cds to accompany me and my friends at car or excursions.\n\nThe motive for making these cds was the fact that I could not find a radio station \nplaying the music I like without interuptions. So I started making my 1hour and a half music experience.\nI like various kinds of music and like to hear them intermixed. That is a risk no radio station takes and also not \nmany djs in the world. Till now only Paul Oakenfold has managed to marry many kinds and ages of music together.\n\nAnyways, hope you enjoy this mixed disks as much as I do.\nRemember that I am not professional, I do this as a hobby.\nThe date after MIXAMIX is the date I have started creating each of this cds. \nThe creation may take from just one day to many months.\n\nA few words about this DJ MENTZIK - MIXAMIX_20040323:\nOk this is a real mix. It was made in Spring of 2004. Purpose to impress a girl with my driving a mixing skills. \nAfter one hour we arrived next to the sea and I had my first kiss from her :). Success.\nSo u understand that it is one of my favorites. \nIn this mix I try to bring together old and new versions of songs.Includes great tracks of old electronics schene.\nOldtimers here is Stereo Nova(greek schene), FFC(greek schene) , Anne Clark, U2, Outfield, Westbam and Nena and many more...\nI really enjoy this!\n\nDj Mentzik (http://www.musicalgalaxy.com)\n","torrent":{"xt":"urn:btih:ecc8dd372f64bc64d9cea412c4393ca3a63f3617","amp;dn":"DJ+MENTZIK+-+MIXAMIX_20040323","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc8dd372f64bc64d9cea412c4393ca3a63f3617","infoHashBuffer":{"type":"Buffer","data":[236,200,221,55,47,100,188,100,217,206,164,18,196,57,60,163,166,63,54,23]},"announce":[],"urlList":[]}}