{"title":"[Kung Fu] Bruce Lee Against Supermen (Bruce Li, 1975) - DVD/Rmvb","uid":3790900,"size":453932472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:edec7113799cdf8c26c93634df7b57486ba175bd&amp;dn=%5BKung+Fu%5D+Bruce+Lee+Against+Supermen+%28Bruce+Li%2C+1975%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1188599754,"description":"Bruce Lee Against Supermen (Bruce Li, 1975)\n\n\nReviewed from: UK video (Inter-Ocean Video, early 1980s)\n\nQuite gobsmackingly, this casts Bruce Li as Kato, assistant to the Green Hornet! In the opening scene, he?s wearing the chauffeur?s uniform, mask and cap and all. It?s quite blatant copyright infringement but presumably designed to appeal to all those folks in Hong Kong who felt that Kato was the real star of the series.\n\nThe story itself concerns Dr Ting and his new formula which will end world hunger (it involves extracting albumen from petroleum apparently!). Dr Ting is kidnapped, and so is his daughter Alice. Kato (which everyone pronounces like ?Carter?) and his friend spend a lot of time chasing the bad guys, who work for master criminal Tiger. So we have the world?s dullest car-chase, as two small cars hurtle along the roads of Hong Kong at about 30 miles an hour, and a similarly mind-numbing and overlong foot-chase. There?s also a ridiculous sequence where Kato follows the car - on foot, pulling a rickshaw!...\n\nDirector: CC Wu (on screen), Wu Chia Chun (on box)\nWriter: Yao Ching Kong (on screen), Yiu Hing-Hong (on box)\nProducer: Wu Men Chao\nCast: Bruce Li, Lung Fei, Lu Lu Wen\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:edec7113799cdf8c26c93634df7b57486ba175bd","amp;dn":"%5BKung+Fu%5D+Bruce+Lee+Against+Supermen+%28Bruce+Li%2C+1975%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edec7113799cdf8c26c93634df7b57486ba175bd","infoHashBuffer":{"type":"Buffer","data":[237,236,113,19,121,156,223,140,38,201,54,52,223,123,87,72,107,161,117,189]},"announce":[],"urlList":[]}}