{"title":"High.School.Musical.2006.TVRip.XviD-DGNL","uid":3830998,"size":737746473,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:efc7d44686a84bedfa8e40d81c737ca63027cd75&amp;dn=High.School.Musical.2006.TVRip.XviD-DGNL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rom10","files":53,"time":1191614072,"description":"High School Musical is an American telefilm. Released on January 20, 2006, it was one of the most successful Disney Channel Original Movies (DCOM) produced, with a television sequel released August 17, 2007 and a feature film sequel in the planning process.[2] The film&amp;#039;s soundtrack was the best-selling album of 2006.[3] The film was shot almost entirely in the Wasatch Front in Utah (namely Salt Lake City and Murray).\n\nWith a plot described as a modern retelling of Romeo &amp; Juliet,[4] High School Musical is a story of two high school juniors from rival cliques: Troy Bolton (Zac Efron), captain of the basketball team, and Gabriella Montez (Vanessa Hudgens), a shy transfer student who excels in math and science. Together, they try out for the lead parts in their high school musical, and as a result, divide the school. Despite other students&amp;#039; attempts to thwart their dreams, Troy and Gabriella resist peer pressure and rivalry, inspiring others along the way not to &quot;stick with the status quo.&quot;\n\nThis was Disney Channel&amp;#039;s most successful movie at its time with 7.7 million viewers in its premiere broadcast in the US. In the UK, it received 789,000 viewers for its premiere (and 1.2 million viewers overall during the first week), making the film the most watched program for the Disney Channel (UK) of 2006. It was also the first ever Disney Channel Original Movie to be broadcast on the BBC on December 29, 2006 . On August 16, 2007 ratings went slightly up to 6.0 million viewers.\n\n-------------------\n\nEnjoy this release!\n\nNote: Hebrew Subs are supplied for the Israelis among us :)","torrent":{"xt":"urn:btih:efc7d44686a84bedfa8e40d81c737ca63027cd75","amp;dn":"High.School.Musical.2006.TVRip.XviD-DGNL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc7d44686a84bedfa8e40d81c737ca63027cd75","infoHashBuffer":{"type":"Buffer","data":[239,199,212,70,134,168,75,237,250,142,64,216,28,115,124,166,48,39,205,117]},"announce":[],"urlList":[]}}