{"title":"Abexo Registry Cleaner 5.0.0.0","uid":3693453,"size":2987610,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f0331acec844944186e0918f90db6535a4304389&amp;dn=Abexo+Registry+Cleaner+5.0.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boorstar","files":6,"time":1179765656,"description":"Abexo Registry Cleaner is a utility software? to make your computer run smoother and faster, achieving this by cleaning and compressing the registry. By time Windows registry gathers a lot of invalid entries that cause system complications and slow down your computer significantly. Included in Abexo Registry Cleaner is a registry defragmenter also called compressor which removes the empty spaces after a cleanup and thereby reduces registry size. Registry defragmentation increases the performance of your computer dramatically. Supported platforms: Windows Vista and Windows XP.\n\nAbexo Registry Cleaner Features:\n- Disk cleanup\n- Scan disk\n- Disk defrag\n- Registry backup\n- Registry cleanup\n- Registry defrag\n- Computer shutdown/restart\n\nRegistry is a database where Windows and programs store their data. When data changes i.e. you delete a file, the registry doesn&amp;#039;t remove the invalid data, thus in this case a reference to a non-existent file remains in the registry.\nAs the registry gets filled with invalid data, Windows and programs consume more system resources to search the database for any data. Therefore your computer gets slower and slower. Last but not least, passing invalid data to Windows programs can cause severe system complications resulting in system crash, hang and malfunction.\n\nAfter a registry cleanup the invalid entries leave empty spaces, which means the size of the registry remains unchanged. It goes without saying that loading a small registry is faster than a big one.\n\nThe Auto run feature is a one-click registry backup, registry cleanup and registry defrag.\n\nFurthermore if you own a copy of Abexo defragmenter you can configure them to work together. Just click a button and go to bed. All of the following tasks will be performed while you are asleep.\n\nHomepage - http://www.abexo.com/registry-cleaner.htm","torrent":{"xt":"urn:btih:f0331acec844944186e0918f90db6535a4304389","amp;dn":"Abexo+Registry+Cleaner+5.0.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0331acec844944186e0918f90db6535a4304389","infoHashBuffer":{"type":"Buffer","data":[240,51,26,206,200,68,148,65,134,224,145,143,144,219,101,53,164,48,67,137]},"announce":[],"urlList":[]}}