{"title":"[Kung Fu] Bruce Lee's Secret aka Bruce Lee's Deadly Kung F","uid":3822619,"size":481976844,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0a32e40097d6090cef2011fc32e730675ac2a71&amp;dn=%5BKung+Fu%5D+Bruce+Lee%5C%27s+Secret+aka+Bruce+Lee%5C%27s+Deadly+Kung+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1191001920,"description":"Bruce Lee&amp;#039;s Secret aka Bruce Lee&amp;#039;s Deadly Kung Fu (Bruce Li, Carter Wong, 1976) ES\n\nAvg. Rating:  \t\n  2.5 / 5 (based on 2 ratings).\n\nPlot:\tThe power-packed tale of the Little Dragon&amp;#039;s battle to create the Way of the Intercepting Fist.\n\nOverview:\tNOTE: This film does not have Bruce Lee in it. It has Bruce Li. The film is about a character sometimes called Bob, sometimes called Bruce, and sometimes called Mr. Lee. The synopsis refers to the main character as Bruce Lee.\n\nWhen Bruce Lee first came to the United States, he began teaching Wing Chun kung fu. He, with many martial talents, soon found himself in the midst of a well established kung fu society that didn&amp;#039;t take kindly to his outspoken mannerisms. It wasn&amp;#039;t long before his abilities were challenged by a hired group of body-bashers. Like a streak of lightning, he served them all a flurry of knuckle sandwiches which didn&amp;#039;t go down too lightly with their boss.\n\nNot too long after this incident, the &quot;Little Dragon&quot; became the target of a hired professional exterminator. Although surviving the encounter, Bruce had discovered that his Wing Chun style was not suitable for American street fighting. More determined than ever, he began to search for a new method of combat. Thus, the &quot;way of the intercepting fist&quot; (Jeet Kune Do) was born.\n\nThe way that is no way and the style that becomes no style is portrayed in a tremendous climax of bone-crushing kung fu techniques which leave little doubt as to the proficiency of Bruce Lee&amp;#039;s new and deadly art.\n\nCast: \tHo Chung Tao (Bruce Li)  ||  Hwang Jang Lee  ||  Carter Wong (Ka Tat)  ||  Robert Kerver  ||  Roy Horan \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.1649/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.1649/qx/details.htm&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:f0a32e40097d6090cef2011fc32e730675ac2a71","amp;dn":"%5BKung+Fu%5D+Bruce+Lee%5C%27s+Secret+aka+Bruce+Lee%5C%27s+Deadly+Kung+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a32e40097d6090cef2011fc32e730675ac2a71","infoHashBuffer":{"type":"Buffer","data":[240,163,46,64,9,125,96,144,206,242,1,31,195,46,115,6,117,172,42,113]},"announce":[],"urlList":[]}}