{"title":"[Kung Fu] Game Of Death I (Bruce Lee, 1978) EN - DVD/Rmvb","uid":3790934,"size":450872785,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f18f448ef24da5a0aeb9b25e78dc12bb4650c6fd&amp;dn=%5BKung+Fu%5D+Game+Of+Death+I+%28Bruce+Lee%2C+1978%29+EN+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1188601563,"description":"Game Of Death I (Bruce Lee, 1978) - REMASTERED\n\n\nAvg. Rating:  \t\n  3.7 / 5 (based on 8 ratings).\n\nOverview:\tBruce Lee died during the making of Game of Death. He completed all of the fight scenes, which include some of the best of his film career, but elsewhere in the film his place is taken by a dubious character in big sunglasses. Ignore this, though - it&amp;#039;s a good kung fu movie; a fitting tribute to the master of the genre\n\nIn a curiously circular way, Lee plays a martial arts film star - scenes from Lee&amp;#039;s other films are included as part of this. A syndicate agency wants him to become their latest client, and they won&amp;#039;t take no for an answer. &quot;Accidents&quot; tend to happen to other stars who have refused, and when Lee refuses, an attempt on his life is made. His friend persuades the doctors to fake his death, so that he can recover in peace and get his revenge on the organisation that tried to have him killed. This leads to a series of classic fights, against several martial arts stars.\n\nThese fights, and a ring fight between two others (including Sammo Hung) are the making of the film, as one would expect, and often the agility and power is simply breathtaking. The end sequence, where Bruce moves from room to room, taking on a henchman in each, is fantastic.\n\nGame of Death could be described Bruce Lee&amp;#039;s swansong - it&amp;#039;s certainly a great tribute to Little Dragon. \n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:f18f448ef24da5a0aeb9b25e78dc12bb4650c6fd","amp;dn":"%5BKung+Fu%5D+Game+Of+Death+I+%28Bruce+Lee%2C+1978%29+EN+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f18f448ef24da5a0aeb9b25e78dc12bb4650c6fd","infoHashBuffer":{"type":"Buffer","data":[241,143,68,142,242,77,165,160,174,185,178,94,120,220,18,187,70,80,198,253]},"announce":[],"urlList":[]}}