{"title":"Sunshine SUBBED R5 LINE KVCD(A Karmadrome Release)","uid":3708307,"size":841898815,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f439fc79203c5a3dbd9540ad03268767f4d3ad9b&amp;dn=Sunshine+SUBBED+R5+LINE+KVCD%28A+Karmadrome+Release%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dangerdee","files":5,"time":1181299632,"description":"Tagline:\nDark days are coming.\n\nPlot Outline:\nFifty years into the future (2057), the Sun is failing, causing the Earth to enter an ice age. A spacecraft, the Icarus II, with a crew of eight men and women is launched as a last hope,[3] carrying a massive stellar bomb with a thermonuclear payload equivalent to the mass of Manhattan in order to re-ignite the Sun. Seven years prior, a similar ship, the Icarus I, had been launched for the same mission, but contact was lost.[4] When the crew of eight move toward the sun and out of radio contact with Earth, they discover the distress beacon of Icarus I. Capa (Cillian Murphy), the physicist who controls the bomb, is asked by Captain Kaneda (Hiroyuki Sanada) to decide whether to change course and approach Icarus I. Reasoning that the success of their mission is theoretical anyway, Capa decides that it is best to rendezvous with the stricken vessel in order to potentially acquire another payload, in case the payload they are already carrying does not fulfil its purpose.\n\nWhen calculating their new course, Trey (Benedict Wong) neglects to correct the heat shield&amp;#039;s angle, so it is damaged on the sunward side. During the repair attempt, Kaneda dies, and their oxygen garden is destroyed by a fire (and with it most of their air reserves). Trey&amp;#039;s guilt makes him suicidal and he is placed under sedation by psychiatrist Searle (Cliff Curtis). Following the new course Icarus II approaches and docks with Icarus I. They find the Icarus I crew had abandoned their mission ? deferring to &quot;God&amp;#039;s will&quot; under the leadership of Captain Pinbacker (Mark Strong) and destroyed their computer, rendering their bomb useless, before killing themselves in a suicide pact. The airlock between the two ships is destroyed before the party can return to Icarus II. Capa is given priority for the sole spacesuit, but Searle sacrifices himself and stays behind to release the hatch. Second-in-command Harvey (Troy Garity) is lost in space, freezing to death whilst attempting to cross back to Icarus II with Capa, while engineer Mace (Chris Evans) survives the crossing. The surviving crew members are confronted with a dilemma as the oxygen reserves will not suffice for a completion of the main objective of their mission. The remaining crew vote to decide that Trey has to be killed in the interest of oxygen conservation, as one man&amp;#039;s life cannot outweigh the survival of humanity, only to discover that Trey came out from under sedation and cut his wrists while the crew was exploring Icarus I.\n\nFollowing a disturbing warning from the computer, informing him of an unknown fifth surviving crew member, Capa finds that the Icarus I &amp;#039;s captain, Pinbacker, has somehow made his way onboard. Pinbacker is as zealously insane as he was earlier observed on Icarus I &amp;#039;s final and desperate video-log entry, and is determined to stop the Icarus II as he did his own ship. Pinbacker locks Capa into an airlock after slicing him across the chest. He sabotages the computers, kills the crew&amp;#039;s botanist Corazon (Michelle Yeoh) as she tends to her ruined oxygen garden, and he chases pilot Cassie (Rose Byrne) into the payload section of the ship. Mace manages to repair the computers sufficiently to get power back, but he dies in the coolant tanks when his leg gets trapped between the tanks and coolant machine. The bomb must now be released and fired manually. Capa breaks free of the airlock, launches the bomb, and boards it before its boosters fire. He finds Cassie aboard and both of them fight Pinbacker. Eventually, Capa successfully detonates the bomb. He stands between the expanding effects of the weapon and the encroaching solar surface as it descends. Faced with the surface of the sun itself, Capa takes his final moments enjoying the sheer spectacle in front of him as the flames overtake him.\nMain cast of the film.\nMain cast of the film.\n\nIn a snow-strewn landscape on Earth, eight minutes after the Icarus climax, Capa&amp;#039;s sister and family watch the video that was recorded near the beginning of the film of Capa giving his final message to his family as they watch for a sign that the mission has succeeded. The dim sun finally brightens as the camera pans, showing the Sydney Opera House in the distance.\n\nCast\n\n\tPaloma Baeza\t ... \tCapa&amp;#039;s Sister\n\n\tRose Byrne\t... \tCassie\n\tChipo Chung\t... \tIcarus\n\n\tCliff Curtis\t... \tSearle\n\n\tChris Evans\t... \tMace\n\n\tTroy Garity\t... \tHarvey\n\tArchie Macdonald\t... \tCapa&amp;#039;s Nephew\n\tSylvia Macdonald\t... \tCapa&amp;#039;s Niece\n\n\tCillian Murphy\t... \tCapa\n\tHiroyuki Sanada\t... \tKaneda\n\n\tMark Strong\t... \tPinbacker\n\tBenedict Wong\t... \tTrey\n\n\tMichelle Yeoh\t... \tCorazon\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0448134&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0448134&lt;/a&gt;\n\nFormat:Bin/Cue\nSample:N/A\nSource:mVs\nChapters Every:10minutes\nRuntime:79:32.48\nSize:802MB\nVideo:MPEG1/PAL/352x288/25fps\nAudio:2/44.1kHz/160kbps/Stereo","torrent":{"xt":"urn:btih:f439fc79203c5a3dbd9540ad03268767f4d3ad9b","amp;dn":"Sunshine+SUBBED+R5+LINE+KVCD%28A+Karmadrome+Release%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f439fc79203c5a3dbd9540ad03268767f4d3ad9b","infoHashBuffer":{"type":"Buffer","data":[244,57,252,121,32,60,90,61,189,149,64,173,3,38,135,103,244,211,173,155]},"announce":[],"urlList":[]}}