{"title":"die hard 4.0","uid":3796528,"size":3891290112,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f45d36e079fb09bfb31ce9362131b8aaffe8bad7&amp;dn=die+hard+4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"www.clueless.com","files":5,"time":1189022166,"description":"NYPD Detective John McClane lives in Brooklyn, and he\\\\\\&amp;#039;s now divorced from Holly Gennero, who lives in San Francisco. John has faced some brutal terrorists in his career, but now, he\\\\\\&amp;#039;s about to face what may be his most dangerous enemy yet. John, who occasionally does jobs for the United States Department of Homeland Security, receives a call to bring in a hacker named Matt Farrell, because there has been a breach in an FBI computer system. Farrell is one of the many hackers who are suspected in the attack, and all known hackers are to be questioned. But after John gets to Matt\\\\\\&amp;#039;s apartment, a group of men show up and try to kill John and Matt, who barely escape with their lives. As it turns out, a group of terrorists led by Thomas Gabriel are systematically shutting down the United States computer infrastructure. They crash the stock market, crippling America\\\\\\&amp;#039;s economy. It turns out that Matt knows enough about hacking to know exactly how Gabriel is shutting down the USA. Gabriel, a disgraced former Department of Defense employee, plans to bring the country to its knees, but he doesn\\\\\\&amp;#039;t count on John and Matt figuring out what\\\\\\&amp;#039;s going on. Gabriel wants John and Matt out of the way, and for John, the situation becomes personal when an enraged Gabriel kidnaps John\\\\\\&amp;#039;s daughter Lucy, who is a student at Rutgers University in New Jersey. Gabriel may think he now has the upper hand on John, but he has no idea how far John is willing to go to rescue Lucy","torrent":{"xt":"urn:btih:f45d36e079fb09bfb31ce9362131b8aaffe8bad7","amp;dn":"die+hard+4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f45d36e079fb09bfb31ce9362131b8aaffe8bad7","infoHashBuffer":{"type":"Buffer","data":[244,93,54,224,121,251,9,191,179,28,233,54,33,49,184,170,255,232,186,215]},"announce":[],"urlList":[]}}