{"title":"ImTOO.AVI.to.DVD.Converter.v2.0.10.0620.Incl.Keygen","uid":3593910,"size":4997258,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f4a31ea822c4405da32e67581bb9a9dada549ab0&amp;dn=ImTOO.AVI.to.DVD.Converter.v2.0.10.0620.Incl.Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Orevin","files":1,"time":1168477614,"description":"ImTOO DVD Creator, excellent burning AVI to DVD movie creator to burn WMV to DVD, burn DVD movie, can convert all video files to DVD from AVI, MPEG, DivX, WMV to DVD, burn DVD movie. The DVD burner(DVD Creator) allows you to specify NTSC or PAL format, adjust 4:3 or 16:9 video aspect, burn either DVD disc or ISO file from video files. So easy to use and faster than ever before, that just one click to convert AVI, MPEG, DivX, WMV to DVD, burn DVD movie!\n\n* ImTOO DVD Creator is almost a one-click DVD movie creator, DVD maker, DVD converter, DVD burner. It can convert video files to DVD(.vob), burn DVD movie, that is playable on the home DVD player, such as AVI to DVD, MPEG to DVD, DivX to DVD, WMV to DVD.\n\n* ImTOO DVD Creator is burning AVI to DVD software to convert AVI files directly to playable DVD disc. It is DVD maker, DVD movie creator as well to burn WMV to DVD, burn MPEG to DVD.\n\n* The DVD movie creator, a DVD menu creator also, provides many brilliant DVD menus for your DVD authoring, supports DVD-R, DVD+R, DVD-RW, DVD+RW. It allows you to specify NTSC or PAL format, adjust 4:3 or 16:9 video aspect, and burn either DVD disc or ISO file.\n\n* So versatile DVD burning software! Free Download ImTOO DVD Creator to burn DVD movie right now!\n\n\nworking, includes Keygen.\n\nPlease seed!","torrent":{"xt":"urn:btih:f4a31ea822c4405da32e67581bb9a9dada549ab0","amp;dn":"ImTOO.AVI.to.DVD.Converter.v2.0.10.0620.Incl.Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4a31ea822c4405da32e67581bb9a9dada549ab0","infoHashBuffer":{"type":"Buffer","data":[244,163,30,168,34,196,64,93,163,46,103,88,27,185,169,218,218,84,154,176]},"announce":[],"urlList":[]}}