{"title":"Morrowind Ultimate Audio/Video Upgrade","uid":3605138,"size":596945802,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f683610b70b454b6a829a225d2ab6ae3ab2da311&amp;dn=Morrowind+Ultimate+Audio%2FVideo+Upgrade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheMadToker","files":67,"time":1169965202,"description":"A large collection of mods that enhance the visuals and audio in Morrowind. The mods cover everything from world texture replacers to minor textiure replacers like bottles and other misc items. Also included are Atmospheric Sound Effects and Wilderness sounds, two mods that greatly enhance the ambient sounds. Also included are all rotation and placement mods, allowing you home decoraters to stock that perfect bookshelf or create the perfect armory. None of these mods effect gameplay in anyway. There are far too many things to list here. I missed quite a few good mods when I made that last torrent... hey, I was high :-P\n\nSo here ya go. My end result after searching high and low for the very best out there.\n\nKeep in mind that I did not create any of these wonderful mods, I&amp;#039;m not that talented :) But all the RARs have been kept intact as downloaded from the authors&amp;#039; sites, so all readmes and other info is also included.\n\nNote: It is recommened you install a few in a certain order, mainly the world replacers. Vibrant Morrowind, Visual Pack 2.11, Visual pack 2.2 (nature) and Visual Pack XT should be installed in that order for best results.\n\nIt is also recommended that these mods are used on a system well above the game&amp;#039;s normal requirements, as many of the textures are very graphic intensive.\t","torrent":{"xt":"urn:btih:f683610b70b454b6a829a225d2ab6ae3ab2da311","amp;dn":"Morrowind+Ultimate+Audio%2FVideo+Upgrade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f683610b70b454b6a829a225d2ab6ae3ab2da311","infoHashBuffer":{"type":"Buffer","data":[246,131,97,11,112,180,84,182,168,41,162,37,210,171,106,227,171,45,163,17]},"announce":[],"urlList":[]}}