{"title":"Red Hot Chili Peppers - Stadium Arcadium B-Sides","uid":3701309,"size":91044091,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6d08daf6098ff333a7a213e98767626d27b4466&amp;dn=Red+Hot+Chili+Peppers+-+Stadium+Arcadium+B-Sides&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Expedience","files":14,"time":1180574614,"description":"The Red Hot Chili Peppers&amp;#039; Stadium Arcadium was an eagerly-anticipated and well-liked  album, which has sold extremely well (gold in its second week, platinum in its second month, double-platinum in its second year) both in the U.S. and internationally -- a surprising feat, since it was leaked to online file sharing communities a full week before it was released commercially.\n\nThe success of Stadium Arcadium in spite of its early leak is proof that Internet-based file sharing is *not*, in fact, particularly harmful to album sales, unless those albums are of too-poor quality to stand on their own. (RHCP&amp;#039;s best selling album to date, Californication, was released during the heyday of Napster, before it was shut down in 2001.) Those who download  music and like it will frequently show the songs to their friends and buy the CDs themselves, offering the RIAA free marketing. The people who don&amp;#039;t buy the album after downloading it are precisely those who were relatively unimpressed.\n\nUnfortunately, the bonus tracks of the singles for this album have only had limited release over public file sharing networks. This is a shame, because some of these B-sides recommend their singles extremely well, though some of them are live performances that aren&amp;#039;t really worth the money on their own.\n\nThis torrent is a compilation of the B-sides of all the major Stadium Arcadium releases -- either EPs or CD Maxi-singles (since the EPs tend to have content that the CDMs don&amp;#039;t). It aims to provide the free marketing that the RIAA is so afraid of, since most people who see this torrent were probably not considering buying some of these excellent singles -- or didn&amp;#039;t know which ones were worth buying.\n\nIf you like one of the EPs or CDMs, I encourage you to buy the corresponding CD from your local or online retailers. Show the RIAA that they are wrong.","torrent":{"xt":"urn:btih:f6d08daf6098ff333a7a213e98767626d27b4466","amp;dn":"Red+Hot+Chili+Peppers+-+Stadium+Arcadium+B-Sides","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d08daf6098ff333a7a213e98767626d27b4466","infoHashBuffer":{"type":"Buffer","data":[246,208,141,175,96,152,255,51,58,122,33,62,152,118,118,38,210,123,68,102]},"announce":[],"urlList":[]}}