{"title":"Through a Blue Lens (1999)","uid":3825552,"size":726869387,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f6e3b4c618010263333794566a7742f9deb06793&amp;dn=Through+a+Blue+Lens+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ghsodt","files":2,"time":1191208346,"description":"     ____  ____  _____  ____  __    ____    _  _  _____  ____ \n    (  _ ( ___)(  _  )(  _ (  )  ( ___)  ( ( )(  _  )(_  _)\n     )___/ )__)  )(_)(  )___/ )(__  )__)    )  (  )(_)(   )(  \n    (__)  (____)(_____)(__)  (____)(____)  (_)_)(_____) (__) \n                   ___    __    ____  ___    ___ \n                  / __)  /__  (  _ / __)  | __)\n                 ( (__  /(__)  )   /__   |__ \n                  ___)(__)(__)(_)_)(___/  (___/\n\n                   M                    \n                 MMMM                   \n                 MMMM                   \n                 M MM                   \n                 MMM                    \n             MMMMMMMMM                  \n             MMMMNMMMMM                 \n            MMMMMMMMMMMM                \n           MMMMMMMMMMMMM                \n          MMM MMMMMMMMMM                \n           MMMMMMMMMMMMMM               \n             MMMNMMMMMMMM               \n             MMMMMMMMM  M               \n             M MMNMMMMMMMM              \n            MMMMMMMMMMM                 \n     M     MMMMMMMMMMMM   M             \n    M    MMM MMMMMMMMMM  MM             \n     M  MMM MMMMMMMMMMMM  MMM  MMM      \n   M M MMM M  MMM   MMM  M M MM    MM   \n M  M MMM M   MMM  MMMMMM  MM MMM M MM  \n MMMM  MNM MM M MNM  MM M N MMM      M  \n  M     M MMM MMMMM  MMM   M MMM     M  \n   M M N   MM  MNM    M MN    M    M    \n   M M MMM M  MMMMM   MMMMM         M   \n                          M       MMM   \n                            MMMMM M     \n\nThrough a Blue Lens (1999) VHS&gt;DVD&gt;Xvid Rip\nVeronica Alice Mannix\nInternational Documentary Association\n2000 Nominated IDA Award for Feature Documentaries\nruntime: 00:52:21\nVancouver, Canada\nEnglish : Color : No subtitles\nVancouver, British Columbia, Canada\nNational Film Board of Canada (NFB)\n\nCast\n (Credited cast)\n\tAl Arsenault\t\t... \tHimself, police officer\n\tToby Hinton\t\t... \tHimself, police officer\n\tDave Kolb\t\t... \tHimself, police officer\n\tWalt McKay\t\t... \tHimself, police officer\n\tMark Steinkampf\t\t... \tHimself, police officer\n\tDale Weidman\t\t... \tHimself, police officer\n\tAlfred Hollingsworth\t... \tHimself, police officer\nrest of cast listed alphabetically:\n\tCarlee\t\t\t... \tHerself, drug addict\n\tDarlene\t\t\t... \tHerself, drug addict\n\tRandy Miller\t\t... \tHimself, drug addict\n\tNicola\t\t\t... \tHerself, drug addict\n\nIMDB http://www.imdb.com/title/tt0226525/\n\n--------\nVideo Information:\ndimension: 480x360 29fps\ncodec: iso mpeg-4 ffmpeg\nlavc  1704\nAudio:\n32kbps mp3lame\nMpeg layer 2/3\n48kHz\n--------\nreviews:\n--------\nThrough the Blue Lens is the story of a working relationship between two unlikely groups of people; police officers and drug users. While the Mannix team was filming their prior documentary, Down Here, they met two officers who had something to say about the gentrification of the Downtown Eastside. At the time, the officers had been using still cameras to document many of the circumstances people suffered. They took these images to local schools in an attempt to educate youth. Seeing the potential the video camera could offer, the officers asked the Mannix team to help them create an educational video. The Mannix team started by teaching camera handling and talked about camera ethics and power relationships. Following videotaping the officers would leave the video tapes with Veronica Mannix for screening and comments. It was during this time that Veronica saw her story - the relationship of two unlikely groups of people coming together to try and make a difference. She pitched the story and the National Film Board supported her vision. Veronica used 20 minutes of the officers 100 hours of videotape, the remainder of the footage was shot by Daniel Mannix. Through a Blue Lens started out with seven police officers and nineteen drug users, the final participants in the film included four officers and six drug users. Though a Blue Lens is 52 minutes. Following the completion of this project Veronica moved on to complete The Whistleblowers - the story of speaking out about wrong doing in the work place.\n\n--------\nThis documentary, set in the Lower East End of Vancouver&amp;#039;s downtown core, is a pretty honest account of life on the streets in urban Canada. It is aimed at educating high school kids on the dangers of addiction to hard drugs and is the brainchild of a group of city police officers who videotape their interactions with local homeless personalities. It started as a tape to keep kids safe, and ended as a compassionate look at lives and faces that belong to families all too similar to your own. Through a Blue Lens is graphic and open, as well as deeply affecting for a lot of viewers. This excellent film was just meant to teach students about what awaits them if they don&amp;#039;t seek help and make good choices now; when all is said and done it should be seen by a most adults, too. Definitely more than intelligent, honest, brutal, and involving enough for any discriminating audience.\n\nObviously biased to some extent, but a stunning example of truths of life. Pretty touching stuff, well-documented and explored. Definitely worth the watch.\n\nAs an aside, the subjects of the film Nicola and Randy have since cleaned up; Randy has a wife and is now a bodybuilder with a successful speaking career. The other two main concerns, Carlee and April, were not so lucky. Carlee overdosed six months after shooting wrapped up, and April was found strangled in an alley in an example of the dangers of addiction and prostitution. Both will be missed by those who knew them.\n\n---\nPNC release #5\nour city is addicted to cars\nkill the habit before it kills you\nshare and share alike!","torrent":{"xt":"urn:btih:f6e3b4c618010263333794566a7742f9deb06793","amp;dn":"Through+a+Blue+Lens+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6e3b4c618010263333794566a7742f9deb06793","infoHashBuffer":{"type":"Buffer","data":[246,227,180,198,24,1,2,99,51,55,148,86,106,119,66,249,222,176,103,147]},"announce":[],"urlList":[]}}