{"title":"Berlin Mitte Institut - The biggest Netlabel tunes Techno Minima","uid":3568621,"size":95725696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f71c8c967117c13f1675201fd50822c1d555430d&amp;dn=Berlin+Mitte+Institut+-+The+biggest+Netlabel+tunes+Techno+Minima&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fresh_Meat","files":1,"time":1164988485,"description":"The biggest Netlabel tunes on a mix \n\nFor quite a while now we&amp;#039;ve been trying to watch the Netlabel releases and we find it difficult to be satisfied.\n\nFirstly, it seems that there&amp;#039;s so much being released right this moment and has been already - such an amount of releases makes it hard to keep an overview. There are directories already like the Netlabel Catalogue, which lists many releases. However, it doesn&amp;#039;t really give us an idea of where a &quot;good&quot; Netlabel release can be found, and in which context we could make use of it. \n\nSecondly, after having listened to many releases of the past years, it seems hardt to find high quality productions with appealing elements of a specific kind, such as: club suitability, crunchy well produced beats, etc.\n\nThirdly, we feel like we have listened to many already worn-out elements of successful commercial music that have found their way back to Netlabels and don&amp;#039;t really represent any innovative spirit.\n\nWe want to find the real gems and share them with you. For that reason we have compiled what we consider as great Netlabel tunes for you into a mix. Please see the tracklist below, visit the Netlabel websites and download the tracks if you like them. Get the tracklist + downloads on http://www.berlin-mitte-institut.de/sound.htm\n\nWe`re going to post around this mix on different forums around the globe to encourage people to post their favourite free Netlabel tunes including direct links to downloads. Please visit http://www.berlin-mitte-institut.de/sound.htm from the 3rd December of 2006 onwards to get to know which forums are included and participate in boosting the Netlabels!\n","torrent":{"xt":"urn:btih:f71c8c967117c13f1675201fd50822c1d555430d","amp;dn":"Berlin+Mitte+Institut+-+The+biggest+Netlabel+tunes+Techno+Minima","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71c8c967117c13f1675201fd50822c1d555430d","infoHashBuffer":{"type":"Buffer","data":[247,28,140,150,113,23,193,63,22,117,32,31,213,8,34,193,213,85,67,13]},"announce":[],"urlList":[]}}