{"title":"wysiwyg.web.builder.v4.07.rar","uid":3710512,"size":3457211,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f71dc09bfa3bce379e0f1a6af37cd7639582a82d&amp;dn=wysiwyg.web.builder.v4.07.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boorstar","files":1,"time":1181510282,"description":"WYSIWYG Web Builder features:\n? No HTML knowledge needed!\n? Drag and drop objects from the toolbox on the page: Text, Lines, Images, Marquees and Tables.\n? Site Management. Easily add, edit, clone and structure your web pages from a single file.\n? Customizable menus, toolbars, keyboard accelerators, dockable windows, tabs, autohide windows.\n? Form layout object to create forms, including actions, hidden fields etc.\n? Supports Form fields: Editbox, TextArea, Checkbox, Radiobutton, Combobox and Button.\n? Rich text support: text object can contain different fonts, colors, links and sizes.\n? Option to add custom HTML for each object (Before Tag, Inside Tag, After Tag).\n? Custom HTML object to insert your own HTML or Javascripts.\n? ActiveX, JAVA, Flash, Windows Media player, Quicktime, Real Audio and other Plug-In support.\n? Publish your entire web site, a single page or a group of pages (to local drive or a web server) .\n? Build-in Photo Gallery maker, with lots of cool features like picture frames!\n? Build-in Banner maker.\n? Rollover images.\n? Bulleted Lists: Circle, Disc, Square, Numeric (1, 2, 3), Alpha (a, b, c) , Roman (I, II, III) and custom images.\n? Image maps.\n? Customize scrollbar colors for Microsoft Internet Explorer.\n? Navigation bars.\n? Ready-to-use Javascripts.\n? Template support. Already more than 100 templates available!\n? Support for Cascading Style Sheet positioning (layered layout).\n? Insert Symbols (special characters).\n? Verify links tool.\n? Rotating Image component (useful for Ad Banners).\n? Support for third-party add-ons, using the Web Builder Component Developers Kit.\n? Import existing HTML pages.\n? Hyperlink Style Sheet, to customize the colors/formatting of hyperlinks.\n? Show optional rulers.\n? Page transitions in Page Properties.\n? Inline Frame component (IFRAME).\n? Go menu: easily create a drop-down navigation menus.\n? Menubar: powerful menu script that can mimic complex menus found in popular GUI applications.\n? Shape object (Rectangle, Round rect, Ellipse, Diamond, Hexagon, Octagon, Parallelogram, Triangle,\n    Trapezoid, Arrows, Flag, Flower, Heart, Signs, Stars, Talk Bubbles and much more!).\n? Embedded OLE component.\n? Embedded page object. This allows you to re-use objects from other pages (master page concept).\n\nNew features in version 4.2:\n? Layer Object for advanced layout possibilities.\n? Support for folders in the Site manager!\n? Find/Replace for text objects.\n? Validation tools for form components: EditBox, Combobox and TextArea.\n? Rotation for shapes and images.\n? Merge and split in tables and multi cell selection.\n? Menubar now supports background images, transparancy and sliding/fading effects.\n? Table cell background image repeat properties, which allows you to put images inside cells without tiling.\n? Quick Properties window for quick object manupulation.\n? Ability to group/ungroup objects.\n? Image tools: Contrast, Brightness, Flip, Rotate and Resample.\n? Image effects: GrayScale, Negative, Sepia, Blur, Soften, Sharpen, Noise, Emboss and more!\n? Drawing tools: Line, Line + Arrows, Scribble, Polygon, Curve and Closed Curve.\n? Photo gallery border styles/ photo frames.\n? Images, shapes and form controls have a new Events Page, to easily add actions to object events!\n? You can now add multiple preview browsers and call them using the preview dropdown menu.\n? The PayPal eCommerce Tools are the quickest and easiest way to add eCommerce to your web site!\n? and much more!!","torrent":{"xt":"urn:btih:f71dc09bfa3bce379e0f1a6af37cd7639582a82d","amp;dn":"wysiwyg.web.builder.v4.07.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71dc09bfa3bce379e0f1a6af37cd7639582a82d","infoHashBuffer":{"type":"Buffer","data":[247,29,192,155,250,59,206,55,158,15,26,106,243,124,215,99,149,130,168,45]},"announce":[],"urlList":[]}}