{"title":"Bill Hicks Live: Satirist, Social Critic, Stand Up Comedian","uid":3606084,"size":8294244388,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fa038df277183f5c96433d0df492f8cd0984fdc2&amp;dn=Bill+Hicks+Live%3A+Satirist%2C+Social+Critic%2C+Stand+Up+Comedian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"billhicksfan","files":19,"time":1170097860,"description":"Bill Hicks Live is the first official DVD release from the legendary and beloved comedian.\n\nSince Bill died in 1994, his work has reached a new audience and he has become a powerful cult figure. For these fans who never had the opportunity to see Bill in person, this DVD will be a revelation. The DVD captures Bill at his very best, with three of his legendary filmed performances:\n\nOne Night Stand from the Old Vic Theatre in Chicago (approx  30 minutes)\n\nRevelations from the Dominion Theatre in London (approx  65 minutes)\n\nRelentless, Bill?s breakout performance at the Montreal Comedy Festival  (approx  70 minutes)\n\nThe DVD focuses on his incredible live act, with Hicks hilariously assaulting the stage and the audience with a non-stop cornucopia of insights into our twisted world; the government, the military, the police, religion, smoking, pornography, drugs and of course, for those of you who are getting antsy, a couple of dick jokes.\n\nAs a bonus, the documentary \\&quot;Just A Ride\\&quot; surveys Bill?s remarkable career with insights from his peers; including Brett Butler, Eddie Izzard, Richard Jeni, Jay Leno, David Letterman and Thea Vidale. (approx  45 minutes)\n\nTotal running time: approx 3.5 hours of pure, unadulterated Hicks.\n\nSTREET DATE: 10/26/2004\n\n===================\nAspect ratio 4:3\nSound Dolby Digital\n===================","torrent":{"xt":"urn:btih:fa038df277183f5c96433d0df492f8cd0984fdc2","amp;dn":"Bill+Hicks+Live%3A+Satirist%2C+Social+Critic%2C+Stand+Up+Comedian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa038df277183f5c96433d0df492f8cd0984fdc2","infoHashBuffer":{"type":"Buffer","data":[250,3,141,242,119,24,63,92,150,67,61,13,244,146,248,205,9,132,253,194]},"announce":[],"urlList":[]}}