{"title":"Bill Bryson- The Life &amp; Times of the Thunderbolt Kid.rar","uid":3795587,"size":413360291,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fc8d42cb80f5d9dea30e9f6eeeddcbd0bde0d97e&amp;dn=Bill+Bryson-+The+Life+%26+Times+of+the+Thunderbolt+Kid.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"microwavspam","files":1,"time":1188937094,"description":"Synopsis\n\nSome say that the first hint that Bill Bryson was not of Planet Earth came when his mother sent him to school in lime-green Capri pants. Others think it all started with his discovery, at the age of six, of a woollen jersey of rare fineness. Across the moth-holed chest was a golden thunderbolt. It may have looked like an old college football sweater, but young Bryson knew better. It was obviously the Sacred Jersey of Zap, and proved that he had been placed with this innocuous family in the middle of America to fly, become invisible, shoot guns out of people?s hands from a distance, and wear his underpants over his jeans in the manner of Superman.\n\nBill Bryson?s first travel book opened with the immortal line, ?I come from Des Moines. Somebody had to.? In his deeply funny new memoir, he travels back in time to explore the ordinary kid he once was, and the curious world of 1950s America. It was a happy time, when almost everything was good for you, including DDT, cigarettes and nuclear fallout. This is a book about growing up in a specific time and place. But in Bryson?s hands, it becomes everyone?s story, one that will speak volumes ? especially to anyone who has ever been young.\n\n\n\nIn Short: humorous personal memoirs of Bill Bryson growing up in Des Moines.\n\nEnjoy!","torrent":{"xt":"urn:btih:fc8d42cb80f5d9dea30e9f6eeeddcbd0bde0d97e","amp;dn":"Bill+Bryson-+The+Life+%26+Times+of+the+Thunderbolt+Kid.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8d42cb80f5d9dea30e9f6eeeddcbd0bde0d97e","infoHashBuffer":{"type":"Buffer","data":[252,141,66,203,128,245,217,222,163,14,159,110,238,221,203,208,189,224,217,126]},"announce":[],"urlList":[]}}