{"title":"LAMEWIN32 (PfP) - LAME V3.97, RazorLAME 1.1.5a, CD Wave 1.96.1 (","uid":3863279,"size":2099443,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fceb61adde0d307c03e539c9e113e01cff1440b5&amp;dn=LAMEWIN32+%28PfP%29+-+LAME+V3.97%2C+RazorLAME+1.1.5a%2C+CD+Wave+1.96.1+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"preservedforposterity","files":9,"time":1193627485,"description":"Applications : Windows : English\nLAMEWIN32 (PfP) - LAME V3.97, RazorLAME 1.1.5a, CD Wave 1.96.1 (October 28, 2007)\n\nLame 3.97, RazorLame 1.1.5a, CD Wave 1.96.1\nA Preserved for Posterity Release\nOctober 28, 2007\n\nIt used to be that you could download a file called LAMEWIN32.EXE\nfrom the Gold Wave website. This was an installer distribution of\nRazorLAME and LAME (pre-compiled binaries of both, combined in a\nneat little installation package by mp3-tech.org). This is,\nhowever, no longer the case. Apparently, the IP holders for the MP3\nformat like to bitch about binary distributions of any software that\nsupports their format. MP3-TECH.ORG doesn&amp;#039;t need the hassle,\nso they don&amp;#039;t provide the installer with the pre-compiled binaries anymore\nand the versions that I was able to find, are out-dated, so I decided\nto create a binary installation, based on the currently available\nbuilds of LAME and RazorLAME (I&amp;#039;ve even used the icon from the last\navailable mp3-tech.org distribution). Also included is the installer\nfor CD Wave 1.96.1 (It is integrated into this installer and will\nlaunch as part of this install process, however, you may choose not\nto install CD Wave, although I find it quite useful.) This is the\nshareware version of CD Wave, but it is FULLY FUNCTIONAL WITH NO\nUSEAGE RESTRICTIONS - If you find it useful, I would recommend that\nyou register it and support Mike, but that&amp;#039;s between you and whatever God\n(if any) that you believe in (I borrowed that line from Q [a.k.a.\nQue a.k.a. Queue], from the final episode of Star Trek : The Next Generation).\nMike seems to think that you&amp;#039;ll go to Hell if you\ncontinue to use CD Wave without registration (yes, I know he&amp;#039;s joking).\nIn any event, enjoy this fine release from PfP and look for more\nGREAT releases soon.\n\n***\n\nAll of the information that follows is from the various ReadME type\nfiles provided with LAME, RazorLAME and CD Wave, you might want to\nwaste a little time reading it -- or not. It&amp;#039;s up to you.\n\n***\n\nReadme file for RazorLame 1.1.5a\n================================\n\nWhat is RazorLame?\n------------------\nRazorLame is a so-called front-end for use with LAME.\n\nLAME is a great MP3-Encoder: it&amp;#039;s very fast, it produces\nhigh-quality files, has many advanced features (like\nVariable Bitrates and Joint-Stereo), and it&amp;#039;s open source.\n\nUnfortunately, it is a command line utility, and that is\nwhere RazorLame comes in: it provides an easy-to-use\ngraphical user-interface which makes MP3-encoding even\neasier!\n\nYou can find more about LAME at http://www.mp3dev.org/\n\n==========================================================\nHolger Dors, 12.02.2006\nE-Mail: Razor [dot] Blade [at] gmx [dot] net\nWeb: http://www.dors.de/razorlame/\n==========================================================\n\n\nRelease History\n---------------\n\nLegend:\n(+) Added feature\n(*) Improved/changed feature\n(-) Bug fixed (hopefully)\n\nVersion 1.1.5a (12. February 2006)\n(-) fixes problems with newer LAME versions through\na RazorLame.dat update\n(*) Removed outdated r3mix presets\n\nVersion 1.1.5 (12. December 2001)\n(+) some GUI features: font selection, XP-like\nmenus and toolbars, support for XP Themes\n(*) enhanced &amp; nicer histogram display\n(*) progress dialog remembers if histogram was shown\n(+) double click on listview entries starts\nassociated program\n(*) Application Title now shows batch progress\n(*) Status Bar shows current LAME setting\n(*) added more option files which are similar\nto the presets of LAME 3.90\n(-) yet another try to fix the &quot;average value missing&quot; bug\n(-) should fix problems with large fonts\n(-) fixed decimal-point problem for rlo files\n(-) some smaller changes and bug fixes\n\nVersion 1.1.4 (12. April 2001)\n(+) Added some option files. Thanks to Gabriel Bouvigne\nof http://www.mp3-tech.org for providing them!\n(-) Now handles the &quot;use source&quot; checkbox for the\noutput directory correctly\n(-) histogram is now displayed correctly for all\nVBR/ABR modes\n(-) Summary line for ABR/VBR (&quot;average bitrate&quot;) is finally\nadded to log for all cases. (I hope...)\n(*) Files &gt; 2 GB are correctly displayed now, however,\nprogress isn&amp;#039;t displayed on large file for now\n(-) some smaller fixes\n\nVersion 1.1.3\nwas an internal-only release and is now the base\nfor 1.2.0, which is currently developed. Current source\nof 1.2.0 can be obtained through CVS at &lt;a href=&quot;\nhttp://www.sourceforge.net/projects/razorlame&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sourceforge.net/projects/razorlame&lt;/a&gt;\n\nVersion 1.1.2a (26. March 2001)\n(-) Added some messages to RazorLame.dat, as there was trouble\nwith some popular compiled versions of lame 3.88 beta\n\nVersion 1.1.2 (21. January 2001)\n(+) If LAME outputs a histogram during encoding, RL can now display\nthis histogram graphically as well.\n(+) You can now set the default priority of the encoding thread.\n(+) You can now choose what RL should do if &quot;shutdown Windows when\ndone&quot; is checked. Options include Hibernate, Suspend, Log Off,\nJust close RL, Reboot, and of course, shutdown.\n(+) You can now save option settings in a file. And of course\nload them again ;-)\n(*) The progress window is now resizable.\n(*) The option dialog is now splitted in a &quot;program&quot; options and a\n&quot;LAME&quot; options dialog.\n(*) The LAME options dialog now always show the resulting LAME\nswitches without the need for pressing a &quot;show&quot; button.\n(*) You can now move columns of the listview.\nHowever, layout of listview isn&amp;#039;t stored yet.\n(*) &quot;View Log&quot; window now has a &quot;delete log&quot; button.\n(*) added support for &quot;--athshort&quot; and &quot;-q&quot; switches.\nAdded a &quot;default&quot; mode for the channel modes.\n(*) hopefully the output directory option is now more intuitive.\n(-) RL now uses less CPU time (i.e. it updates the progress window\nonly once in a second, when in tray it updates it only every\nten seconds.)\n(-) fixed problems with some mp3 files (e.g. &quot;trimmed&quot;)\nwhen decoding or re-encoding\n(-) Probably more smaller fixes I cannot think of right now.\n\n\nVersion 1.1.1 (29. October 2000)\n(*) better handling of LAME 3.87 beta\n(*) Nicer application icon and toolbar images,\nthanks to Jan Hryz &lt;jan [dot] hryz [at] email [dot] cz&gt;\n(*) You can now delete files after decoding as well!\n(*) Improved listview, shows associated icon and type\n(*) Improvements for handling a lot of files\n(*) some smaller, rather cosmetic changes\n(-) &quot;-B&quot; option was ignored for ABR\n\n\nVersion 1.1.0 (20. August 2000)\n(+) You can now decode mp3 files using LAME!\n(Needs at least version 3.84!)\n(+) added support for --abr\n(average bitrate aka Safe VBR)\n(*) Some system stuff is now read from a *.dat file\nThis allows for a bit more flexibility in regard\nof future LAME versions.\n(*) Hints are now visible for 10 seconds so those\nin the options dialog can be better read\n(*) When sorting paths, use filename as second sort\ncriteria\n(*) Same small, rather cosmetic changes\n(-) fixed a bug when entering an output directory\nwithout a trailing backslash lead to unexpected\nresults\n\n\nVersion 1.0.2 (02. July 2000)\n(+) new advanced option: delete file after encoding\n(+) When VBR is used, show bitrate histogram on log\n(if encoder version outputs it!)\n(*) Progress dialog now also shows elapsed time for batch\n(-) when no output directory is given, encoded file\nis stored where input file is\n(-) making it impossible to set the quality in the\nVBR tab of the options higher than 9\n(-) Delete 0 byte output files after an error occurred\n\n\nVersion 1.0.1 (25. June 2000)\nFirst public release.\nSome bug fixes, some improvements.\n\n\nVersion 1.0.0 (06. June 2000)\nFirst semi-public beta release\n\n***\n\nCan I use LAME in my commercial program?\n\nYes, you can, under the restrictions of the LGPL. In particular, you\ncan include a compiled version of the LAME library (for example,\nlame.dll) with a commercial program. Some notable requirements of\nthe LGPL:\n\n1. In your program, you cannot include any source code from LAME, with\nthe exception of files whose only purpose is to describe the library\ninterface (such as lame.h).\n\n2. Any modifications of LAME must be released under the LGPL.\nThe LAME project (www.mp3dev.org) would appreciate being\nnotified of any modifications.\n\n3. You must give prominent notice that your program is:\nA. using LAME (including version number)\nB. LAME is under the LGPL\nC. Provide a copy of the LGPL. (the file COPYING contains the LGPL)\nD. Provide a copy of LAME source, or a pointer where the LAME\nsource can be obtained (such as www.mp3dev.org)\nAn example of prominent notice would be an &quot;About the LAME encoding engine&quot;\nbutton in some pull down menu within the executable of your program.\n\n4. If you determine that distribution of LAME requires a patent license,\nyou must obtain such license.\n\n\n*** IMPORTANT NOTE ***\n\nThe decoding functions provided in LAME use the mpglib decoding engine which\nis under the GPL. They may not be used by any program not released under the\nGPL unless you obtain such permission from the MPG123 project (www.mpg123.de).\n\nLAME has built-in support to read raw pcm and some wav and aiff files. More\nrobust file I/O can be handled by compiling in LIBSNDFILE.\n\n***\n\nLICENSE AGREEMENT FOR CD WAVE\n\n----------------------------------------------------------------\nSummary:\n----------------------------------------------------------------\n\nCD Wave is shareware, you can try it out at no charge for a period of 30 days. After this period you must either register or stop using the program. There is no limitation to the use of CD Wave even in commercial applications like commercial radio stations, other than (local) legal restrictions. It is also allowed to distribute copies of this program, provided that the copy is complete. It is prohibited though to sell CD wave without prior permission from the author.\n\nIncluded in the CD Wave package is the OGG Vorbis encoder DLL (vorbis.dll) and the FLAC encoder DLL (libFLAC.dll). This is software released under LGPL and as such is free for your use. Many thanks to the Free Software Foundation for supplying this great piece of software. These libraries are excluded from this licence, and provided as an extra service. Please see the Free Software Foundation website at www.fsf.org for details, soure code and licensing information.\n\n\n----------------------------------------------------------------\nLicense agreement for CD Wave:\n----------------------------------------------------------------\n\nThis license agreement is a legal agreement between you (either an individual or a company) and the author of this software package,\n\nMiLo Software\nOspel, The Netherlands\n\n\nBy installing or otherwise using this software you agree to be bound by this agreement. If you do not agree to be bound by the terms of this agreement, you may not install or use this software.\n\nAll intellectual and other rights to this software are owned by the author of this software.\n\nYou may give copies of this software package to anyone, copy it to any media, distribute it by any means, and upload it to shareware sites on the Internet, as long as the original package remains unmodified.\n\nThe registration may either be used by a single person who uses the software personally on one or more computers, or installed on a single workstation used nonsimultaneously by multiple people, but not both. This is not a concurrent use license.\n\n\nThis is not free software. Subject to the terms below, you are hereby licensed by the auhor to use this software for evaluation purposes without charge for a period of 30 days. If you use this software after the 30 day evaluation period a registration fee is required. See the MiLo Software web site atfor information about online ordering and quantity discounts.\n\nYou may, without making any payment:\n- give exact copies of the software personally to anyone, except for the purpose of extending their evaluation period;\n- distribute exact copies of the software, if done exclusively through electronic channels;\n- make as many exact copies of the software as you wish, for purposes of distribution as described above.\n\nYOU ARE SPECIFICALLY PROHIBITED FROM CHARGING, OR REQUESTING DONATIONS, FOR ANY COPIES, HOWEVER MADE, AND FROM DISTRIBUTING SUCH COPIES WITH OTHER PRODUCTS OF ANY KIND, COMMERCIAL OR OTHERWISE, WITHOUT PRIOR WRITTEN PERMISSION FROM THE AUTHOR. THE AUTHOR RESERVES THE RIGHT TO REVOKE THE ABOVE DISTRIBUTION RIGHTS AT ANY TIME, FOR ANY OR NO REASON.\n\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SOFTWARE AND DOCUMENTATION ARE PROVIDED &quot;AS IS&quot; AND THE AUTHOR DISCLAIMS ALL WARRANTIES AND CONDITIONS, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, CONFORMANCE WITH DEscriptION, TITLE AND NON-INFRINGEMENT OF THIRD PARTY RIGHTS.\n\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL OR EXEMPLARY DAMAGES OR LOST PROFITS WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION, LOSS OF BUSINESS INFORMATION, OR ANY OTHER PECUNIARY LOSS) ARISING OUT OF THE USE OR INABILITY TO USE THE SOFTWARE PRODUCT, EVEN IF THE AUTHOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nShould any term of these terms and conditions be declared void or unenforceable by any court of competent jurisdiction, such declaration shall have no effect on the remaining terms hereof.\n\n***\n\nAudio recording\nI can hear sound, but nothing is recorded and the LEDs don&amp;#039;t light up\nMost probable cause is the volume setting.\n\nThere should be a &quot;speaker&quot; icon next to your clock on the task bar. (If not, use Start/Programs/Accesoires/Multimedia/Volume). Double click it to pop up the mixer panel. Choose Options, Properties, and select &quot;Recording&quot; for &quot;Adjust volume for&quot;. Then, make sure all the volume controls in the bottom box have been checked. Click OK. The panel now allows you to select recording volumes and sources. Make sure that &quot;Line in&quot; (or Auxiliary) is checked and used as only input. Now it should work.\n\nHow can I adjust (raise/lower) input levels?\nYou&amp;#039;ll have to do this with the mixer program for your soundcard. It is hiding under the speaker icon next to the clock (see the previous question).\n\nHow do I schedule a recording?\nEasiest way is to just use the &quot;Start recording at&quot; value in the Record dialog. This requires the machine to remain powered on until the recording starts. If the machine needs to be turned off in between, you can use the following method.\n\nYou can schedule a recording by using the Task Scheduler of Windows. You can find it under the MyComputer icon (in Windows 98 and 2000). Add a new item, and point it to the CD Wave program (usually &quot;C:Program FilesCD WaveCDWAV.EXE&quot;), which should be listed already. Use the &quot;Advanced&quot; scheduling settings to supply the extra configuration data.\n\nAs commandline parameters, use the following:\n...CDWAV.EXE /R &quot;C:My MusicMyRecording.wav&quot;\nThis will start recording at the given time to the MyRecording.wav file. The settings will be used from your last recording settings, including the format, voice-activated start, stop on silence, and maximum recording interval. You can change some of the parameters using the following switches:\n\n/R Recording mode, records to the given file (which will be overwritten if it exists)\n/S Stop-on-silence, suppy /S to switch on, /S- to switch it off\n/V Voice activation, suppy /V to switch on, /V- to switch it off\n/Q Quit after recording, exits CD Wave immediately after recording stops\n/T Time. Specify hours:minutes (or just minutes) for the recording duration\nExample: This starts recording to &quot;C:My MusicMyRecording.wav&quot;, for one and a half hour, starting immediately and continue recording even if silent, and will quit CD Wave when it is done:\n...CDWAV.EXE /R &quot;C:My MusicMyRecording.wav&quot; /T1:30 /S- /V- /Q\n\nRecording produces occasional skips\nThere can be several causes for this. Let me name a few.\n\nMost likely some problem in the soundcard driver. Make sure you have the latest drivers for your card. If you have a Creative card like the soundblaster 16 or any of the AWE series, use Microsoft&amp;#039;s built-in drivers. They&amp;#039;re better than the ones Creative supplies. If this doesn&amp;#039;t help, go to File, Preferences and set the slider labeled &quot;Recording Mode&quot; to the middle position. This solves the problem for some of the driver compatibility problems.\nYou&amp;#039;re getting buffer overruns. The help file explains what this is, and how you can solve it.\nThe audio is clearly clipped, but the red LED never lights up\nSome soundcards are incapable of delivering &quot;full scale&quot; samples. This means that analogue parts will clip the sound before they get to the A/D convertor. An example is Creative&amp;#039;s AudioPCI card with the 1373 chip. This section of the LP to CDR tips page contains some more information on this topic.\n\nCan I merge files with CD Wave\nMerging is not yet possible, this is on the wish-list for version 2.0. You can download a freeware program to do the merge quite easily. You can find &quot;WavMerge&quot; on Mike Richter&amp;#039;s CDR Resources, files page, under the &quot;Audio files&quot; section.\n\n24-Bit audio\nI get a &quot;No Driver&quot; error?\nThis happened when you try to convert from 24 bit or multichannel audio to other formats (16 bit). For some reason, Microsoft&amp;#039;s built-in sample rate converter cannot handle 24-bit audio yet. There is a better converter in CD Wave, which does all the resampling and conversions by itself, in 1.93 so you should no longer see this error. Internally, CD Wave uses 32-bit processing for all tasks.\n\nShould I always record at 24 bits?\nDefinitely not. Many CD recording programs are unable to process 24-bit audio at all. On most systems, CD Wave cannot convert to 16 bit either. The quality difference between 24 and 16 bit is not as much as hardware vendors will want you to believe, the gain is mostly in allowing more room for processing the audio and for more dynamic range, the difference between soft and loud passages. So if your target is to record a CD, use 16 bit.\n\nOther programs cannot open CD Wave&amp;#039;s file\nMicrosoft defined a new standard for 24-bit and multichannel audio. The rule is that any format that either uses more than 2 channels or more than 16 bit must use the new standard. CD Wave is following on this rule, and writes out WAV files this way. The new format allows to describe what speakers are being used, and how the data bits are ordered.\n\nMany programs do not understand the new format, but use the old format descriptor for a 24-bit WAV file. CD Wave will take an educated guess at the bit ordering and channel assignments, and open the old format. However, it will always write out files in the new format. The effect is that you can playback the files that CD Wave produces with Media Player, but you cannot open these 24-bit files in Sound Forge, for example.\n\nWhen writing a 24 bit file (without conversion), there is a setting to force CD Wave to write out a &quot;backwards compatible&quot; WAV file for 24-bit stereo files.\n\nConverting compressed audio\nHow can I open a MP3 file?\nMP3 files hold audio in a comressed format. CD Wave currently cannot handle compressed audio data. In order to use CD Wave on the files, you will have to convert them first. Note that the decoded files will be much larger than the compressed versions.\n\nHow do I convert files to standard WAV files for CD Wave?\nA freeware program that will let you play and convert various formats is WinAmp. To convert a file, playback the file using the WAV file writer as output device (instead of the sound card). To do this, do the following:\n\nDownload and install the WinAmp program\nRun WinAMP, pop-up the menu\nChoose Options, Preferences\nGo to &quot;Plug-ins&quot;, &quot;Output&quot;\nSelect the &quot;Disk writer&quot; plug-in. Now press &quot;configure&quot; to select the output directory. If you now play an MP3 file, the program will write a WAV file to the selected directory.\n\nBurning\nThe CD(R) I created has two seconds pause between each song.\nYou probably burned the CDR in Track-At-Once mode. In this mode, you can append each track individually, but as the recorder turns off and on between writing each track, it also inserts a pause in between.\n\nTo get a continuous live recording, use Disc-At-Once mode while recording. All tracks on the CD will be written in a single pass, and no pause is inserted between them. Drawback is that you cannot append any more data or audio after a DAO recording.\n\nWhat program should I use to burn the Audio CDR?\nIn general, you will have received some CD authoring program along with the CD recorder. These usually can burn audio CDs as required.\n\nTechnical stuff\nWhy is splitting on 2352 byte/588 sample borders so important?\nA CD audio disc is divided into sectors. Each sector holds 1/75 seconds of audio, or 588 samples at 44100 samples per second, or 2352 bytes. If the size of a WAV recording is not a multiple of 588 samples, the recording software will fill the remainder of the sector with zeroes. If you have a continuous recording (live), you?ll hear a short click in between two songs, as a result of the padding zeroes. To prevent this, the program always cuts on 588 sample borders, so two adjacent songs will have no clicks in between.\n\nBut the wave files are not a multiple of 2352 bytes in size?\nThe reason is that each wave file also contains a header with information on the type of encoding used, the sample rate, the number of samples in the file, the number of channels, etcetera. This header is about 52 bytes in size, but may vary. The last file of a set may also be not aligned, because the original data wasn&amp;#039;t, and CDWave does not add extra padding data to the file.\n\nMust I clip all my files to 2352 borders? Do you have a utility for this?\nNo (2x). Splitting on 2352 borders makes sense, just clipping does not.\nIf the tracks have no relation, i.e. their sound is not continuous, the only way to avoid a click is to make sure that the first track ends in silence and the next starts with silence. You do not have to clip the wave, because the CDR software will pad the remainder of the last sector with silence.\n\nOther systems\nIs there a Macintosh version for CD Wave?\nNo, there&amp;#039;s no Mac version of CD Wave. Since the application was written in Delphi, and is also closely coupled to the Windows API, it will be very hard to port to begin with. Currently, porting would mean completely rewriting the whole program.\n\nHowever, I received reports that the program runs fine under a Windows emulator on the Macintosh, called Virtual PC, made by Connectix.\n\nWill there be a Linux version?\nFirst, we&amp;#039;ll need Delphi to become available on Linux. That&amp;#039;d be great. After that, there might be some possibilities to port it. So, basically, it might be some day, but chances are small. Currently, it&amp;#039;s Windows-only. Maybe it runs under WINE.\n\nRegistration\nI lost my registered version, how can I get it back?\nDonwload the shareware version of CD Wave, it won&amp;#039;t expire or so. Contact me, and mention your name and city where you live (or lived, if you moved after registering). It may take a few weeks to process your request. You will receive a registration key.\n\nAm I entitiled to free upgrades?\nYes, if you register any 1.xx version, you are allowed to upgrade to any 1.xx version at no charge. Thus, if you registered 1.56 one day, you can download and use 1.62 and continue using it without having to reregister.\n\nIf you register (and pay) online, you will be able to download a registered copy (it mentions this fact in the About box). Your registration information will be forwarded to me, so for future versions I know that you&amp;#039;re entitled to use them. Starting with version 1.73 you receive a registration key. With this key, you can change the shareware version into a registered version. If you registered a previous version, contact me, provide the name, place and e-mail that you used for registration and you&amp;#039;ll receive a key in a few weeks.\n\nI will register if that and that function is available.\nYou must be a very well educated person to make this not sound like a threat. Basically, you cannot bend the rules. You can register the program &quot;as is&quot;, which entitles you to a number of free upgrades. If you do not like the program, or feel that some key function is lacking, do not hesitate to write me. But please do not use the above wordings, even if your intentions are good. Actually sending the registration fee does a lot more to encourage me to further develop this product than a promise of sending me money only if I spend some time building a function.\n\nI sent you my registration weeks ago, but haven&amp;#039;t received a reply.\nApart form the CD Wave project, I have a full-time job, a house to take care of, various pets, a girlfriend, and I play in a percussion group, a sort of brassband, i sport a little too. So that means that there are times that I cannot reply in time to each and every request. If you feel I&amp;#039;ve forgotten you, just drop me an e-mail, and i&amp;#039;ll let you know as soon as possible if i can find you in my database.\n\n***\n\nCD Wave is a program designed to aid in CD-Recordable mastering.\nIt was built for splitting WAV files from any source, like LP,\ntape or even CD. After recording, you can let CD Wave automatically\ncalculate split points, or you can manually add and delete split\npoints. After this, you can write out the tracks as individual wave\nfiles and use any CDR mastering program to write a disc that has no\nclicks or pops in between tracks. Also supports 24-bit and surround\naudio.\n\nCD Wave can also act as a simple audio recorder and editor, allowing\nyou to record and playback audio, and cut out parts that you want to\nkeep.\n\nSince CD Wave can read and write CUE sheets, you can also use it as a\nCUE sheet editor for CDRWin.\n\nCD Wave (1.92) can write files in OGG Vorbis format, in FLAC (lossless\ncompression) audio and in MP3 format (if you have the LAME encoder)\ndirectly.","torrent":{"xt":"urn:btih:fceb61adde0d307c03e539c9e113e01cff1440b5","amp;dn":"LAMEWIN32+%28PfP%29+-+LAME+V3.97%2C+RazorLAME+1.1.5a%2C+CD+Wave+1.96.1+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fceb61adde0d307c03e539c9e113e01cff1440b5","infoHashBuffer":{"type":"Buffer","data":[252,235,97,173,222,13,48,124,3,229,57,201,225,19,224,28,255,20,64,181]},"announce":[],"urlList":[]}}