{"title":"BARAKA","uid":3576735,"size":4680841216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff0fd837203a136d6d7ae43b31a3c25d5f9fa4cc&amp;dn=BARAKA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"astark09","files":15,"time":1166119152,"description":"&quot;Baraka (1992) is an experimental documentary film directed by Ron Fricke, cinematographer for Koyaanisqatsi, the first of the Qatsi films by Godfrey Reggio. Often compared to Koyaanisqatsi, Baraka&amp;#039;s subject matter is in fact similar?including footage of various landscapes, churches, ruins, religious ceremonies, and cities thrumming with life, filmed using time-lapse photography in order to capture the great pulse of humanity as it flocks and swarms in daily activity. The film also features a number of long tracking shots through various settings, including ones through former concentration camps at Auschwitz (in Poland) and Tuol Sleng (in Cambodia) turned into museums honoring their victims: over photos of the people involved, past skulls stacked in a room, to a spread of bones. In addition to making comparisons between natural and technological phenomena, such as in Koyaanisqatsi, Baraka searches for a universal cultural perspective: for instance, following a shot of an elaborate tattoo on a Japanese bather with one of Native Australian tribal paint.&quot;\n-Wikipedia","torrent":{"xt":"urn:btih:ff0fd837203a136d6d7ae43b31a3c25d5f9fa4cc","amp;dn":"BARAKA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0fd837203a136d6d7ae43b31a3c25d5f9fa4cc","infoHashBuffer":{"type":"Buffer","data":[255,15,216,55,32,58,19,109,109,122,228,59,49,163,194,93,95,159,164,204]},"announce":[],"urlList":[]}}