{"title":"Gravitation.rar","uid":3572876,"size":1645396640,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ffd4cd08d0aef949ded15aacd3a8481f1e8416c5&amp;dn=Gravitation.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mculver01","files":1,"time":1165584306,"description":"From http://en.wikipedia.org/wiki/Gravitation_(manga):\n\nGravitation (????????, Gurabit?shon?) is a BL (Boys Love) manga series written by Maki Murakami and an anime series derived from it, directed by Bob Shirohata. The story follows the attempts of Shuichi Shindou and his band, Bad Luck, to become Japan&amp;#039;s next musical sensation. Fitting for the subject, the anime features a large amount of music, a diverse set of characters, plenty of comedy and touches of drama and violence.\n\nThe manga originally ended in 2002 after 12 volumes, but new chapters are being serialized in an online manga anthology. The manga has been licensed and is published in English by TOKYOPOP.[1] The Gravitation novel was released in English by TOKYOPOP on March 7, 2006. [2]\n\nThe two episode OVA series was released in 1999. The thirteen-episode TV series aired in Japan from October 4, 2000 to January 10, 2001, on WOWOW satellite channel. The original manga series is written by Maki Murakami and continues the story further than either of the animated series. The anime goes to roughly volume 8 of the manga. The Gravitation TV and OVA series have been licensed for North American release and is available from Right Stuf International on four DVDs. The OVA series is licensed by the same company and is now available. Also, a second novel of Gravitation called Gravitation: Voice of Temptation which is written by Maki Murakami is being published by TOKYOPOP. It is currently in stores.\n------------------------------\n\nALL Episodes including the OAV are included in this .rar.","torrent":{"xt":"urn:btih:ffd4cd08d0aef949ded15aacd3a8481f1e8416c5","amp;dn":"Gravitation.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd4cd08d0aef949ded15aacd3a8481f1e8416c5","infoHashBuffer":{"type":"Buffer","data":[255,212,205,8,208,174,249,73,222,209,90,172,211,168,72,31,30,132,22,197]},"announce":[],"urlList":[]}}